TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:17 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dlog_4ch_f.asm                                                       PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Sat Dec 27 15:00:17 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/dlog_4ch_f.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\JUNLI\workspace_ccstheia\dual_axis_servo_drive_fcl_qep_f28
      13              ;       D:\TI\ccs\tools\compiler\ti-cgt-c2000_22.6.2.LTS\bin\opt2000.exe C:\\Users\\JUNLI\\AppData\\Local\\Te

     256 0000004c E2AF          MOV32     R1H,*+XAR5[0]         ; [CPU_FPU] |77| 
         0000004d 01C5 
     257 0000004e E694          CMPF32    R1H,R0H               ; [CPU_FPU] |77| 
         0000004f 0001 
     258 00000050 AD14          MOVST0    ZF, NF                ; [CPU_FPU] |77| 
     259 00000051 650B          B         ||$C$L3||,LEQ         ; [CPU_ALU] |77| 
     260                      ; branchcc occurs ; [] |77| 
     261 00000052 D010          MOVB      XAR0,#16              ; [CPU_ALU] |77| 
     262 00000053 E2AF          MOV32     R1H,*+XAR4[AR0]       ; [CPU_FPU] |77| 
         00000054 0194 
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:17 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dlog_4ch_f.asm                                                       PAGE    6

     263 00000055 E694          CMPF32    R1H,R0H               ; [CPU_FPU] |77| 
         00000056 0001 
     264 00000057 AD14          MOVST0    ZF, NF                ; [CPU_FPU] |77| 
     265                      .dwpsn  file "../sources/dlog_4ch_f.c",line 81,column 17,is_stmt,isa 0
     266 00000058 56B4          MOVB      XAR0,#20,LT           ; [CPU_ALU] |81| 
         00000059 14A0 
     267 0000005a 56B4          MOVB      *+XAR4[AR0],#2,LT     ; [CPU_ALU] |81| 
         0000005b 0294 
     268 0000005c       ||$C$L3||:    
     269                      .dwpsn  file "../sources/dlog_4ch_f.c",line 106,column 2,is_stmt,isa 0
     270 0000005c 83C4          MOVL      XAR5,*+XAR4[0]        ; [CPU_ALU] |106| 
     271 0000005d D010          MOVB      XAR0,#16              ; [CPU_ALU] |106| 
     272 0000005e 06C5          MOVL      ACC,*+XAR5[0]         ; [CPU_ALU] |106| 
     273 0000005f FE82          SUBB      SP,#2                 ; [CPU_ARAU] 
     274                      .dwcfi  cfa_offset, -4
     275 00000060 1E94          MOVL      *+XAR4[AR0],ACC       ; [CPU_ALU] |106| 
     276 00000061 8BBE          MOVL      XAR1,*--SP            ; [CPU_ALU] 
     277                      .dwcfi  cfa_offset, -2
     278                      .dwcfi  restore_reg, 7
     279              $C$DW$8 .dwtag  DW_TAG_TI_branch
     280                      .dwattr $C$DW$8, DW_AT_low_pc(0x00)
     281                      .dwattr $C$DW$8, DW_AT_TI_return
     282              
     283 00000062 0006          LRETR     ; [CPU_ALU] 
     284                      ; return occurs ; [] 
     285                      .dwattr $C$DW$5, DW_AT_TI_end_file("../sources/dlog_4ch_f.c")
     286                      .dwattr $C$DW$5, DW_AT_TI_end_line(0x6b)
     287                      .dwattr $C$DW$5, DW_AT_TI_end_column(0x01)
     288                      .dwendentry
     289                      .dwendtag $C$DW$5
     290              
     291              
     292              ;***************************************************************
     293              ;* BUILD ATTRIBUTES                                            *
     294              ;***************************************************************
     295                      .battr "c28xabi", Tag_File, 1, Tag_float_args(0)
     296                      .battr "c28xabi", Tag_File, 1, Tag_double_args(0)
     297                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
     298              
     299              ;***************************************************************
     300              ;* DWARF CIE ENTRIES                                           *
     301              ;***************************************************************
     302              
     303              $C$DW$CIE       .dwcie 26
     304                      .dwcfi  cfa_register, 20
     305                      .dwcfi  cfa_offset, 0
     306                      .dwcfi  same_value, 28
     307                      .dwcfi  same_value, 6
     308                      .dwcfi  same_value, 7
     309                      .dwcfi  same_value, 8
     310                      .dwcfi  same_value, 9
     311                      .dwcfi  same_value, 10
     312                      .dwcfi  same_value, 11
     313                      .dwcfi  same_value, 59
     314                      .dwcfi  same_value, 63
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:17 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dlog_4ch_f.asm                                                       PAGE    7

     315                      .dwcfi  same_value, 67
     316                      .dwcfi  same_value, 71
     317                      .dwendentry
     318                      .dwendtag $C$DW$CU
     319              
     320              
     321              ;***************************************************************
     322              ;* TYPE INFORMATION                                            *
     323              ;***************************************************************
     324              
     325              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
     326                      .dwmtype  $C$DW$T$23
     327              
     328              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     329                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x1a)
     330              $C$DW$9 .dwtag  DW_TAG_member
     331                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$20)
     332                      .dwattr $C$DW$9, DW_AT_name("input_ptr1")
     333                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     334                      .dwattr $C$DW$9, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utiliti
     335                      .dwattr $C$DW$9, DW_AT_decl_line(0x3c)
     336                      .dwattr $C$DW$9, DW_AT_decl_column(0x0d)
     337              
     338              $C$DW$10        .dwtag  DW_TAG_member
     339                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$20)
     340                      .dwattr $C$DW$10, DW_AT_name("input_ptr2")
     341                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     342                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     343                      .dwattr $C$DW$10, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilit
     344                      .dwattr $C$DW$10, DW_AT_decl_line(0x3d)
     345                      .dwattr $C$DW$10, DW_AT_decl_column(0x0d)
     346              
     347              $C$DW$11        .dwtag  DW_TAG_member
     348                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$20)
     349                      .dwattr $C$DW$11, DW_AT_name("input_ptr3")
     350                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     351                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     352                      .dwattr $C$DW$11, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilit
     353                      .dwattr $C$DW$11, DW_AT_decl_line(0x3e)
     354                      .dwattr $C$DW$11, DW_AT_decl_column(0x0d)
     355              
     356              $C$DW$12        .dwtag  DW_TAG_member
     357                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$20)
     358                      .dwattr $C$DW$12, DW_AT_name("input_ptr4")
     359                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     360                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     361                      .dwattr $C$DW$12, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilit
     362                      .dwattr $C$DW$12, DW_AT_decl_line(0x3f)
     363                      .dwattr $C$DW$12, DW_AT_decl_column(0x0d)
     364              
     365              $C$DW$13        .dwtag  DW_TAG_member
     366                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$20)
     367                      .dwattr $C$DW$13, DW_AT_name("output_ptr1")
     368                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     369                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:17 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dlog_4ch_f.asm                                                       PAGE    8

     370                      .dwattr $C$DW$13, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilit
     371                      .dwattr $C$DW$13, DW_AT_decl_line(0x40)
     372                      .dwattr $C$DW$13, DW_AT_decl_column(0x0d)
     373              
     374              $C$DW$14        .dwtag  DW_TAG_member
     375                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$20)
     376                      .dwattr $C$DW$14, DW_AT_name("output_ptr2")
     377                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     378                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     379                      .dwattr $C$DW$14, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilit
     380                      .dwattr $C$DW$14, DW_AT_decl_line(0x41)
     381                      .dwattr $C$DW$14, DW_AT_decl_column(0x0d)
     382              
     383              $C$DW$15        .dwtag  DW_TAG_member
     384                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$20)
     385                      .dwattr $C$DW$15, DW_AT_name("output_ptr3")
     386                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     387                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     388                      .dwattr $C$DW$15, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilit
     389                      .dwattr $C$DW$15, DW_AT_decl_line(0x42)
     390                      .dwattr $C$DW$15, DW_AT_decl_column(0x0d)
     391              
     392              $C$DW$16        .dwtag  DW_TAG_member
     393                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$20)
     394                      .dwattr $C$DW$16, DW_AT_name("output_ptr4")
     395                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     396                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     397                      .dwattr $C$DW$16, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilit
     398                      .dwattr $C$DW$16, DW_AT_decl_line(0x43)
     399                      .dwattr $C$DW$16, DW_AT_decl_column(0x0d)
     400              
     401              $C$DW$17        .dwtag  DW_TAG_member
     402                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     403                      .dwattr $C$DW$17, DW_AT_name("prev_value")
     404                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     405                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     406                      .dwattr $C$DW$17, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilit
     407                      .dwattr $C$DW$17, DW_AT_decl_line(0x44)
     408                      .dwattr $C$DW$17, DW_AT_decl_column(0x0c)
     409              
     410              $C$DW$18        .dwtag  DW_TAG_member
     411                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     412                      .dwattr $C$DW$18, DW_AT_name("trig_value")
     413                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     414                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     415                      .dwattr $C$DW$18, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilit
     416                      .dwattr $C$DW$18, DW_AT_decl_line(0x45)
     417                      .dwattr $C$DW$18, DW_AT_decl_column(0x0c)
     418              
     419              $C$DW$19        .dwtag  DW_TAG_member
     420                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$22)
     421                      .dwattr $C$DW$19, DW_AT_name("status")
     422                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     423                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     424                      .dwattr $C$DW$19, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilit
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:17 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dlog_4ch_f.asm                                                       PAGE    9

     425                      .dwattr $C$DW$19, DW_AT_decl_line(0x46)
     426                      .dwattr $C$DW$19, DW_AT_decl_column(0x0a)
     427              
     428              $C$DW$20        .dwtag  DW_TAG_member
     429                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$22)
     430                      .dwattr $C$DW$20, DW_AT_name("pre_scalar")
     431                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     432                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     433                      .dwattr $C$DW$20, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilit
     434                      .dwattr $C$DW$20, DW_AT_decl_line(0x47)
     435                      .dwattr $C$DW$20, DW_AT_decl_column(0x0a)
     436              
     437              $C$DW$21        .dwtag  DW_TAG_member
     438                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$22)
     439                      .dwattr $C$DW$21, DW_AT_name("skip_count")
     440                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     441                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     442                      .dwattr $C$DW$21, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilit
     443                      .dwattr $C$DW$21, DW_AT_decl_line(0x48)
     444                      .dwattr $C$DW$21, DW_AT_decl_column(0x0a)
     445              
     446              $C$DW$22        .dwtag  DW_TAG_member
     447                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$22)
     448                      .dwattr $C$DW$22, DW_AT_name("size")
     449                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     450                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     451                      .dwattr $C$DW$22, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilit
     452                      .dwattr $C$DW$22, DW_AT_decl_line(0x49)
     453                      .dwattr $C$DW$22, DW_AT_decl_column(0x0a)
     454              
     455              $C$DW$23        .dwtag  DW_TAG_member
     456                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$22)
     457                      .dwattr $C$DW$23, DW_AT_name("count")
     458                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     459                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     460                      .dwattr $C$DW$23, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utilit
     461                      .dwattr $C$DW$23, DW_AT_decl_line(0x4a)
     462                      .dwattr $C$DW$23, DW_AT_decl_column(0x0a)
     463              
     464                      .dwattr $C$DW$T$23, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
     465                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x3b)
     466                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x0f)
     467                      .dwendtag $C$DW$T$23
     468              
     469                      .dwendtag $C$DW$TU$23
     470              
     471              
     472              $C$DW$TU$24     .dwtag  DW_TAG_type_unit
     473                      .dwmtype  $C$DW$T$24
     474              $C$DW$T$24      .dwtag  DW_TAG_typedef
     475                      .dwattr $C$DW$T$24, DW_AT_name("DLOG_4CH_F")
     476                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     477                      .dwattr $C$DW$T$24, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
     478                      .dwattr $C$DW$T$24, DW_AT_decl_line(0x4b)
     479                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x02)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:17 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dlog_4ch_f.asm                                                       PAGE   10

     480              
     481                      .dwendtag $C$DW$TU$24
     482              
     483              
     484              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
     485                      .dwmtype  $C$DW$T$25
     486              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
     487                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
     488                      .dwattr $C$DW$T$25, DW_AT_address_class(0x20)
     489              
     490                      .dwendtag $C$DW$TU$25
     491              
     492              
     493              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
     494                      .dwmtype  $C$DW$T$26
     495              $C$DW$24        .dwtag  DW_TAG_TI_far_type
     496                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$25)
     497              
     498              $C$DW$T$26      .dwtag  DW_TAG_const_type
     499                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$24)
     500              
     501                      .dwendtag $C$DW$TU$26
     502              
     503              
     504              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
     505                      .dwmtype  $C$DW$T$2
     506              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     507                      .dwattr $C$DW$T$2, DW_AT_name("void")
     508              
     509                      .dwendtag $C$DW$TU$2
     510              
     511              
     512              $C$DW$TU$4      .dwtag  DW_TAG_type_unit
     513                      .dwmtype  $C$DW$T$4
     514              $C$DW$T$4       .dwtag  DW_TAG_base_type
     515                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     516                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     517                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     518              
     519                      .dwendtag $C$DW$TU$4
     520              
     521              
     522              $C$DW$TU$5      .dwtag  DW_TAG_type_unit
     523                      .dwmtype  $C$DW$T$5
     524              $C$DW$T$5       .dwtag  DW_TAG_base_type
     525                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
