TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Sat Dec 27 15:00:17 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/dual_axis_servo_drive.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\JUNLI\workspace_ccstheia\dual_axis_servo_drive_fcl_qep_f28
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("FCL_runPICtrl_M1")
      16                      .dwattr $C$DW$1, DW_AT_linkage_name("FCL_runPICtrl_M1")

    8813              $C$DW$419       .dwtag  DW_TAG_enumerator
    8814                      .dwattr $C$DW$419, DW_AT_name("SYSCTL_PERIPH_CLK_DACB")
    8815                      .dwattr $C$DW$419, DW_AT_const_value(0x1110)
    8816                      .dwattr $C$DW$419, DW_AT_decl_file("D:\TI\c2000\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\drive
    8817                      .dwattr $C$DW$419, DW_AT_decl_line(0x1c0)
    8818                      .dwattr $C$DW$419, DW_AT_decl_column(0x05)
    8819              
    8820              $C$DW$420       .dwtag  DW_TAG_enumerator
    8821                      .dwattr $C$DW$420, DW_AT_name("SYSCTL_PERIPH_CLK_DACC")
    8822                      .dwattr $C$DW$420, DW_AT_const_value(0x1210)
    8823                      .dwattr $C$DW$420, DW_AT_decl_file("D:\TI\c2000\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\drive
    8824                      .dwattr $C$DW$420, DW_AT_decl_line(0x1c1)
    8825                      .dwattr $C$DW$420, DW_AT_decl_column(0x05)
    8826              
    8827                      .dwattr $C$DW$T$110, DW_AT_decl_file("D:\TI\c2000\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\dri
    8828                      .dwattr $C$DW$T$110, DW_AT_decl_line(0x182)
    8829                      .dwattr $C$DW$T$110, DW_AT_decl_column(0x01)
    8830                      .dwendtag $C$DW$T$110
    8831              
    8832                      .dwendtag $C$DW$TU$110
    8833              
    8834              
    8835              $C$DW$TU$111    .dwtag  DW_TAG_type_unit
    8836                      .dwmtype  $C$DW$T$111
    8837              $C$DW$T$111     .dwtag  DW_TAG_typedef
    8838                      .dwattr $C$DW$T$111, DW_AT_name("SysCtl_PeripheralPCLOCKCR")
    8839                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
    8840                      .dwattr $C$DW$T$111, DW_AT_decl_file("D:\TI\c2000\C2000Ware_MotorControl_SDK_5_04_00_00\c2000ware\dri
    8841                      .dwattr $C$DW$T$111, DW_AT_decl_line(0x1c2)
    8842                      .dwattr $C$DW$T$111, DW_AT_decl_column(0x03)
    8843              
    8844                      .dwendtag $C$DW$TU$111
    8845              
    8846              
    8847              $C$DW$TU$112    .dwtag  DW_TAG_type_unit
    8848                      .dwmtype  $C$DW$T$112
    8849              
    8850              $C$DW$T$112     .dwtag  DW_TAG_enumeration_type
    8851                      .dwattr $C$DW$T$112, DW_AT_byte_size(0x01)
    8852              $C$DW$421       .dwtag  DW_TAG_enumerator
    8853                      .dwattr $C$DW$421, DW_AT_name("MTR_1")
    8854                      .dwattr $C$DW$421, DW_AT_const_value(0x00)
    8855                      .dwattr $C$DW$421, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/solutions/boost
    8856                      .dwattr $C$DW$421, DW_AT_decl_line(0x7b)
    8857                      .dwattr $C$DW$421, DW_AT_decl_column(0x03)
    8858              
    8859              $C$DW$422       .dwtag  DW_TAG_enumerator
    8860                      .dwattr $C$DW$422, DW_AT_name("MTR_2")
    8861                      .dwattr $C$DW$422, DW_AT_const_value(0x01)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  187

    8862                      .dwattr $C$DW$422, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/solutions/boost
    8863                      .dwattr $C$DW$422, DW_AT_decl_line(0x7c)
    8864                      .dwattr $C$DW$422, DW_AT_decl_column(0x03)
    8865              
    8866                      .dwattr $C$DW$T$112, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/solutions/boo
    8867                      .dwattr $C$DW$T$112, DW_AT_decl_line(0x7a)
    8868                      .dwattr $C$DW$T$112, DW_AT_decl_column(0x01)
    8869                      .dwendtag $C$DW$T$112
    8870              
    8871                      .dwendtag $C$DW$TU$112
    8872              
    8873              
    8874              $C$DW$TU$113    .dwtag  DW_TAG_type_unit
    8875                      .dwmtype  $C$DW$T$113
    8876              $C$DW$T$113     .dwtag  DW_TAG_typedef
    8877                      .dwattr $C$DW$T$113, DW_AT_name("MOTOR_Num_e")
    8878                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
    8879                      .dwattr $C$DW$T$113, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/solutions/boo
    8880                      .dwattr $C$DW$T$113, DW_AT_decl_line(0x7d)
    8881                      .dwattr $C$DW$T$113, DW_AT_decl_column(0x03)
    8882              
    8883                      .dwendtag $C$DW$TU$113
    8884              
    8885              
    8886              $C$DW$TU$20     .dwtag  DW_TAG_type_unit
    8887                      .dwmtype  $C$DW$T$20
    8888              
    8889              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    8890                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0c)
    8891              $C$DW$423       .dwtag  DW_TAG_member
    8892                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$19)
    8893                      .dwattr $C$DW$423, DW_AT_name("Freq")
    8894                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    8895                      .dwattr $C$DW$423, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    8896                      .dwattr $C$DW$423, DW_AT_decl_line(0x29)
    8897                      .dwattr $C$DW$423, DW_AT_decl_column(0x1d)
    8898              
    8899              $C$DW$424       .dwtag  DW_TAG_member
    8900                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$19)
    8901                      .dwattr $C$DW$424, DW_AT_name("StepAngleMax")
    8902                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8903                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    8904                      .dwattr $C$DW$424, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    8905                      .dwattr $C$DW$424, DW_AT_decl_line(0x2a)
    8906                      .dwattr $C$DW$424, DW_AT_decl_column(0x11)
    8907              
    8908              $C$DW$425       .dwtag  DW_TAG_member
    8909                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$19)
    8910                      .dwattr $C$DW$425, DW_AT_name("Angle")
    8911                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8912                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    8913                      .dwattr $C$DW$425, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    8914                      .dwattr $C$DW$425, DW_AT_decl_line(0x2b)
    8915                      .dwattr $C$DW$425, DW_AT_decl_column(0x11)
    8916              
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  188

    8917              $C$DW$426       .dwtag  DW_TAG_member
    8918                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$19)
    8919                      .dwattr $C$DW$426, DW_AT_name("Gain")
    8920                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8921                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    8922                      .dwattr $C$DW$426, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    8923                      .dwattr $C$DW$426, DW_AT_decl_line(0x2c)
    8924                      .dwattr $C$DW$426, DW_AT_decl_column(0x11)
    8925              
    8926              $C$DW$427       .dwtag  DW_TAG_member
    8927                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$19)
    8928                      .dwattr $C$DW$427, DW_AT_name("Out")
    8929                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8930                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    8931                      .dwattr $C$DW$427, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    8932                      .dwattr $C$DW$427, DW_AT_decl_line(0x2d)
    8933                      .dwattr $C$DW$427, DW_AT_decl_column(0x11)
    8934              
    8935              $C$DW$428       .dwtag  DW_TAG_member
    8936                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$19)
    8937                      .dwattr $C$DW$428, DW_AT_name("Offset")
    8938                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8939                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    8940                      .dwattr $C$DW$428, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    8941                      .dwattr $C$DW$428, DW_AT_decl_line(0x2e)
    8942                      .dwattr $C$DW$428, DW_AT_decl_column(0x11)
    8943              
    8944                      .dwattr $C$DW$T$20, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    8945                      .dwattr $C$DW$T$20, DW_AT_decl_line(0x29)
    8946                      .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    8947                      .dwendtag $C$DW$T$20
    8948              
    8949                      .dwendtag $C$DW$TU$20
    8950              
    8951              
    8952              $C$DW$TU$114    .dwtag  DW_TAG_type_unit
    8953                      .dwmtype  $C$DW$T$114
    8954              $C$DW$T$114     .dwtag  DW_TAG_typedef
    8955                      .dwattr $C$DW$T$114, DW_AT_name("RAMPGEN")
    8956                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$20)
    8957                      .dwattr $C$DW$T$114, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/uti
    8958                      .dwattr $C$DW$T$114, DW_AT_decl_line(0x2f)
    8959                      .dwattr $C$DW$T$114, DW_AT_decl_column(0x0d)
    8960              
    8961                      .dwendtag $C$DW$TU$114
    8962              
    8963              
    8964              $C$DW$TU$115    .dwtag  DW_TAG_type_unit
    8965                      .dwmtype  $C$DW$T$115
    8966              $C$DW$T$115     .dwtag  DW_TAG_pointer_type
    8967                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$114)
    8968                      .dwattr $C$DW$T$115, DW_AT_address_class(0x20)
    8969              
    8970                      .dwendtag $C$DW$TU$115
    8971              
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  189

    8972              
    8973              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
    8974                      .dwmtype  $C$DW$T$23
    8975              
    8976              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    8977                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x10)
    8978              $C$DW$429       .dwtag  DW_TAG_member
    8979                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$19)
    8980                      .dwattr $C$DW$429, DW_AT_name("TargetValue")
    8981                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    8982                      .dwattr $C$DW$429, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    8983                      .dwattr $C$DW$429, DW_AT_decl_line(0x2b)
    8984                      .dwattr $C$DW$429, DW_AT_decl_column(0x0f)
    8985              
    8986              $C$DW$430       .dwtag  DW_TAG_member
    8987                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$22)
    8988                      .dwattr $C$DW$430, DW_AT_name("RampDelayMax")
    8989                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8990                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    8991                      .dwattr $C$DW$430, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    8992                      .dwattr $C$DW$430, DW_AT_decl_line(0x2c)
    8993                      .dwattr $C$DW$430, DW_AT_decl_column(0x0f)
    8994              
    8995              $C$DW$431       .dwtag  DW_TAG_member
    8996                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$19)
    8997                      .dwattr $C$DW$431, DW_AT_name("RampLowLimit")
    8998                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8999                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    9000                      .dwattr $C$DW$431, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9001                      .dwattr $C$DW$431, DW_AT_decl_line(0x2d)
    9002                      .dwattr $C$DW$431, DW_AT_decl_column(0x0f)
    9003              
    9004              $C$DW$432       .dwtag  DW_TAG_member
    9005                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$19)
    9006                      .dwattr $C$DW$432, DW_AT_name("RampHighLimit")
    9007                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9008                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    9009                      .dwattr $C$DW$432, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9010                      .dwattr $C$DW$432, DW_AT_decl_line(0x2e)
    9011                      .dwattr $C$DW$432, DW_AT_decl_column(0x0f)
    9012              
    9013              $C$DW$433       .dwtag  DW_TAG_member
    9014                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$22)
    9015                      .dwattr $C$DW$433, DW_AT_name("RampDelayCount")
    9016                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9017                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    9018                      .dwattr $C$DW$433, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9019                      .dwattr $C$DW$433, DW_AT_decl_line(0x2f)
    9020                      .dwattr $C$DW$433, DW_AT_decl_column(0x0c)
    9021              
    9022              $C$DW$434       .dwtag  DW_TAG_member
    9023                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$19)
    9024                      .dwattr $C$DW$434, DW_AT_name("SetpointValue")
    9025                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9026                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  190

    9027                      .dwattr $C$DW$434, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9028                      .dwattr $C$DW$434, DW_AT_decl_line(0x30)
    9029                      .dwattr $C$DW$434, DW_AT_decl_column(0x0c)
    9030              
    9031              $C$DW$435       .dwtag  DW_TAG_member
    9032                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$22)
    9033                      .dwattr $C$DW$435, DW_AT_name("EqualFlag")
    9034                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9035                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    9036                      .dwattr $C$DW$435, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9037                      .dwattr $C$DW$435, DW_AT_decl_line(0x31)
    9038                      .dwattr $C$DW$435, DW_AT_decl_column(0x0c)
    9039              
    9040              $C$DW$436       .dwtag  DW_TAG_member
    9041                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$19)
    9042                      .dwattr $C$DW$436, DW_AT_name("Tmp")
    9043                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9044                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    9045                      .dwattr $C$DW$436, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9046                      .dwattr $C$DW$436, DW_AT_decl_line(0x32)
    9047                      .dwattr $C$DW$436, DW_AT_decl_column(0x0c)
    9048              
    9049                      .dwattr $C$DW$T$23, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    9050                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x2a)
    9051                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
    9052                      .dwendtag $C$DW$T$23
    9053              
    9054                      .dwendtag $C$DW$TU$23
    9055              
    9056              
    9057              $C$DW$TU$91     .dwtag  DW_TAG_type_unit
    9058                      .dwmtype  $C$DW$T$91
    9059              $C$DW$T$91      .dwtag  DW_TAG_typedef
    9060                      .dwattr $C$DW$T$91, DW_AT_name("RMPCNTL")
    9061                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$23)
    9062                      .dwattr $C$DW$T$91, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    9063                      .dwattr $C$DW$T$91, DW_AT_decl_line(0x33)
    9064                      .dwattr $C$DW$T$91, DW_AT_decl_column(0x03)
    9065              
    9066                      .dwendtag $C$DW$TU$91
    9067              
    9068              
    9069              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    9070                      .dwmtype  $C$DW$T$26
    9071              
    9072              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    9073                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x14)
    9074              $C$DW$437       .dwtag  DW_TAG_member
    9075                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$19)
    9076                      .dwattr $C$DW$437, DW_AT_name("ElecTheta")
    9077                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    9078                      .dwattr $C$DW$437, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9079                      .dwattr $C$DW$437, DW_AT_decl_line(0x2b)
    9080                      .dwattr $C$DW$437, DW_AT_decl_column(0x12)
    9081              
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  191

    9082              $C$DW$438       .dwtag  DW_TAG_member
    9083                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$22)
    9084                      .dwattr $C$DW$438, DW_AT_name("DirectionQep")
    9085                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9086                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    9087                      .dwattr $C$DW$438, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9088                      .dwattr $C$DW$438, DW_AT_decl_line(0x2c)
    9089                      .dwattr $C$DW$438, DW_AT_decl_column(0x11)
    9090              
    9091              $C$DW$439       .dwtag  DW_TAG_member
    9092                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$19)
    9093                      .dwattr $C$DW$439, DW_AT_name("OldElecTheta")
    9094                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9095                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    9096                      .dwattr $C$DW$439, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9097                      .dwattr $C$DW$439, DW_AT_decl_line(0x2d)
    9098                      .dwattr $C$DW$439, DW_AT_decl_column(0x12)
    9099              
    9100              $C$DW$440       .dwtag  DW_TAG_member
    9101                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$19)
    9102                      .dwattr $C$DW$440, DW_AT_name("Speed")
    9103                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9104                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    9105                      .dwattr $C$DW$440, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9106                      .dwattr $C$DW$440, DW_AT_decl_line(0x2e)
    9107                      .dwattr $C$DW$440, DW_AT_decl_column(0x12)
    9108              
    9109              $C$DW$441       .dwtag  DW_TAG_member
    9110                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$22)
    9111                      .dwattr $C$DW$441, DW_AT_name("BaseRpm")
    9112                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9113                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    9114                      .dwattr $C$DW$441, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9115                      .dwattr $C$DW$441, DW_AT_decl_line(0x2f)
    9116                      .dwattr $C$DW$441, DW_AT_decl_column(0x11)
    9117              
    9118              $C$DW$442       .dwtag  DW_TAG_member
    9119                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$19)
    9120                      .dwattr $C$DW$442, DW_AT_name("K1")
    9121                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9122                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    9123                      .dwattr $C$DW$442, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9124                      .dwattr $C$DW$442, DW_AT_decl_line(0x30)
    9125                      .dwattr $C$DW$442, DW_AT_decl_column(0x12)
    9126              
    9127              $C$DW$443       .dwtag  DW_TAG_member
    9128                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$19)
    9129                      .dwattr $C$DW$443, DW_AT_name("K2")
    9130                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9131                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    9132                      .dwattr $C$DW$443, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9133                      .dwattr $C$DW$443, DW_AT_decl_line(0x31)
    9134                      .dwattr $C$DW$443, DW_AT_decl_column(0x12)
    9135              
    9136              $C$DW$444       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  192

    9137                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$19)
    9138                      .dwattr $C$DW$444, DW_AT_name("K3")
    9139                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9140                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    9141                      .dwattr $C$DW$444, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9142                      .dwattr $C$DW$444, DW_AT_decl_line(0x32)
    9143                      .dwattr $C$DW$444, DW_AT_decl_column(0x12)
    9144              
    9145              $C$DW$445       .dwtag  DW_TAG_member
    9146                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$25)
    9147                      .dwattr $C$DW$445, DW_AT_name("SpeedRpm")
    9148                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9149                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    9150                      .dwattr $C$DW$445, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9151                      .dwattr $C$DW$445, DW_AT_decl_line(0x33)
    9152                      .dwattr $C$DW$445, DW_AT_decl_column(0x10)
    9153              
    9154              $C$DW$446       .dwtag  DW_TAG_member
    9155                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$19)
    9156                      .dwattr $C$DW$446, DW_AT_name("Tmp")
    9157                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9158                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    9159                      .dwattr $C$DW$446, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9160                      .dwattr $C$DW$446, DW_AT_decl_line(0x34)
    9161                      .dwattr $C$DW$446, DW_AT_decl_column(0x12)
    9162              
    9163                      .dwattr $C$DW$T$26, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    9164                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x2a)
    9165                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    9166                      .dwendtag $C$DW$T$26
    9167              
    9168                      .dwendtag $C$DW$TU$26
    9169              
    9170              
    9171              $C$DW$TU$95     .dwtag  DW_TAG_type_unit
    9172                      .dwmtype  $C$DW$T$95
    9173              $C$DW$T$95      .dwtag  DW_TAG_typedef
    9174                      .dwattr $C$DW$T$95, DW_AT_name("SPEED_MEAS_QEP")
    9175                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$26)
    9176                      .dwattr $C$DW$T$95, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    9177                      .dwattr $C$DW$T$95, DW_AT_decl_line(0x35)
    9178                      .dwattr $C$DW$T$95, DW_AT_decl_column(0x0a)
    9179              
    9180                      .dwendtag $C$DW$TU$95
    9181              
    9182              
    9183              $C$DW$TU$27     .dwtag  DW_TAG_type_unit
    9184                      .dwmtype  $C$DW$T$27
    9185              
    9186              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    9187                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0a)
    9188              $C$DW$447       .dwtag  DW_TAG_member
    9189                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$19)
    9190                      .dwattr $C$DW$447, DW_AT_name("Ref")
    9191                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  193

    9192                      .dwattr $C$DW$447, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9193                      .dwattr $C$DW$447, DW_AT_decl_line(0x2a)
    9194                      .dwattr $C$DW$447, DW_AT_decl_column(0x1e)
    9195              
    9196              $C$DW$448       .dwtag  DW_TAG_member
    9197                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$19)
    9198                      .dwattr $C$DW$448, DW_AT_name("Fbk")
    9199                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9200                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    9201                      .dwattr $C$DW$448, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9202                      .dwattr $C$DW$448, DW_AT_decl_line(0x2b)
    9203                      .dwattr $C$DW$448, DW_AT_decl_column(0x12)
    9204              
    9205              $C$DW$449       .dwtag  DW_TAG_member
    9206                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$19)
    9207                      .dwattr $C$DW$449, DW_AT_name("Out")
    9208                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9209                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    9210                      .dwattr $C$DW$449, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9211                      .dwattr $C$DW$449, DW_AT_decl_line(0x2c)
    9212                      .dwattr $C$DW$449, DW_AT_decl_column(0x12)
    9213              
    9214              $C$DW$450       .dwtag  DW_TAG_member
    9215                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$19)
    9216                      .dwattr $C$DW$450, DW_AT_name("c1")
    9217                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9218                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    9219                      .dwattr $C$DW$450, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9220                      .dwattr $C$DW$450, DW_AT_decl_line(0x2d)
    9221                      .dwattr $C$DW$450, DW_AT_decl_column(0x12)
    9222              
    9223              $C$DW$451       .dwtag  DW_TAG_member
    9224                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$19)
    9225                      .dwattr $C$DW$451, DW_AT_name("c2")
    9226                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9227                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    9228                      .dwattr $C$DW$451, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9229                      .dwattr $C$DW$451, DW_AT_decl_line(0x2e)
    9230                      .dwattr $C$DW$451, DW_AT_decl_column(0x12)
    9231              
    9232                      .dwattr $C$DW$T$27, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    9233                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x2a)
    9234                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    9235                      .dwendtag $C$DW$T$27
    9236              
    9237                      .dwendtag $C$DW$TU$27
    9238              
    9239              
    9240              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    9241                      .dwmtype  $C$DW$T$30
    9242              $C$DW$T$30      .dwtag  DW_TAG_typedef
    9243                      .dwattr $C$DW$T$30, DW_AT_name("PID_TERMINALS")
    9244                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$27)
    9245                      .dwattr $C$DW$T$30, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    9246                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x2f)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  194

    9247                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x07)
    9248              
    9249                      .dwendtag $C$DW$TU$30
    9250              
    9251              
    9252              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    9253                      .dwmtype  $C$DW$T$28
    9254              
    9255              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    9256                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0e)
    9257              $C$DW$452       .dwtag  DW_TAG_member
    9258                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$19)
    9259                      .dwattr $C$DW$452, DW_AT_name("Kr")
    9260                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    9261                      .dwattr $C$DW$452, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9262                      .dwattr $C$DW$452, DW_AT_decl_line(0x32)
    9263                      .dwattr $C$DW$452, DW_AT_decl_column(0x1e)
    9264              
    9265              $C$DW$453       .dwtag  DW_TAG_member
    9266                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$19)
    9267                      .dwattr $C$DW$453, DW_AT_name("Kp")
    9268                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9269                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    9270                      .dwattr $C$DW$453, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9271                      .dwattr $C$DW$453, DW_AT_decl_line(0x33)
    9272                      .dwattr $C$DW$453, DW_AT_decl_column(0x12)
    9273              
    9274              $C$DW$454       .dwtag  DW_TAG_member
    9275                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$19)
    9276                      .dwattr $C$DW$454, DW_AT_name("Ki")
    9277                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9278                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    9279                      .dwattr $C$DW$454, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9280                      .dwattr $C$DW$454, DW_AT_decl_line(0x34)
    9281                      .dwattr $C$DW$454, DW_AT_decl_column(0x12)
    9282              
    9283              $C$DW$455       .dwtag  DW_TAG_member
    9284                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$19)
    9285                      .dwattr $C$DW$455, DW_AT_name("Kd")
    9286                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9287                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    9288                      .dwattr $C$DW$455, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9289                      .dwattr $C$DW$455, DW_AT_decl_line(0x35)
    9290                      .dwattr $C$DW$455, DW_AT_decl_column(0x12)
    9291              
    9292              $C$DW$456       .dwtag  DW_TAG_member
    9293                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$19)
    9294                      .dwattr $C$DW$456, DW_AT_name("Km")
    9295                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9296                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    9297                      .dwattr $C$DW$456, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9298                      .dwattr $C$DW$456, DW_AT_decl_line(0x36)
    9299                      .dwattr $C$DW$456, DW_AT_decl_column(0x12)
    9300              
    9301              $C$DW$457       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  195

    9302                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$19)
    9303                      .dwattr $C$DW$457, DW_AT_name("Umax")
    9304                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9305                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    9306                      .dwattr $C$DW$457, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9307                      .dwattr $C$DW$457, DW_AT_decl_line(0x37)
    9308                      .dwattr $C$DW$457, DW_AT_decl_column(0x12)
    9309              
    9310              $C$DW$458       .dwtag  DW_TAG_member
    9311                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$19)
    9312                      .dwattr $C$DW$458, DW_AT_name("Umin")
    9313                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9314                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    9315                      .dwattr $C$DW$458, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9316                      .dwattr $C$DW$458, DW_AT_decl_line(0x38)
    9317                      .dwattr $C$DW$458, DW_AT_decl_column(0x12)
    9318              
    9319                      .dwattr $C$DW$T$28, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    9320                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x32)
    9321                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    9322                      .dwendtag $C$DW$T$28
    9323              
    9324                      .dwendtag $C$DW$TU$28
    9325              
    9326              
    9327              $C$DW$TU$31     .dwtag  DW_TAG_type_unit
    9328                      .dwmtype  $C$DW$T$31
    9329              $C$DW$T$31      .dwtag  DW_TAG_typedef
    9330                      .dwattr $C$DW$T$31, DW_AT_name("PID_PARAMETERS")
    9331                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$28)
    9332                      .dwattr $C$DW$T$31, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    9333                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x39)
    9334                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x07)
    9335              
    9336                      .dwendtag $C$DW$TU$31
    9337              
    9338              
    9339              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    9340                      .dwmtype  $C$DW$T$29
    9341              
    9342              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    9343                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x10)
    9344              $C$DW$459       .dwtag  DW_TAG_member
    9345                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$19)
    9346                      .dwattr $C$DW$459, DW_AT_name("up")
    9347                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    9348                      .dwattr $C$DW$459, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9349                      .dwattr $C$DW$459, DW_AT_decl_line(0x3b)
    9350                      .dwattr $C$DW$459, DW_AT_decl_column(0x1e)
    9351              
    9352              $C$DW$460       .dwtag  DW_TAG_member
    9353                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$19)
    9354                      .dwattr $C$DW$460, DW_AT_name("ui")
    9355                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9356                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  196

    9357                      .dwattr $C$DW$460, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9358                      .dwattr $C$DW$460, DW_AT_decl_line(0x3c)
    9359                      .dwattr $C$DW$460, DW_AT_decl_column(0x12)
    9360              
    9361              $C$DW$461       .dwtag  DW_TAG_member
    9362                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$19)
    9363                      .dwattr $C$DW$461, DW_AT_name("ud")
    9364                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9365                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    9366                      .dwattr $C$DW$461, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9367                      .dwattr $C$DW$461, DW_AT_decl_line(0x3d)
    9368                      .dwattr $C$DW$461, DW_AT_decl_column(0x12)
    9369              
    9370              $C$DW$462       .dwtag  DW_TAG_member
    9371                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$19)
    9372                      .dwattr $C$DW$462, DW_AT_name("v1")
    9373                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9374                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    9375                      .dwattr $C$DW$462, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9376                      .dwattr $C$DW$462, DW_AT_decl_line(0x3e)
    9377                      .dwattr $C$DW$462, DW_AT_decl_column(0x12)
    9378              
    9379              $C$DW$463       .dwtag  DW_TAG_member
    9380                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$19)
    9381                      .dwattr $C$DW$463, DW_AT_name("i1")
    9382                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9383                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    9384                      .dwattr $C$DW$463, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9385                      .dwattr $C$DW$463, DW_AT_decl_line(0x3f)
    9386                      .dwattr $C$DW$463, DW_AT_decl_column(0x12)
    9387              
    9388              $C$DW$464       .dwtag  DW_TAG_member
    9389                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$19)
    9390                      .dwattr $C$DW$464, DW_AT_name("d1")
    9391                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9392                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    9393                      .dwattr $C$DW$464, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9394                      .dwattr $C$DW$464, DW_AT_decl_line(0x40)
    9395                      .dwattr $C$DW$464, DW_AT_decl_column(0x12)
    9396              
    9397              $C$DW$465       .dwtag  DW_TAG_member
    9398                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$19)
    9399                      .dwattr $C$DW$465, DW_AT_name("d2")
    9400                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9401                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    9402                      .dwattr $C$DW$465, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9403                      .dwattr $C$DW$465, DW_AT_decl_line(0x41)
    9404                      .dwattr $C$DW$465, DW_AT_decl_column(0x12)
    9405              
    9406              $C$DW$466       .dwtag  DW_TAG_member
    9407                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$19)
    9408                      .dwattr $C$DW$466, DW_AT_name("w1")
    9409                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9410                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    9411                      .dwattr $C$DW$466, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  197

    9412                      .dwattr $C$DW$466, DW_AT_decl_line(0x42)
    9413                      .dwattr $C$DW$466, DW_AT_decl_column(0x12)
    9414              
    9415                      .dwattr $C$DW$T$29, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    9416                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x3b)
    9417                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    9418                      .dwendtag $C$DW$T$29
    9419              
    9420                      .dwendtag $C$DW$TU$29
    9421              
    9422              
    9423              $C$DW$TU$32     .dwtag  DW_TAG_type_unit
    9424                      .dwmtype  $C$DW$T$32
    9425              $C$DW$T$32      .dwtag  DW_TAG_typedef
    9426                      .dwattr $C$DW$T$32, DW_AT_name("PID_DATA")
    9427                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$29)
    9428                      .dwattr $C$DW$T$32, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    9429                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x43)
    9430                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x07)
    9431              
    9432                      .dwendtag $C$DW$TU$32
    9433              
    9434              
    9435              $C$DW$TU$33     .dwtag  DW_TAG_type_unit
    9436                      .dwmtype  $C$DW$T$33
    9437              
    9438              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    9439                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x28)
    9440              $C$DW$467       .dwtag  DW_TAG_member
    9441                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$30)
    9442                      .dwattr $C$DW$467, DW_AT_name("term")
    9443                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    9444                      .dwattr $C$DW$467, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9445                      .dwattr $C$DW$467, DW_AT_decl_line(0x46)
    9446                      .dwattr $C$DW$467, DW_AT_decl_column(0x21)
    9447              
    9448              $C$DW$468       .dwtag  DW_TAG_member
    9449                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$31)
    9450                      .dwattr $C$DW$468, DW_AT_name("param")
    9451                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9452                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    9453                      .dwattr $C$DW$468, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9454                      .dwattr $C$DW$468, DW_AT_decl_line(0x47)
    9455                      .dwattr $C$DW$468, DW_AT_decl_column(0x16)
    9456              
    9457              $C$DW$469       .dwtag  DW_TAG_member
    9458                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$32)
    9459                      .dwattr $C$DW$469, DW_AT_name("data")
    9460                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9461                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    9462                      .dwattr $C$DW$469, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9463                      .dwattr $C$DW$469, DW_AT_decl_line(0x48)
    9464                      .dwattr $C$DW$469, DW_AT_decl_column(0x11)
    9465              
    9466                      .dwattr $C$DW$T$33, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  198

    9467                      .dwattr $C$DW$T$33, DW_AT_decl_line(0x46)
    9468                      .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    9469                      .dwendtag $C$DW$T$33
    9470              
    9471                      .dwendtag $C$DW$TU$33
    9472              
    9473              
    9474              $C$DW$TU$97     .dwtag  DW_TAG_type_unit
    9475                      .dwmtype  $C$DW$T$97
    9476              $C$DW$T$97      .dwtag  DW_TAG_typedef
    9477                      .dwattr $C$DW$T$97, DW_AT_name("PID_CONTROLLER")
    9478                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$33)
    9479                      .dwattr $C$DW$T$97, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    9480                      .dwattr $C$DW$T$97, DW_AT_decl_line(0x49)
    9481                      .dwattr $C$DW$T$97, DW_AT_decl_column(0x07)
    9482              
    9483                      .dwendtag $C$DW$TU$97
    9484              
    9485              
    9486              $C$DW$TU$37     .dwtag  DW_TAG_type_unit
    9487                      .dwmtype  $C$DW$T$37
    9488              
    9489              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    9490                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x1a)
    9491              $C$DW$470       .dwtag  DW_TAG_member
    9492                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$34)
    9493                      .dwattr $C$DW$470, DW_AT_name("input_ptr1")
    9494                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    9495                      .dwattr $C$DW$470, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9496                      .dwattr $C$DW$470, DW_AT_decl_line(0x3c)
    9497                      .dwattr $C$DW$470, DW_AT_decl_column(0x0d)
    9498              
    9499              $C$DW$471       .dwtag  DW_TAG_member
    9500                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$34)
    9501                      .dwattr $C$DW$471, DW_AT_name("input_ptr2")
    9502                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9503                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    9504                      .dwattr $C$DW$471, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9505                      .dwattr $C$DW$471, DW_AT_decl_line(0x3d)
    9506                      .dwattr $C$DW$471, DW_AT_decl_column(0x0d)
    9507              
    9508              $C$DW$472       .dwtag  DW_TAG_member
    9509                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$34)
    9510                      .dwattr $C$DW$472, DW_AT_name("input_ptr3")
    9511                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9512                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    9513                      .dwattr $C$DW$472, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9514                      .dwattr $C$DW$472, DW_AT_decl_line(0x3e)
    9515                      .dwattr $C$DW$472, DW_AT_decl_column(0x0d)
    9516              
    9517              $C$DW$473       .dwtag  DW_TAG_member
    9518                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$34)
    9519                      .dwattr $C$DW$473, DW_AT_name("input_ptr4")
    9520                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9521                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  199

    9522                      .dwattr $C$DW$473, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9523                      .dwattr $C$DW$473, DW_AT_decl_line(0x3f)
    9524                      .dwattr $C$DW$473, DW_AT_decl_column(0x0d)
    9525              
    9526              $C$DW$474       .dwtag  DW_TAG_member
    9527                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$34)
    9528                      .dwattr $C$DW$474, DW_AT_name("output_ptr1")
    9529                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9530                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    9531                      .dwattr $C$DW$474, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9532                      .dwattr $C$DW$474, DW_AT_decl_line(0x40)
    9533                      .dwattr $C$DW$474, DW_AT_decl_column(0x0d)
    9534              
    9535              $C$DW$475       .dwtag  DW_TAG_member
    9536                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$34)
    9537                      .dwattr $C$DW$475, DW_AT_name("output_ptr2")
    9538                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9539                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    9540                      .dwattr $C$DW$475, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9541                      .dwattr $C$DW$475, DW_AT_decl_line(0x41)
    9542                      .dwattr $C$DW$475, DW_AT_decl_column(0x0d)
    9543              
    9544              $C$DW$476       .dwtag  DW_TAG_member
    9545                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$34)
    9546                      .dwattr $C$DW$476, DW_AT_name("output_ptr3")
    9547                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9548                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    9549                      .dwattr $C$DW$476, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9550                      .dwattr $C$DW$476, DW_AT_decl_line(0x42)
    9551                      .dwattr $C$DW$476, DW_AT_decl_column(0x0d)
    9552              
    9553              $C$DW$477       .dwtag  DW_TAG_member
    9554                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$34)
    9555                      .dwattr $C$DW$477, DW_AT_name("output_ptr4")
    9556                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9557                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    9558                      .dwattr $C$DW$477, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9559                      .dwattr $C$DW$477, DW_AT_decl_line(0x43)
    9560                      .dwattr $C$DW$477, DW_AT_decl_column(0x0d)
    9561              
    9562              $C$DW$478       .dwtag  DW_TAG_member
    9563                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$19)
    9564                      .dwattr $C$DW$478, DW_AT_name("prev_value")
    9565                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9566                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    9567                      .dwattr $C$DW$478, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9568                      .dwattr $C$DW$478, DW_AT_decl_line(0x44)
    9569                      .dwattr $C$DW$478, DW_AT_decl_column(0x0c)
    9570              
    9571              $C$DW$479       .dwtag  DW_TAG_member
    9572                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$19)
    9573                      .dwattr $C$DW$479, DW_AT_name("trig_value")
    9574                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9575                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    9576                      .dwattr $C$DW$479, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  200

    9577                      .dwattr $C$DW$479, DW_AT_decl_line(0x45)
    9578                      .dwattr $C$DW$479, DW_AT_decl_column(0x0c)
    9579              
    9580              $C$DW$480       .dwtag  DW_TAG_member
    9581                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$36)
    9582                      .dwattr $C$DW$480, DW_AT_name("status")
    9583                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9584                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    9585                      .dwattr $C$DW$480, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9586                      .dwattr $C$DW$480, DW_AT_decl_line(0x46)
    9587                      .dwattr $C$DW$480, DW_AT_decl_column(0x0a)
    9588              
    9589              $C$DW$481       .dwtag  DW_TAG_member
    9590                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$36)
    9591                      .dwattr $C$DW$481, DW_AT_name("pre_scalar")
    9592                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    9593                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    9594                      .dwattr $C$DW$481, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9595                      .dwattr $C$DW$481, DW_AT_decl_line(0x47)
    9596                      .dwattr $C$DW$481, DW_AT_decl_column(0x0a)
    9597              
    9598              $C$DW$482       .dwtag  DW_TAG_member
    9599                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$36)
    9600                      .dwattr $C$DW$482, DW_AT_name("skip_count")
    9601                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9602                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    9603                      .dwattr $C$DW$482, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9604                      .dwattr $C$DW$482, DW_AT_decl_line(0x48)
    9605                      .dwattr $C$DW$482, DW_AT_decl_column(0x0a)
    9606              
    9607              $C$DW$483       .dwtag  DW_TAG_member
    9608                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$36)
    9609                      .dwattr $C$DW$483, DW_AT_name("size")
    9610                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    9611                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    9612                      .dwattr $C$DW$483, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9613                      .dwattr $C$DW$483, DW_AT_decl_line(0x49)
    9614                      .dwattr $C$DW$483, DW_AT_decl_column(0x0a)
    9615              
    9616              $C$DW$484       .dwtag  DW_TAG_member
    9617                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$36)
    9618                      .dwattr $C$DW$484, DW_AT_name("count")
    9619                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9620                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    9621                      .dwattr $C$DW$484, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9622                      .dwattr $C$DW$484, DW_AT_decl_line(0x4a)
    9623                      .dwattr $C$DW$484, DW_AT_decl_column(0x0a)
    9624              
    9625                      .dwattr $C$DW$T$37, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    9626                      .dwattr $C$DW$T$37, DW_AT_decl_line(0x3b)
    9627                      .dwattr $C$DW$T$37, DW_AT_decl_column(0x0f)
    9628                      .dwendtag $C$DW$T$37
    9629              
    9630                      .dwendtag $C$DW$TU$37
    9631              
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  201

    9632              
    9633              $C$DW$TU$120    .dwtag  DW_TAG_type_unit
    9634                      .dwmtype  $C$DW$T$120
    9635              $C$DW$T$120     .dwtag  DW_TAG_typedef
    9636                      .dwattr $C$DW$T$120, DW_AT_name("DLOG_4CH_F")
    9637                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$37)
    9638                      .dwattr $C$DW$T$120, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/uti
    9639                      .dwattr $C$DW$T$120, DW_AT_decl_line(0x4b)
    9640                      .dwattr $C$DW$T$120, DW_AT_decl_column(0x02)
    9641              
    9642                      .dwendtag $C$DW$TU$120
    9643              
    9644              
    9645              $C$DW$TU$121    .dwtag  DW_TAG_type_unit
    9646                      .dwmtype  $C$DW$T$121
    9647              $C$DW$T$121     .dwtag  DW_TAG_pointer_type
    9648                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    9649                      .dwattr $C$DW$T$121, DW_AT_address_class(0x20)
    9650              
    9651                      .dwendtag $C$DW$TU$121
    9652              
    9653              
    9654              $C$DW$TU$38     .dwtag  DW_TAG_type_unit
    9655                      .dwmtype  $C$DW$T$38
    9656              
    9657              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    9658                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x0a)
    9659              $C$DW$485       .dwtag  DW_TAG_member
    9660                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$19)
    9661                      .dwattr $C$DW$485, DW_AT_name("As")
    9662                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    9663                      .dwattr $C$DW$485, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9664                      .dwattr $C$DW$485, DW_AT_decl_line(0x2a)
    9665                      .dwattr $C$DW$485, DW_AT_decl_column(0x1e)
    9666              
    9667              $C$DW$486       .dwtag  DW_TAG_member
    9668                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$19)
    9669                      .dwattr $C$DW$486, DW_AT_name("Bs")
    9670                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9671                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    9672                      .dwattr $C$DW$486, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9673                      .dwattr $C$DW$486, DW_AT_decl_line(0x2b)
    9674                      .dwattr $C$DW$486, DW_AT_decl_column(0x12)
    9675              
    9676              $C$DW$487       .dwtag  DW_TAG_member
    9677                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$19)
    9678                      .dwattr $C$DW$487, DW_AT_name("Cs")
    9679                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9680                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    9681                      .dwattr $C$DW$487, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9682                      .dwattr $C$DW$487, DW_AT_decl_line(0x2c)
    9683                      .dwattr $C$DW$487, DW_AT_decl_column(0x12)
    9684              
    9685              $C$DW$488       .dwtag  DW_TAG_member
    9686                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  202

    9687                      .dwattr $C$DW$488, DW_AT_name("Alpha")
    9688                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9689                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    9690                      .dwattr $C$DW$488, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9691                      .dwattr $C$DW$488, DW_AT_decl_line(0x2d)
    9692                      .dwattr $C$DW$488, DW_AT_decl_column(0x12)
    9693              
    9694              $C$DW$489       .dwtag  DW_TAG_member
    9695                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$19)
    9696                      .dwattr $C$DW$489, DW_AT_name("Beta")
    9697                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9698                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    9699                      .dwattr $C$DW$489, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9700                      .dwattr $C$DW$489, DW_AT_decl_line(0x2e)
    9701                      .dwattr $C$DW$489, DW_AT_decl_column(0x12)
    9702              
    9703                      .dwattr $C$DW$T$38, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    9704                      .dwattr $C$DW$T$38, DW_AT_decl_line(0x2a)
    9705                      .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    9706                      .dwendtag $C$DW$T$38
    9707              
    9708                      .dwendtag $C$DW$TU$38
    9709              
    9710              
    9711              $C$DW$TU$92     .dwtag  DW_TAG_type_unit
    9712                      .dwmtype  $C$DW$T$92
    9713              $C$DW$T$92      .dwtag  DW_TAG_typedef
    9714                      .dwattr $C$DW$T$92, DW_AT_name("CLARKE")
    9715                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$38)
    9716                      .dwattr $C$DW$T$92, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    9717                      .dwattr $C$DW$T$92, DW_AT_decl_line(0x2f)
    9718                      .dwattr $C$DW$T$92, DW_AT_decl_column(0x09)
    9719              
    9720                      .dwendtag $C$DW$TU$92
    9721              
    9722              
    9723              $C$DW$TU$39     .dwtag  DW_TAG_type_unit
    9724                      .dwmtype  $C$DW$T$39
    9725              
    9726              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    9727                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x0e)
    9728              $C$DW$490       .dwtag  DW_TAG_member
    9729                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$19)
    9730                      .dwattr $C$DW$490, DW_AT_name("Alpha")
    9731                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    9732                      .dwattr $C$DW$490, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9733                      .dwattr $C$DW$490, DW_AT_decl_line(0x29)
    9734                      .dwattr $C$DW$490, DW_AT_decl_column(0x1e)
    9735              
    9736              $C$DW$491       .dwtag  DW_TAG_member
    9737                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$19)
    9738                      .dwattr $C$DW$491, DW_AT_name("Beta")
    9739                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9740                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    9741                      .dwattr $C$DW$491, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  203

    9742                      .dwattr $C$DW$491, DW_AT_decl_line(0x2a)
    9743                      .dwattr $C$DW$491, DW_AT_decl_column(0x12)
    9744              
    9745              $C$DW$492       .dwtag  DW_TAG_member
    9746                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$19)
    9747                      .dwattr $C$DW$492, DW_AT_name("Angle")
    9748                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9749                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    9750                      .dwattr $C$DW$492, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9751                      .dwattr $C$DW$492, DW_AT_decl_line(0x2b)
    9752                      .dwattr $C$DW$492, DW_AT_decl_column(0x12)
    9753              
    9754              $C$DW$493       .dwtag  DW_TAG_member
    9755                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$19)
    9756                      .dwattr $C$DW$493, DW_AT_name("Ds")
    9757                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9758                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    9759                      .dwattr $C$DW$493, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9760                      .dwattr $C$DW$493, DW_AT_decl_line(0x2c)
    9761                      .dwattr $C$DW$493, DW_AT_decl_column(0x12)
    9762              
    9763              $C$DW$494       .dwtag  DW_TAG_member
    9764                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$19)
    9765                      .dwattr $C$DW$494, DW_AT_name("Qs")
    9766                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9767                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    9768                      .dwattr $C$DW$494, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9769                      .dwattr $C$DW$494, DW_AT_decl_line(0x2d)
    9770                      .dwattr $C$DW$494, DW_AT_decl_column(0x12)
    9771              
    9772              $C$DW$495       .dwtag  DW_TAG_member
    9773                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$19)
    9774                      .dwattr $C$DW$495, DW_AT_name("Sine")
    9775                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9776                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    9777                      .dwattr $C$DW$495, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9778                      .dwattr $C$DW$495, DW_AT_decl_line(0x2e)
    9779                      .dwattr $C$DW$495, DW_AT_decl_column(0x12)
    9780              
    9781              $C$DW$496       .dwtag  DW_TAG_member
    9782                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$19)
    9783                      .dwattr $C$DW$496, DW_AT_name("Cosine")
    9784                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9785                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    9786                      .dwattr $C$DW$496, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9787                      .dwattr $C$DW$496, DW_AT_decl_line(0x2f)
    9788                      .dwattr $C$DW$496, DW_AT_decl_column(0x12)
    9789              
    9790                      .dwattr $C$DW$T$39, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    9791                      .dwattr $C$DW$T$39, DW_AT_decl_line(0x29)
    9792                      .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    9793                      .dwendtag $C$DW$T$39
    9794              
    9795                      .dwendtag $C$DW$TU$39
    9796              
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  204

    9797              
    9798              $C$DW$TU$93     .dwtag  DW_TAG_type_unit
    9799                      .dwmtype  $C$DW$T$93
    9800              $C$DW$T$93      .dwtag  DW_TAG_typedef
    9801                      .dwattr $C$DW$T$93, DW_AT_name("PARK")
    9802                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$39)
    9803                      .dwattr $C$DW$T$93, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    9804                      .dwattr $C$DW$T$93, DW_AT_decl_line(0x30)
    9805                      .dwattr $C$DW$T$93, DW_AT_decl_column(0x09)
    9806              
    9807                      .dwendtag $C$DW$TU$93
    9808              
    9809              
    9810              $C$DW$TU$40     .dwtag  DW_TAG_type_unit
    9811                      .dwmtype  $C$DW$T$40
    9812              
    9813              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    9814                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x0e)
    9815              $C$DW$497       .dwtag  DW_TAG_member
    9816                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$19)
    9817                      .dwattr $C$DW$497, DW_AT_name("Alpha")
    9818                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    9819                      .dwattr $C$DW$497, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9820                      .dwattr $C$DW$497, DW_AT_decl_line(0x29)
    9821                      .dwattr $C$DW$497, DW_AT_decl_column(0x1e)
    9822              
    9823              $C$DW$498       .dwtag  DW_TAG_member
    9824                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$19)
    9825                      .dwattr $C$DW$498, DW_AT_name("Beta")
    9826                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9827                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    9828                      .dwattr $C$DW$498, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9829                      .dwattr $C$DW$498, DW_AT_decl_line(0x2a)
    9830                      .dwattr $C$DW$498, DW_AT_decl_column(0x12)
    9831              
    9832              $C$DW$499       .dwtag  DW_TAG_member
    9833                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$19)
    9834                      .dwattr $C$DW$499, DW_AT_name("Angle")
    9835                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9836                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    9837                      .dwattr $C$DW$499, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9838                      .dwattr $C$DW$499, DW_AT_decl_line(0x2b)
    9839                      .dwattr $C$DW$499, DW_AT_decl_column(0x12)
    9840              
    9841              $C$DW$500       .dwtag  DW_TAG_member
    9842                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$19)
    9843                      .dwattr $C$DW$500, DW_AT_name("Ds")
    9844                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9845                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    9846                      .dwattr $C$DW$500, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9847                      .dwattr $C$DW$500, DW_AT_decl_line(0x2c)
    9848                      .dwattr $C$DW$500, DW_AT_decl_column(0x12)
    9849              
    9850              $C$DW$501       .dwtag  DW_TAG_member
    9851                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  205

    9852                      .dwattr $C$DW$501, DW_AT_name("Qs")
    9853                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9854                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    9855                      .dwattr $C$DW$501, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9856                      .dwattr $C$DW$501, DW_AT_decl_line(0x2d)
    9857                      .dwattr $C$DW$501, DW_AT_decl_column(0x12)
    9858              
    9859              $C$DW$502       .dwtag  DW_TAG_member
    9860                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$19)
    9861                      .dwattr $C$DW$502, DW_AT_name("Sine")
    9862                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9863                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    9864                      .dwattr $C$DW$502, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9865                      .dwattr $C$DW$502, DW_AT_decl_line(0x2e)
    9866                      .dwattr $C$DW$502, DW_AT_decl_column(0x12)
    9867              
    9868              $C$DW$503       .dwtag  DW_TAG_member
    9869                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$19)
    9870                      .dwattr $C$DW$503, DW_AT_name("Cosine")
    9871                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9872                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    9873                      .dwattr $C$DW$503, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    9874                      .dwattr $C$DW$503, DW_AT_decl_line(0x2f)
    9875                      .dwattr $C$DW$503, DW_AT_decl_column(0x12)
    9876              
    9877                      .dwattr $C$DW$T$40, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    9878                      .dwattr $C$DW$T$40, DW_AT_decl_line(0x29)
    9879                      .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    9880                      .dwendtag $C$DW$T$40
    9881              
    9882                      .dwendtag $C$DW$TU$40
    9883              
    9884              
    9885              $C$DW$TU$94     .dwtag  DW_TAG_type_unit
    9886                      .dwmtype  $C$DW$T$94
    9887              $C$DW$T$94      .dwtag  DW_TAG_typedef
    9888                      .dwattr $C$DW$T$94, DW_AT_name("IPARK")
    9889                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$40)
    9890                      .dwattr $C$DW$T$94, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    9891                      .dwattr $C$DW$T$94, DW_AT_decl_line(0x30)
    9892                      .dwattr $C$DW$T$94, DW_AT_decl_column(0x0b)
    9893              
    9894                      .dwendtag $C$DW$TU$94
    9895              
    9896              
    9897              $C$DW$TU$41     .dwtag  DW_TAG_type_unit
    9898                      .dwmtype  $C$DW$T$41
    9899              
    9900              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    9901                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x16)
    9902              $C$DW$504       .dwtag  DW_TAG_member
    9903                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$19)
    9904                      .dwattr $C$DW$504, DW_AT_name("ref")
    9905                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    9906                      .dwattr $C$DW$504, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  206

    9907                      .dwattr $C$DW$504, DW_AT_decl_line(0x18)
    9908                      .dwattr $C$DW$504, DW_AT_decl_column(0x10)
    9909              
    9910              $C$DW$505       .dwtag  DW_TAG_member
    9911                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$19)
    9912                      .dwattr $C$DW$505, DW_AT_name("fbk")
    9913                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9914                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    9915                      .dwattr $C$DW$505, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
    9916                      .dwattr $C$DW$505, DW_AT_decl_line(0x19)
    9917                      .dwattr $C$DW$505, DW_AT_decl_column(0x10)
    9918              
    9919              $C$DW$506       .dwtag  DW_TAG_member
    9920                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$19)
    9921                      .dwattr $C$DW$506, DW_AT_name("err")
    9922                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9923                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    9924                      .dwattr $C$DW$506, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
    9925                      .dwattr $C$DW$506, DW_AT_decl_line(0x1a)
    9926                      .dwattr $C$DW$506, DW_AT_decl_column(0x10)
    9927              
    9928              $C$DW$507       .dwtag  DW_TAG_member
    9929                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$19)
    9930                      .dwattr $C$DW$507, DW_AT_name("out")
    9931                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9932                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    9933                      .dwattr $C$DW$507, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
    9934                      .dwattr $C$DW$507, DW_AT_decl_line(0x1b)
    9935                      .dwattr $C$DW$507, DW_AT_decl_column(0x10)
    9936              
    9937              $C$DW$508       .dwtag  DW_TAG_member
    9938                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$19)
    9939                      .dwattr $C$DW$508, DW_AT_name("carryOver")
    9940                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9941                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    9942                      .dwattr $C$DW$508, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
    9943                      .dwattr $C$DW$508, DW_AT_decl_line(0x1c)
    9944                      .dwattr $C$DW$508, DW_AT_decl_column(0x10)
    9945              
    9946              $C$DW$509       .dwtag  DW_TAG_member
    9947                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$19)
    9948                      .dwattr $C$DW$509, DW_AT_name("Kp")
    9949                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9950                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    9951                      .dwattr $C$DW$509, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
    9952                      .dwattr $C$DW$509, DW_AT_decl_line(0x1d)
    9953                      .dwattr $C$DW$509, DW_AT_decl_column(0x10)
    9954              
    9955              $C$DW$510       .dwtag  DW_TAG_member
    9956                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$19)
    9957                      .dwattr $C$DW$510, DW_AT_name("Ki")
    9958                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9959                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    9960                      .dwattr $C$DW$510, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
    9961                      .dwattr $C$DW$510, DW_AT_decl_line(0x1e)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  207

    9962                      .dwattr $C$DW$510, DW_AT_decl_column(0x10)
    9963              
    9964              $C$DW$511       .dwtag  DW_TAG_member
    9965                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$19)
    9966                      .dwattr $C$DW$511, DW_AT_name("Kerr")
    9967                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9968                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    9969                      .dwattr $C$DW$511, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
    9970                      .dwattr $C$DW$511, DW_AT_decl_line(0x1f)
    9971                      .dwattr $C$DW$511, DW_AT_decl_column(0x10)
    9972              
    9973              $C$DW$512       .dwtag  DW_TAG_member
    9974                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$19)
    9975                      .dwattr $C$DW$512, DW_AT_name("KerrOld")
    9976                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9977                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    9978                      .dwattr $C$DW$512, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
    9979                      .dwattr $C$DW$512, DW_AT_decl_line(0x20)
    9980                      .dwattr $C$DW$512, DW_AT_decl_column(0x10)
    9981              
    9982              $C$DW$513       .dwtag  DW_TAG_member
    9983                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$19)
    9984                      .dwattr $C$DW$513, DW_AT_name("Umax")
    9985                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9986                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    9987                      .dwattr $C$DW$513, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
    9988                      .dwattr $C$DW$513, DW_AT_decl_line(0x21)
    9989                      .dwattr $C$DW$513, DW_AT_decl_column(0x10)
    9990              
    9991              $C$DW$514       .dwtag  DW_TAG_member
    9992                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$19)
    9993                      .dwattr $C$DW$514, DW_AT_name("Umin")
    9994                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9995                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    9996                      .dwattr $C$DW$514, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
    9997                      .dwattr $C$DW$514, DW_AT_decl_line(0x22)
    9998                      .dwattr $C$DW$514, DW_AT_decl_column(0x10)
    9999              
   10000                      .dwattr $C$DW$T$41, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/
   10001                      .dwattr $C$DW$T$41, DW_AT_decl_line(0x17)
   10002                      .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
   10003                      .dwendtag $C$DW$T$41
   10004              
   10005                      .dwendtag $C$DW$TU$41
   10006              
   10007              
   10008              $C$DW$TU$76     .dwtag  DW_TAG_type_unit
   10009                      .dwmtype  $C$DW$T$76
   10010              $C$DW$T$76      .dwtag  DW_TAG_typedef
   10011                      .dwattr $C$DW$T$76, DW_AT_name("FCL_PIController_t")
   10012                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$41)
   10013                      .dwattr $C$DW$T$76, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/
   10014                      .dwattr $C$DW$T$76, DW_AT_decl_line(0x23)
   10015                      .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
   10016              
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  208

   10017                      .dwendtag $C$DW$TU$76
   10018              
   10019              
   10020              $C$DW$TU$42     .dwtag  DW_TAG_type_unit
   10021                      .dwmtype  $C$DW$T$42
   10022              
   10023              $C$DW$T$42      .dwtag  DW_TAG_structure_type
   10024                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x18)
   10025              $C$DW$515       .dwtag  DW_TAG_member
   10026                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$19)
   10027                      .dwattr $C$DW$515, DW_AT_name("Ref")
   10028                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
   10029                      .dwattr $C$DW$515, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
   10030                      .dwattr $C$DW$515, DW_AT_decl_line(0x2a)
   10031                      .dwattr $C$DW$515, DW_AT_decl_column(0x1e)
   10032              
   10033              $C$DW$516       .dwtag  DW_TAG_member
   10034                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$19)
   10035                      .dwattr $C$DW$516, DW_AT_name("Fbk")
   10036                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10037                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
   10038                      .dwattr $C$DW$516, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
   10039                      .dwattr $C$DW$516, DW_AT_decl_line(0x2b)
   10040                      .dwattr $C$DW$516, DW_AT_decl_column(0x12)
   10041              
   10042              $C$DW$517       .dwtag  DW_TAG_member
   10043                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$19)
   10044                      .dwattr $C$DW$517, DW_AT_name("Out")
   10045                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10046                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
   10047                      .dwattr $C$DW$517, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
   10048                      .dwattr $C$DW$517, DW_AT_decl_line(0x2c)
   10049                      .dwattr $C$DW$517, DW_AT_decl_column(0x12)
   10050              
   10051              $C$DW$518       .dwtag  DW_TAG_member
   10052                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$19)
   10053                      .dwattr $C$DW$518, DW_AT_name("Kp")
   10054                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10055                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
   10056                      .dwattr $C$DW$518, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
   10057                      .dwattr $C$DW$518, DW_AT_decl_line(0x2d)
   10058                      .dwattr $C$DW$518, DW_AT_decl_column(0x12)
   10059              
   10060              $C$DW$519       .dwtag  DW_TAG_member
   10061                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$19)
   10062                      .dwattr $C$DW$519, DW_AT_name("Ki")
   10063                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10064                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
   10065                      .dwattr $C$DW$519, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
   10066                      .dwattr $C$DW$519, DW_AT_decl_line(0x2e)
   10067                      .dwattr $C$DW$519, DW_AT_decl_column(0x12)
   10068              
   10069              $C$DW$520       .dwtag  DW_TAG_member
   10070                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$19)
   10071                      .dwattr $C$DW$520, DW_AT_name("Umax")
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  209

   10072                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10073                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
   10074                      .dwattr $C$DW$520, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
   10075                      .dwattr $C$DW$520, DW_AT_decl_line(0x2f)
   10076                      .dwattr $C$DW$520, DW_AT_decl_column(0x12)
   10077              
   10078              $C$DW$521       .dwtag  DW_TAG_member
   10079                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$19)
   10080                      .dwattr $C$DW$521, DW_AT_name("Umin")
   10081                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10082                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
   10083                      .dwattr $C$DW$521, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
   10084                      .dwattr $C$DW$521, DW_AT_decl_line(0x30)
   10085                      .dwattr $C$DW$521, DW_AT_decl_column(0x12)
   10086              
   10087              $C$DW$522       .dwtag  DW_TAG_member
   10088                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$19)
   10089                      .dwattr $C$DW$522, DW_AT_name("up")
   10090                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10091                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
   10092                      .dwattr $C$DW$522, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
   10093                      .dwattr $C$DW$522, DW_AT_decl_line(0x31)
   10094                      .dwattr $C$DW$522, DW_AT_decl_column(0x12)
   10095              
   10096              $C$DW$523       .dwtag  DW_TAG_member
   10097                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$19)
   10098                      .dwattr $C$DW$523, DW_AT_name("ui")
   10099                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10100                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
   10101                      .dwattr $C$DW$523, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
   10102                      .dwattr $C$DW$523, DW_AT_decl_line(0x32)
   10103                      .dwattr $C$DW$523, DW_AT_decl_column(0x12)
   10104              
   10105              $C$DW$524       .dwtag  DW_TAG_member
   10106                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$19)
   10107                      .dwattr $C$DW$524, DW_AT_name("v1")
   10108                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10109                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
   10110                      .dwattr $C$DW$524, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
   10111                      .dwattr $C$DW$524, DW_AT_decl_line(0x33)
   10112                      .dwattr $C$DW$524, DW_AT_decl_column(0x12)
   10113              
   10114              $C$DW$525       .dwtag  DW_TAG_member
   10115                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$19)
   10116                      .dwattr $C$DW$525, DW_AT_name("i1")
   10117                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   10118                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
   10119                      .dwattr $C$DW$525, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
   10120                      .dwattr $C$DW$525, DW_AT_decl_line(0x34)
   10121                      .dwattr $C$DW$525, DW_AT_decl_column(0x12)
   10122              
   10123              $C$DW$526       .dwtag  DW_TAG_member
   10124                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$19)
   10125                      .dwattr $C$DW$526, DW_AT_name("w1")
   10126                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive.asm                                            PAGE  210

   10127                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
   10128                      .dwattr $C$DW$526, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
   10129                      .dwattr $C$DW$526, DW_AT_decl_line(0x35)
   10130                      .dwattr $C$DW$526, DW_AT_decl_column(0x12)
   10131              
   10132                      .dwattr $C$DW$T$42, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
   10133                      .dwattr $C$DW$T$42, DW_AT_decl_line(0x2a)
   10134                      .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
