TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Sat Dec 27 15:00:17 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/dual_axis_servo_drive_user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\JUNLI\workspace_ccstheia\dual_axis_servo_drive_fcl_qep_f28
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("FCL_initADC_3I")
      16                      .dwattr $C$DW$1, DW_AT_linkage_name("FCL_initADC_3I")

    4374                      .dwattr $C$DW$T$101, DW_AT_decl_column(0x01)
    4375                      .dwendtag $C$DW$T$101
    4376              
    4377                      .dwendtag $C$DW$TU$101
    4378              
    4379              
    4380              $C$DW$TU$102    .dwtag  DW_TAG_type_unit
    4381                      .dwmtype  $C$DW$T$102
    4382              $C$DW$T$102     .dwtag  DW_TAG_typedef
    4383                      .dwattr $C$DW$T$102, DW_AT_name("ADC_SOCNumber")
    4384                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$101)
    4385                      .dwattr $C$DW$T$102, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/dri
    4386                      .dwattr $C$DW$T$102, DW_AT_decl_line(0x155)
    4387                      .dwattr $C$DW$T$102, DW_AT_decl_column(0x03)
    4388              
    4389                      .dwendtag $C$DW$TU$102
    4390              
    4391              
    4392              $C$DW$TU$103    .dwtag  DW_TAG_type_unit
    4393                      .dwmtype  $C$DW$T$103
    4394              
    4395              $C$DW$T$103     .dwtag  DW_TAG_enumeration_type
    4396                      .dwattr $C$DW$T$103, DW_AT_byte_size(0x01)
    4397              $C$DW$200       .dwtag  DW_TAG_enumerator
    4398                      .dwattr $C$DW$200, DW_AT_name("ADC_PPB_NUMBER1")
    4399                      .dwattr $C$DW$200, DW_AT_const_value(0x00)
    4400                      .dwattr $C$DW$200, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/drive
    4401                      .dwattr $C$DW$200, DW_AT_decl_line(0x134)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE   93

    4402                      .dwattr $C$DW$200, DW_AT_decl_column(0x05)
    4403              
    4404              $C$DW$201       .dwtag  DW_TAG_enumerator
    4405                      .dwattr $C$DW$201, DW_AT_name("ADC_PPB_NUMBER2")
    4406                      .dwattr $C$DW$201, DW_AT_const_value(0x01)
    4407                      .dwattr $C$DW$201, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/drive
    4408                      .dwattr $C$DW$201, DW_AT_decl_line(0x135)
    4409                      .dwattr $C$DW$201, DW_AT_decl_column(0x05)
    4410              
    4411              $C$DW$202       .dwtag  DW_TAG_enumerator
    4412                      .dwattr $C$DW$202, DW_AT_name("ADC_PPB_NUMBER3")
    4413                      .dwattr $C$DW$202, DW_AT_const_value(0x02)
    4414                      .dwattr $C$DW$202, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/drive
    4415                      .dwattr $C$DW$202, DW_AT_decl_line(0x136)
    4416                      .dwattr $C$DW$202, DW_AT_decl_column(0x05)
    4417              
    4418              $C$DW$203       .dwtag  DW_TAG_enumerator
    4419                      .dwattr $C$DW$203, DW_AT_name("ADC_PPB_NUMBER4")
    4420                      .dwattr $C$DW$203, DW_AT_const_value(0x03)
    4421                      .dwattr $C$DW$203, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/drive
    4422                      .dwattr $C$DW$203, DW_AT_decl_line(0x137)
    4423                      .dwattr $C$DW$203, DW_AT_decl_column(0x05)
    4424              
    4425                      .dwattr $C$DW$T$103, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/dri
    4426                      .dwattr $C$DW$T$103, DW_AT_decl_line(0x133)
    4427                      .dwattr $C$DW$T$103, DW_AT_decl_column(0x01)
    4428                      .dwendtag $C$DW$T$103
    4429              
    4430                      .dwendtag $C$DW$TU$103
    4431              
    4432              
    4433              $C$DW$TU$104    .dwtag  DW_TAG_type_unit
    4434                      .dwmtype  $C$DW$T$104
    4435              $C$DW$T$104     .dwtag  DW_TAG_typedef
    4436                      .dwattr $C$DW$T$104, DW_AT_name("ADC_PPBNumber")
    4437                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
    4438                      .dwattr $C$DW$T$104, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/dri
    4439                      .dwattr $C$DW$T$104, DW_AT_decl_line(0x138)
    4440                      .dwattr $C$DW$T$104, DW_AT_decl_column(0x03)
    4441              
    4442                      .dwendtag $C$DW$TU$104
    4443              
    4444              
    4445              $C$DW$TU$22     .dwtag  DW_TAG_type_unit
    4446                      .dwmtype  $C$DW$T$22
    4447              
    4448              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4449                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    4450              $C$DW$204       .dwtag  DW_TAG_member
    4451                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    4452                      .dwattr $C$DW$204, DW_AT_name("TargetValue")
    4453                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    4454                      .dwattr $C$DW$204, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4455                      .dwattr $C$DW$204, DW_AT_decl_line(0x2b)
    4456                      .dwattr $C$DW$204, DW_AT_decl_column(0x0f)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE   94

    4457              
    4458              $C$DW$205       .dwtag  DW_TAG_member
    4459                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$21)
    4460                      .dwattr $C$DW$205, DW_AT_name("RampDelayMax")
    4461                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4462                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    4463                      .dwattr $C$DW$205, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4464                      .dwattr $C$DW$205, DW_AT_decl_line(0x2c)
    4465                      .dwattr $C$DW$205, DW_AT_decl_column(0x0f)
    4466              
    4467              $C$DW$206       .dwtag  DW_TAG_member
    4468                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    4469                      .dwattr $C$DW$206, DW_AT_name("RampLowLimit")
    4470                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4471                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    4472                      .dwattr $C$DW$206, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4473                      .dwattr $C$DW$206, DW_AT_decl_line(0x2d)
    4474                      .dwattr $C$DW$206, DW_AT_decl_column(0x0f)
    4475              
    4476              $C$DW$207       .dwtag  DW_TAG_member
    4477                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    4478                      .dwattr $C$DW$207, DW_AT_name("RampHighLimit")
    4479                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4480                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    4481                      .dwattr $C$DW$207, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4482                      .dwattr $C$DW$207, DW_AT_decl_line(0x2e)
    4483                      .dwattr $C$DW$207, DW_AT_decl_column(0x0f)
    4484              
    4485              $C$DW$208       .dwtag  DW_TAG_member
    4486                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$21)
    4487                      .dwattr $C$DW$208, DW_AT_name("RampDelayCount")
    4488                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4489                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    4490                      .dwattr $C$DW$208, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4491                      .dwattr $C$DW$208, DW_AT_decl_line(0x2f)
    4492                      .dwattr $C$DW$208, DW_AT_decl_column(0x0c)
    4493              
    4494              $C$DW$209       .dwtag  DW_TAG_member
    4495                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    4496                      .dwattr $C$DW$209, DW_AT_name("SetpointValue")
    4497                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4498                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    4499                      .dwattr $C$DW$209, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4500                      .dwattr $C$DW$209, DW_AT_decl_line(0x30)
    4501                      .dwattr $C$DW$209, DW_AT_decl_column(0x0c)
    4502              
    4503              $C$DW$210       .dwtag  DW_TAG_member
    4504                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$21)
    4505                      .dwattr $C$DW$210, DW_AT_name("EqualFlag")
    4506                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4507                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    4508                      .dwattr $C$DW$210, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4509                      .dwattr $C$DW$210, DW_AT_decl_line(0x31)
    4510                      .dwattr $C$DW$210, DW_AT_decl_column(0x0c)
    4511              
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE   95

    4512              $C$DW$211       .dwtag  DW_TAG_member
    4513                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    4514                      .dwattr $C$DW$211, DW_AT_name("Tmp")
    4515                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4516                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    4517                      .dwattr $C$DW$211, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4518                      .dwattr $C$DW$211, DW_AT_decl_line(0x32)
    4519                      .dwattr $C$DW$211, DW_AT_decl_column(0x0c)
    4520              
    4521                      .dwattr $C$DW$T$22, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4522                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x2a)
    4523                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    4524                      .dwendtag $C$DW$T$22
    4525              
    4526                      .dwendtag $C$DW$TU$22
    4527              
    4528              
    4529              $C$DW$TU$84     .dwtag  DW_TAG_type_unit
    4530                      .dwmtype  $C$DW$T$84
    4531              $C$DW$T$84      .dwtag  DW_TAG_typedef
    4532                      .dwattr $C$DW$T$84, DW_AT_name("RMPCNTL")
    4533                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$22)
    4534                      .dwattr $C$DW$T$84, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4535                      .dwattr $C$DW$T$84, DW_AT_decl_line(0x33)
    4536                      .dwattr $C$DW$T$84, DW_AT_decl_column(0x03)
    4537              
    4538                      .dwendtag $C$DW$TU$84
    4539              
    4540              
    4541              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
    4542                      .dwmtype  $C$DW$T$23
    4543              
    4544              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    4545                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
    4546              $C$DW$212       .dwtag  DW_TAG_member
    4547                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    4548                      .dwattr $C$DW$212, DW_AT_name("As")
    4549                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    4550                      .dwattr $C$DW$212, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4551                      .dwattr $C$DW$212, DW_AT_decl_line(0x2a)
    4552                      .dwattr $C$DW$212, DW_AT_decl_column(0x1e)
    4553              
    4554              $C$DW$213       .dwtag  DW_TAG_member
    4555                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    4556                      .dwattr $C$DW$213, DW_AT_name("Bs")
    4557                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4558                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    4559                      .dwattr $C$DW$213, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4560                      .dwattr $C$DW$213, DW_AT_decl_line(0x2b)
    4561                      .dwattr $C$DW$213, DW_AT_decl_column(0x12)
    4562              
    4563              $C$DW$214       .dwtag  DW_TAG_member
    4564                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    4565                      .dwattr $C$DW$214, DW_AT_name("Cs")
    4566                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE   96

    4567                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    4568                      .dwattr $C$DW$214, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4569                      .dwattr $C$DW$214, DW_AT_decl_line(0x2c)
    4570                      .dwattr $C$DW$214, DW_AT_decl_column(0x12)
    4571              
    4572              $C$DW$215       .dwtag  DW_TAG_member
    4573                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    4574                      .dwattr $C$DW$215, DW_AT_name("Alpha")
    4575                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4576                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    4577                      .dwattr $C$DW$215, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4578                      .dwattr $C$DW$215, DW_AT_decl_line(0x2d)
    4579                      .dwattr $C$DW$215, DW_AT_decl_column(0x12)
    4580              
    4581              $C$DW$216       .dwtag  DW_TAG_member
    4582                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    4583                      .dwattr $C$DW$216, DW_AT_name("Beta")
    4584                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4585                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    4586                      .dwattr $C$DW$216, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4587                      .dwattr $C$DW$216, DW_AT_decl_line(0x2e)
    4588                      .dwattr $C$DW$216, DW_AT_decl_column(0x12)
    4589              
    4590                      .dwattr $C$DW$T$23, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4591                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x2a)
    4592                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
    4593                      .dwendtag $C$DW$T$23
    4594              
    4595                      .dwendtag $C$DW$TU$23
    4596              
    4597              
    4598              $C$DW$TU$85     .dwtag  DW_TAG_type_unit
    4599                      .dwmtype  $C$DW$T$85
    4600              $C$DW$T$85      .dwtag  DW_TAG_typedef
    4601                      .dwattr $C$DW$T$85, DW_AT_name("CLARKE")
    4602                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$23)
    4603                      .dwattr $C$DW$T$85, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4604                      .dwattr $C$DW$T$85, DW_AT_decl_line(0x2f)
    4605                      .dwattr $C$DW$T$85, DW_AT_decl_column(0x09)
    4606              
    4607                      .dwendtag $C$DW$TU$85
    4608              
    4609              
    4610              $C$DW$TU$24     .dwtag  DW_TAG_type_unit
    4611                      .dwmtype  $C$DW$T$24
    4612              
    4613              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    4614                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0e)
    4615              $C$DW$217       .dwtag  DW_TAG_member
    4616                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    4617                      .dwattr $C$DW$217, DW_AT_name("Alpha")
    4618                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    4619                      .dwattr $C$DW$217, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4620                      .dwattr $C$DW$217, DW_AT_decl_line(0x29)
    4621                      .dwattr $C$DW$217, DW_AT_decl_column(0x1e)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE   97

    4622              
    4623              $C$DW$218       .dwtag  DW_TAG_member
    4624                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    4625                      .dwattr $C$DW$218, DW_AT_name("Beta")
    4626                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4627                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    4628                      .dwattr $C$DW$218, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4629                      .dwattr $C$DW$218, DW_AT_decl_line(0x2a)
    4630                      .dwattr $C$DW$218, DW_AT_decl_column(0x12)
    4631              
    4632              $C$DW$219       .dwtag  DW_TAG_member
    4633                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    4634                      .dwattr $C$DW$219, DW_AT_name("Angle")
    4635                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4636                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    4637                      .dwattr $C$DW$219, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4638                      .dwattr $C$DW$219, DW_AT_decl_line(0x2b)
    4639                      .dwattr $C$DW$219, DW_AT_decl_column(0x12)
    4640              
    4641              $C$DW$220       .dwtag  DW_TAG_member
    4642                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    4643                      .dwattr $C$DW$220, DW_AT_name("Ds")
    4644                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4645                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    4646                      .dwattr $C$DW$220, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4647                      .dwattr $C$DW$220, DW_AT_decl_line(0x2c)
    4648                      .dwattr $C$DW$220, DW_AT_decl_column(0x12)
    4649              
    4650              $C$DW$221       .dwtag  DW_TAG_member
    4651                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    4652                      .dwattr $C$DW$221, DW_AT_name("Qs")
    4653                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4654                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    4655                      .dwattr $C$DW$221, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4656                      .dwattr $C$DW$221, DW_AT_decl_line(0x2d)
    4657                      .dwattr $C$DW$221, DW_AT_decl_column(0x12)
    4658              
    4659              $C$DW$222       .dwtag  DW_TAG_member
    4660                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    4661                      .dwattr $C$DW$222, DW_AT_name("Sine")
    4662                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4663                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    4664                      .dwattr $C$DW$222, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4665                      .dwattr $C$DW$222, DW_AT_decl_line(0x2e)
    4666                      .dwattr $C$DW$222, DW_AT_decl_column(0x12)
    4667              
    4668              $C$DW$223       .dwtag  DW_TAG_member
    4669                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    4670                      .dwattr $C$DW$223, DW_AT_name("Cosine")
    4671                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4672                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    4673                      .dwattr $C$DW$223, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4674                      .dwattr $C$DW$223, DW_AT_decl_line(0x2f)
    4675                      .dwattr $C$DW$223, DW_AT_decl_column(0x12)
    4676              
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE   98

    4677                      .dwattr $C$DW$T$24, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4678                      .dwattr $C$DW$T$24, DW_AT_decl_line(0x29)
    4679                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    4680                      .dwendtag $C$DW$T$24
    4681              
    4682                      .dwendtag $C$DW$TU$24
    4683              
    4684              
    4685              $C$DW$TU$86     .dwtag  DW_TAG_type_unit
    4686                      .dwmtype  $C$DW$T$86
    4687              $C$DW$T$86      .dwtag  DW_TAG_typedef
    4688                      .dwattr $C$DW$T$86, DW_AT_name("PARK")
    4689                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$24)
    4690                      .dwattr $C$DW$T$86, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4691                      .dwattr $C$DW$T$86, DW_AT_decl_line(0x30)
    4692                      .dwattr $C$DW$T$86, DW_AT_decl_column(0x09)
    4693              
    4694                      .dwendtag $C$DW$TU$86
    4695              
    4696              
    4697              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    4698                      .dwmtype  $C$DW$T$25
    4699              
    4700              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4701                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
    4702              $C$DW$224       .dwtag  DW_TAG_member
    4703                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    4704                      .dwattr $C$DW$224, DW_AT_name("Alpha")
    4705                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    4706                      .dwattr $C$DW$224, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4707                      .dwattr $C$DW$224, DW_AT_decl_line(0x29)
    4708                      .dwattr $C$DW$224, DW_AT_decl_column(0x1e)
    4709              
    4710              $C$DW$225       .dwtag  DW_TAG_member
    4711                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    4712                      .dwattr $C$DW$225, DW_AT_name("Beta")
    4713                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4714                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    4715                      .dwattr $C$DW$225, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4716                      .dwattr $C$DW$225, DW_AT_decl_line(0x2a)
    4717                      .dwattr $C$DW$225, DW_AT_decl_column(0x12)
    4718              
    4719              $C$DW$226       .dwtag  DW_TAG_member
    4720                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    4721                      .dwattr $C$DW$226, DW_AT_name("Angle")
    4722                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4723                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    4724                      .dwattr $C$DW$226, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4725                      .dwattr $C$DW$226, DW_AT_decl_line(0x2b)
    4726                      .dwattr $C$DW$226, DW_AT_decl_column(0x12)
    4727              
    4728              $C$DW$227       .dwtag  DW_TAG_member
    4729                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    4730                      .dwattr $C$DW$227, DW_AT_name("Ds")
    4731                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE   99

    4732                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    4733                      .dwattr $C$DW$227, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4734                      .dwattr $C$DW$227, DW_AT_decl_line(0x2c)
    4735                      .dwattr $C$DW$227, DW_AT_decl_column(0x12)
    4736              
    4737              $C$DW$228       .dwtag  DW_TAG_member
    4738                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    4739                      .dwattr $C$DW$228, DW_AT_name("Qs")
    4740                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4741                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    4742                      .dwattr $C$DW$228, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4743                      .dwattr $C$DW$228, DW_AT_decl_line(0x2d)
    4744                      .dwattr $C$DW$228, DW_AT_decl_column(0x12)
    4745              
    4746              $C$DW$229       .dwtag  DW_TAG_member
    4747                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    4748                      .dwattr $C$DW$229, DW_AT_name("Sine")
    4749                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4750                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    4751                      .dwattr $C$DW$229, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4752                      .dwattr $C$DW$229, DW_AT_decl_line(0x2e)
    4753                      .dwattr $C$DW$229, DW_AT_decl_column(0x12)
    4754              
    4755              $C$DW$230       .dwtag  DW_TAG_member
    4756                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    4757                      .dwattr $C$DW$230, DW_AT_name("Cosine")
    4758                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4759                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    4760                      .dwattr $C$DW$230, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4761                      .dwattr $C$DW$230, DW_AT_decl_line(0x2f)
    4762                      .dwattr $C$DW$230, DW_AT_decl_column(0x12)
    4763              
    4764                      .dwattr $C$DW$T$25, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4765                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x29)
    4766                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    4767                      .dwendtag $C$DW$T$25
    4768              
    4769                      .dwendtag $C$DW$TU$25
    4770              
    4771              
    4772              $C$DW$TU$87     .dwtag  DW_TAG_type_unit
    4773                      .dwmtype  $C$DW$T$87
    4774              $C$DW$T$87      .dwtag  DW_TAG_typedef
    4775                      .dwattr $C$DW$T$87, DW_AT_name("IPARK")
    4776                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$25)
    4777                      .dwattr $C$DW$T$87, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4778                      .dwattr $C$DW$T$87, DW_AT_decl_line(0x30)
    4779                      .dwattr $C$DW$T$87, DW_AT_decl_column(0x0b)
    4780              
    4781                      .dwendtag $C$DW$TU$87
    4782              
    4783              
    4784              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    4785                      .dwmtype  $C$DW$T$28
    4786              
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE  100

    4787              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4788                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x14)
    4789              $C$DW$231       .dwtag  DW_TAG_member
    4790                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    4791                      .dwattr $C$DW$231, DW_AT_name("ElecTheta")
    4792                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    4793                      .dwattr $C$DW$231, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4794                      .dwattr $C$DW$231, DW_AT_decl_line(0x2b)
    4795                      .dwattr $C$DW$231, DW_AT_decl_column(0x12)
    4796              
    4797              $C$DW$232       .dwtag  DW_TAG_member
    4798                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$21)
    4799                      .dwattr $C$DW$232, DW_AT_name("DirectionQep")
    4800                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4801                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    4802                      .dwattr $C$DW$232, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4803                      .dwattr $C$DW$232, DW_AT_decl_line(0x2c)
    4804                      .dwattr $C$DW$232, DW_AT_decl_column(0x11)
    4805              
    4806              $C$DW$233       .dwtag  DW_TAG_member
    4807                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    4808                      .dwattr $C$DW$233, DW_AT_name("OldElecTheta")
    4809                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4810                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    4811                      .dwattr $C$DW$233, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4812                      .dwattr $C$DW$233, DW_AT_decl_line(0x2d)
    4813                      .dwattr $C$DW$233, DW_AT_decl_column(0x12)
    4814              
    4815              $C$DW$234       .dwtag  DW_TAG_member
    4816                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    4817                      .dwattr $C$DW$234, DW_AT_name("Speed")
    4818                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4819                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    4820                      .dwattr $C$DW$234, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4821                      .dwattr $C$DW$234, DW_AT_decl_line(0x2e)
    4822                      .dwattr $C$DW$234, DW_AT_decl_column(0x12)
    4823              
    4824              $C$DW$235       .dwtag  DW_TAG_member
    4825                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$21)
    4826                      .dwattr $C$DW$235, DW_AT_name("BaseRpm")
    4827                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4828                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    4829                      .dwattr $C$DW$235, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4830                      .dwattr $C$DW$235, DW_AT_decl_line(0x2f)
    4831                      .dwattr $C$DW$235, DW_AT_decl_column(0x11)
    4832              
    4833              $C$DW$236       .dwtag  DW_TAG_member
    4834                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    4835                      .dwattr $C$DW$236, DW_AT_name("K1")
    4836                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4837                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    4838                      .dwattr $C$DW$236, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4839                      .dwattr $C$DW$236, DW_AT_decl_line(0x30)
    4840                      .dwattr $C$DW$236, DW_AT_decl_column(0x12)
    4841              
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE  101

    4842              $C$DW$237       .dwtag  DW_TAG_member
    4843                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    4844                      .dwattr $C$DW$237, DW_AT_name("K2")
    4845                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4846                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    4847                      .dwattr $C$DW$237, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4848                      .dwattr $C$DW$237, DW_AT_decl_line(0x31)
    4849                      .dwattr $C$DW$237, DW_AT_decl_column(0x12)
    4850              
    4851              $C$DW$238       .dwtag  DW_TAG_member
    4852                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    4853                      .dwattr $C$DW$238, DW_AT_name("K3")
    4854                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4855                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    4856                      .dwattr $C$DW$238, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4857                      .dwattr $C$DW$238, DW_AT_decl_line(0x32)
    4858                      .dwattr $C$DW$238, DW_AT_decl_column(0x12)
    4859              
    4860              $C$DW$239       .dwtag  DW_TAG_member
    4861                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$27)
    4862                      .dwattr $C$DW$239, DW_AT_name("SpeedRpm")
    4863                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4864                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    4865                      .dwattr $C$DW$239, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4866                      .dwattr $C$DW$239, DW_AT_decl_line(0x33)
    4867                      .dwattr $C$DW$239, DW_AT_decl_column(0x10)
    4868              
    4869              $C$DW$240       .dwtag  DW_TAG_member
    4870                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    4871                      .dwattr $C$DW$240, DW_AT_name("Tmp")
    4872                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4873                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    4874                      .dwattr $C$DW$240, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4875                      .dwattr $C$DW$240, DW_AT_decl_line(0x34)
    4876                      .dwattr $C$DW$240, DW_AT_decl_column(0x12)
    4877              
    4878                      .dwattr $C$DW$T$28, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4879                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x2a)
    4880                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    4881                      .dwendtag $C$DW$T$28
    4882              
    4883                      .dwendtag $C$DW$TU$28
    4884              
    4885              
    4886              $C$DW$TU$88     .dwtag  DW_TAG_type_unit
    4887                      .dwmtype  $C$DW$T$88
    4888              $C$DW$T$88      .dwtag  DW_TAG_typedef
    4889                      .dwattr $C$DW$T$88, DW_AT_name("SPEED_MEAS_QEP")
    4890                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$28)
    4891                      .dwattr $C$DW$T$88, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4892                      .dwattr $C$DW$T$88, DW_AT_decl_line(0x35)
    4893                      .dwattr $C$DW$T$88, DW_AT_decl_column(0x0a)
    4894              
    4895                      .dwendtag $C$DW$TU$88
    4896              
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE  102

    4897              
    4898              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    4899                      .dwmtype  $C$DW$T$29
    4900              
    4901              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4902                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x16)
    4903              $C$DW$241       .dwtag  DW_TAG_member
    4904                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    4905                      .dwattr $C$DW$241, DW_AT_name("ref")
    4906                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    4907                      .dwattr $C$DW$241, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
    4908                      .dwattr $C$DW$241, DW_AT_decl_line(0x18)
    4909                      .dwattr $C$DW$241, DW_AT_decl_column(0x10)
    4910              
    4911              $C$DW$242       .dwtag  DW_TAG_member
    4912                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    4913                      .dwattr $C$DW$242, DW_AT_name("fbk")
    4914                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4915                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    4916                      .dwattr $C$DW$242, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
    4917                      .dwattr $C$DW$242, DW_AT_decl_line(0x19)
    4918                      .dwattr $C$DW$242, DW_AT_decl_column(0x10)
    4919              
    4920              $C$DW$243       .dwtag  DW_TAG_member
    4921                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    4922                      .dwattr $C$DW$243, DW_AT_name("err")
    4923                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4924                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    4925                      .dwattr $C$DW$243, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
    4926                      .dwattr $C$DW$243, DW_AT_decl_line(0x1a)
    4927                      .dwattr $C$DW$243, DW_AT_decl_column(0x10)
    4928              
    4929              $C$DW$244       .dwtag  DW_TAG_member
    4930                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    4931                      .dwattr $C$DW$244, DW_AT_name("out")
    4932                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4933                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    4934                      .dwattr $C$DW$244, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
    4935                      .dwattr $C$DW$244, DW_AT_decl_line(0x1b)
    4936                      .dwattr $C$DW$244, DW_AT_decl_column(0x10)
    4937              
    4938              $C$DW$245       .dwtag  DW_TAG_member
    4939                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    4940                      .dwattr $C$DW$245, DW_AT_name("carryOver")
    4941                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4942                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    4943                      .dwattr $C$DW$245, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
    4944                      .dwattr $C$DW$245, DW_AT_decl_line(0x1c)
    4945                      .dwattr $C$DW$245, DW_AT_decl_column(0x10)
    4946              
    4947              $C$DW$246       .dwtag  DW_TAG_member
    4948                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    4949                      .dwattr $C$DW$246, DW_AT_name("Kp")
    4950                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4951                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE  103

    4952                      .dwattr $C$DW$246, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
    4953                      .dwattr $C$DW$246, DW_AT_decl_line(0x1d)
    4954                      .dwattr $C$DW$246, DW_AT_decl_column(0x10)
    4955              
    4956              $C$DW$247       .dwtag  DW_TAG_member
    4957                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    4958                      .dwattr $C$DW$247, DW_AT_name("Ki")
    4959                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4960                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    4961                      .dwattr $C$DW$247, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
    4962                      .dwattr $C$DW$247, DW_AT_decl_line(0x1e)
    4963                      .dwattr $C$DW$247, DW_AT_decl_column(0x10)
    4964              
    4965              $C$DW$248       .dwtag  DW_TAG_member
    4966                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    4967                      .dwattr $C$DW$248, DW_AT_name("Kerr")
    4968                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4969                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    4970                      .dwattr $C$DW$248, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
    4971                      .dwattr $C$DW$248, DW_AT_decl_line(0x1f)
    4972                      .dwattr $C$DW$248, DW_AT_decl_column(0x10)
    4973              
    4974              $C$DW$249       .dwtag  DW_TAG_member
    4975                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    4976                      .dwattr $C$DW$249, DW_AT_name("KerrOld")
    4977                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4978                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    4979                      .dwattr $C$DW$249, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
    4980                      .dwattr $C$DW$249, DW_AT_decl_line(0x20)
    4981                      .dwattr $C$DW$249, DW_AT_decl_column(0x10)
    4982              
    4983              $C$DW$250       .dwtag  DW_TAG_member
    4984                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    4985                      .dwattr $C$DW$250, DW_AT_name("Umax")
    4986                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4987                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    4988                      .dwattr $C$DW$250, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
    4989                      .dwattr $C$DW$250, DW_AT_decl_line(0x21)
    4990                      .dwattr $C$DW$250, DW_AT_decl_column(0x10)
    4991              
    4992              $C$DW$251       .dwtag  DW_TAG_member
    4993                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    4994                      .dwattr $C$DW$251, DW_AT_name("Umin")
    4995                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4996                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    4997                      .dwattr $C$DW$251, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/i
    4998                      .dwattr $C$DW$251, DW_AT_decl_line(0x22)
    4999                      .dwattr $C$DW$251, DW_AT_decl_column(0x10)
    5000              
    5001                      .dwattr $C$DW$T$29, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/
    5002                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x17)
    5003                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    5004                      .dwendtag $C$DW$T$29
    5005              
    5006                      .dwendtag $C$DW$TU$29
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE  104

    5007              
    5008              
    5009              $C$DW$TU$71     .dwtag  DW_TAG_type_unit
    5010                      .dwmtype  $C$DW$T$71
    5011              $C$DW$T$71      .dwtag  DW_TAG_typedef
    5012                      .dwattr $C$DW$T$71, DW_AT_name("FCL_PIController_t")
    5013                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$29)
    5014                      .dwattr $C$DW$T$71, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/fcl/
    5015                      .dwattr $C$DW$T$71, DW_AT_decl_line(0x23)
    5016                      .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    5017              
    5018                      .dwendtag $C$DW$TU$71
    5019              
    5020              
    5021              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    5022                      .dwmtype  $C$DW$T$30
    5023              
    5024              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    5025                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x18)
    5026              $C$DW$252       .dwtag  DW_TAG_member
    5027                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    5028                      .dwattr $C$DW$252, DW_AT_name("Ref")
    5029                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    5030                      .dwattr $C$DW$252, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5031                      .dwattr $C$DW$252, DW_AT_decl_line(0x2a)
    5032                      .dwattr $C$DW$252, DW_AT_decl_column(0x1e)
    5033              
    5034              $C$DW$253       .dwtag  DW_TAG_member
    5035                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    5036                      .dwattr $C$DW$253, DW_AT_name("Fbk")
    5037                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5038                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    5039                      .dwattr $C$DW$253, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5040                      .dwattr $C$DW$253, DW_AT_decl_line(0x2b)
    5041                      .dwattr $C$DW$253, DW_AT_decl_column(0x12)
    5042              
    5043              $C$DW$254       .dwtag  DW_TAG_member
    5044                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$19)
    5045                      .dwattr $C$DW$254, DW_AT_name("Out")
    5046                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5047                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    5048                      .dwattr $C$DW$254, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5049                      .dwattr $C$DW$254, DW_AT_decl_line(0x2c)
    5050                      .dwattr $C$DW$254, DW_AT_decl_column(0x12)
    5051              
    5052              $C$DW$255       .dwtag  DW_TAG_member
    5053                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
    5054                      .dwattr $C$DW$255, DW_AT_name("Kp")
    5055                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5056                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    5057                      .dwattr $C$DW$255, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5058                      .dwattr $C$DW$255, DW_AT_decl_line(0x2d)
    5059                      .dwattr $C$DW$255, DW_AT_decl_column(0x12)
    5060              
    5061              $C$DW$256       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE  105

    5062                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
    5063                      .dwattr $C$DW$256, DW_AT_name("Ki")
    5064                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5065                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    5066                      .dwattr $C$DW$256, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5067                      .dwattr $C$DW$256, DW_AT_decl_line(0x2e)
    5068                      .dwattr $C$DW$256, DW_AT_decl_column(0x12)
    5069              
    5070              $C$DW$257       .dwtag  DW_TAG_member
    5071                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    5072                      .dwattr $C$DW$257, DW_AT_name("Umax")
    5073                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5074                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    5075                      .dwattr $C$DW$257, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5076                      .dwattr $C$DW$257, DW_AT_decl_line(0x2f)
    5077                      .dwattr $C$DW$257, DW_AT_decl_column(0x12)
    5078              
    5079              $C$DW$258       .dwtag  DW_TAG_member
    5080                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    5081                      .dwattr $C$DW$258, DW_AT_name("Umin")
    5082                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5083                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    5084                      .dwattr $C$DW$258, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5085                      .dwattr $C$DW$258, DW_AT_decl_line(0x30)
    5086                      .dwattr $C$DW$258, DW_AT_decl_column(0x12)
    5087              
    5088              $C$DW$259       .dwtag  DW_TAG_member
    5089                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    5090                      .dwattr $C$DW$259, DW_AT_name("up")
    5091                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5092                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    5093                      .dwattr $C$DW$259, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5094                      .dwattr $C$DW$259, DW_AT_decl_line(0x31)
    5095                      .dwattr $C$DW$259, DW_AT_decl_column(0x12)
    5096              
    5097              $C$DW$260       .dwtag  DW_TAG_member
    5098                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    5099                      .dwattr $C$DW$260, DW_AT_name("ui")
    5100                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5101                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    5102                      .dwattr $C$DW$260, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5103                      .dwattr $C$DW$260, DW_AT_decl_line(0x32)
    5104                      .dwattr $C$DW$260, DW_AT_decl_column(0x12)
    5105              
    5106              $C$DW$261       .dwtag  DW_TAG_member
    5107                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    5108                      .dwattr $C$DW$261, DW_AT_name("v1")
    5109                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5110                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    5111                      .dwattr $C$DW$261, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5112                      .dwattr $C$DW$261, DW_AT_decl_line(0x33)
    5113                      .dwattr $C$DW$261, DW_AT_decl_column(0x12)
    5114              
    5115              $C$DW$262       .dwtag  DW_TAG_member
    5116                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE  106

    5117                      .dwattr $C$DW$262, DW_AT_name("i1")
    5118                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5119                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    5120                      .dwattr $C$DW$262, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5121                      .dwattr $C$DW$262, DW_AT_decl_line(0x34)
    5122                      .dwattr $C$DW$262, DW_AT_decl_column(0x12)
    5123              
    5124              $C$DW$263       .dwtag  DW_TAG_member
    5125                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    5126                      .dwattr $C$DW$263, DW_AT_name("w1")
    5127                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5128                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    5129                      .dwattr $C$DW$263, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5130                      .dwattr $C$DW$263, DW_AT_decl_line(0x35)
    5131                      .dwattr $C$DW$263, DW_AT_decl_column(0x12)
    5132              
    5133                      .dwattr $C$DW$T$30, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    5134                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x2a)
    5135                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    5136                      .dwendtag $C$DW$T$30
    5137              
    5138                      .dwendtag $C$DW$TU$30
    5139              
    5140              
    5141              $C$DW$TU$89     .dwtag  DW_TAG_type_unit
    5142                      .dwmtype  $C$DW$T$89
    5143              $C$DW$T$89      .dwtag  DW_TAG_typedef
    5144                      .dwattr $C$DW$T$89, DW_AT_name("PI_CONTROLLER")
    5145                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$30)
    5146                      .dwattr $C$DW$T$89, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    5147                      .dwattr $C$DW$T$89, DW_AT_decl_line(0x36)
    5148                      .dwattr $C$DW$T$89, DW_AT_decl_column(0x07)
    5149              
    5150                      .dwendtag $C$DW$TU$89
    5151              
    5152              
    5153              $C$DW$TU$31     .dwtag  DW_TAG_type_unit
    5154                      .dwmtype  $C$DW$T$31
    5155              
    5156              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    5157                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    5158              $C$DW$264       .dwtag  DW_TAG_member
    5159                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    5160                      .dwattr $C$DW$264, DW_AT_name("Ref")
    5161                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    5162                      .dwattr $C$DW$264, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5163                      .dwattr $C$DW$264, DW_AT_decl_line(0x2a)
    5164                      .dwattr $C$DW$264, DW_AT_decl_column(0x1e)
    5165              
    5166              $C$DW$265       .dwtag  DW_TAG_member
    5167                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    5168                      .dwattr $C$DW$265, DW_AT_name("Fbk")
    5169                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5170                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    5171                      .dwattr $C$DW$265, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE  107

    5172                      .dwattr $C$DW$265, DW_AT_decl_line(0x2b)
    5173                      .dwattr $C$DW$265, DW_AT_decl_column(0x12)
    5174              
    5175              $C$DW$266       .dwtag  DW_TAG_member
    5176                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    5177                      .dwattr $C$DW$266, DW_AT_name("Out")
    5178                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5179                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    5180                      .dwattr $C$DW$266, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5181                      .dwattr $C$DW$266, DW_AT_decl_line(0x2c)
    5182                      .dwattr $C$DW$266, DW_AT_decl_column(0x12)
    5183              
    5184              $C$DW$267       .dwtag  DW_TAG_member
    5185                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    5186                      .dwattr $C$DW$267, DW_AT_name("c1")
    5187                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5188                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    5189                      .dwattr $C$DW$267, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5190                      .dwattr $C$DW$267, DW_AT_decl_line(0x2d)
    5191                      .dwattr $C$DW$267, DW_AT_decl_column(0x12)
    5192              
    5193              $C$DW$268       .dwtag  DW_TAG_member
    5194                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    5195                      .dwattr $C$DW$268, DW_AT_name("c2")
    5196                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5197                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    5198                      .dwattr $C$DW$268, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5199                      .dwattr $C$DW$268, DW_AT_decl_line(0x2e)
    5200                      .dwattr $C$DW$268, DW_AT_decl_column(0x12)
    5201              
    5202                      .dwattr $C$DW$T$31, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    5203                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x2a)
    5204                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    5205                      .dwendtag $C$DW$T$31
    5206              
    5207                      .dwendtag $C$DW$TU$31
    5208              
    5209              
    5210              $C$DW$TU$34     .dwtag  DW_TAG_type_unit
    5211                      .dwmtype  $C$DW$T$34
    5212              $C$DW$T$34      .dwtag  DW_TAG_typedef
    5213                      .dwattr $C$DW$T$34, DW_AT_name("PID_TERMINALS")
    5214                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$31)
    5215                      .dwattr $C$DW$T$34, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    5216                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x2f)
    5217                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x07)
    5218              
    5219                      .dwendtag $C$DW$TU$34
    5220              
    5221              
    5222              $C$DW$TU$32     .dwtag  DW_TAG_type_unit
    5223                      .dwmtype  $C$DW$T$32
    5224              
    5225              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    5226                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE  108

    5227              $C$DW$269       .dwtag  DW_TAG_member
    5228                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    5229                      .dwattr $C$DW$269, DW_AT_name("Kr")
    5230                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    5231                      .dwattr $C$DW$269, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5232                      .dwattr $C$DW$269, DW_AT_decl_line(0x32)
    5233                      .dwattr $C$DW$269, DW_AT_decl_column(0x1e)
    5234              
    5235              $C$DW$270       .dwtag  DW_TAG_member
    5236                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    5237                      .dwattr $C$DW$270, DW_AT_name("Kp")
    5238                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5239                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    5240                      .dwattr $C$DW$270, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5241                      .dwattr $C$DW$270, DW_AT_decl_line(0x33)
    5242                      .dwattr $C$DW$270, DW_AT_decl_column(0x12)
    5243              
    5244              $C$DW$271       .dwtag  DW_TAG_member
    5245                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
    5246                      .dwattr $C$DW$271, DW_AT_name("Ki")
    5247                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5248                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    5249                      .dwattr $C$DW$271, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5250                      .dwattr $C$DW$271, DW_AT_decl_line(0x34)
    5251                      .dwattr $C$DW$271, DW_AT_decl_column(0x12)
    5252              
    5253              $C$DW$272       .dwtag  DW_TAG_member
    5254                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$19)
    5255                      .dwattr $C$DW$272, DW_AT_name("Kd")
    5256                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5257                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    5258                      .dwattr $C$DW$272, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5259                      .dwattr $C$DW$272, DW_AT_decl_line(0x35)
    5260                      .dwattr $C$DW$272, DW_AT_decl_column(0x12)
    5261              
    5262              $C$DW$273       .dwtag  DW_TAG_member
    5263                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$19)
    5264                      .dwattr $C$DW$273, DW_AT_name("Km")
    5265                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5266                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    5267                      .dwattr $C$DW$273, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5268                      .dwattr $C$DW$273, DW_AT_decl_line(0x36)
    5269                      .dwattr $C$DW$273, DW_AT_decl_column(0x12)
    5270              
    5271              $C$DW$274       .dwtag  DW_TAG_member
    5272                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
    5273                      .dwattr $C$DW$274, DW_AT_name("Umax")
    5274                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5275                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    5276                      .dwattr $C$DW$274, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5277                      .dwattr $C$DW$274, DW_AT_decl_line(0x37)
    5278                      .dwattr $C$DW$274, DW_AT_decl_column(0x12)
    5279              
    5280              $C$DW$275       .dwtag  DW_TAG_member
    5281                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE  109

    5282                      .dwattr $C$DW$275, DW_AT_name("Umin")
    5283                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5284                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    5285                      .dwattr $C$DW$275, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5286                      .dwattr $C$DW$275, DW_AT_decl_line(0x38)
    5287                      .dwattr $C$DW$275, DW_AT_decl_column(0x12)
    5288              
    5289                      .dwattr $C$DW$T$32, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    5290                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x32)
    5291                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    5292                      .dwendtag $C$DW$T$32
    5293              
    5294                      .dwendtag $C$DW$TU$32
    5295              
    5296              
    5297              $C$DW$TU$35     .dwtag  DW_TAG_type_unit
    5298                      .dwmtype  $C$DW$T$35
    5299              $C$DW$T$35      .dwtag  DW_TAG_typedef
    5300                      .dwattr $C$DW$T$35, DW_AT_name("PID_PARAMETERS")
    5301                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$32)
    5302                      .dwattr $C$DW$T$35, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    5303                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x39)
    5304                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x07)
    5305              
    5306                      .dwendtag $C$DW$TU$35
    5307              
    5308              
    5309              $C$DW$TU$33     .dwtag  DW_TAG_type_unit
    5310                      .dwmtype  $C$DW$T$33
    5311              
    5312              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5313                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x10)
    5314              $C$DW$276       .dwtag  DW_TAG_member
    5315                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    5316                      .dwattr $C$DW$276, DW_AT_name("up")
    5317                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    5318                      .dwattr $C$DW$276, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5319                      .dwattr $C$DW$276, DW_AT_decl_line(0x3b)
    5320                      .dwattr $C$DW$276, DW_AT_decl_column(0x1e)
    5321              
    5322              $C$DW$277       .dwtag  DW_TAG_member
    5323                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    5324                      .dwattr $C$DW$277, DW_AT_name("ui")
    5325                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5326                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    5327                      .dwattr $C$DW$277, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5328                      .dwattr $C$DW$277, DW_AT_decl_line(0x3c)
    5329                      .dwattr $C$DW$277, DW_AT_decl_column(0x12)
    5330              
    5331              $C$DW$278       .dwtag  DW_TAG_member
    5332                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    5333                      .dwattr $C$DW$278, DW_AT_name("ud")
    5334                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5335                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    5336                      .dwattr $C$DW$278, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE  110

    5337                      .dwattr $C$DW$278, DW_AT_decl_line(0x3d)
    5338                      .dwattr $C$DW$278, DW_AT_decl_column(0x12)
    5339              
    5340              $C$DW$279       .dwtag  DW_TAG_member
    5341                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$19)
    5342                      .dwattr $C$DW$279, DW_AT_name("v1")
    5343                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5344                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    5345                      .dwattr $C$DW$279, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5346                      .dwattr $C$DW$279, DW_AT_decl_line(0x3e)
    5347                      .dwattr $C$DW$279, DW_AT_decl_column(0x12)
    5348              
    5349              $C$DW$280       .dwtag  DW_TAG_member
    5350                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
    5351                      .dwattr $C$DW$280, DW_AT_name("i1")
    5352                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5353                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    5354                      .dwattr $C$DW$280, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5355                      .dwattr $C$DW$280, DW_AT_decl_line(0x3f)
    5356                      .dwattr $C$DW$280, DW_AT_decl_column(0x12)
    5357              
    5358              $C$DW$281       .dwtag  DW_TAG_member
    5359                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$19)
    5360                      .dwattr $C$DW$281, DW_AT_name("d1")
    5361                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5362                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    5363                      .dwattr $C$DW$281, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5364                      .dwattr $C$DW$281, DW_AT_decl_line(0x40)
    5365                      .dwattr $C$DW$281, DW_AT_decl_column(0x12)
    5366              
    5367              $C$DW$282       .dwtag  DW_TAG_member
    5368                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$19)
    5369                      .dwattr $C$DW$282, DW_AT_name("d2")
    5370                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5371                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    5372                      .dwattr $C$DW$282, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5373                      .dwattr $C$DW$282, DW_AT_decl_line(0x41)
    5374                      .dwattr $C$DW$282, DW_AT_decl_column(0x12)
    5375              
    5376              $C$DW$283       .dwtag  DW_TAG_member
    5377                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$19)
    5378                      .dwattr $C$DW$283, DW_AT_name("w1")
    5379                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5380                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    5381                      .dwattr $C$DW$283, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5382                      .dwattr $C$DW$283, DW_AT_decl_line(0x42)
    5383                      .dwattr $C$DW$283, DW_AT_decl_column(0x12)
    5384              
    5385                      .dwattr $C$DW$T$33, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    5386                      .dwattr $C$DW$T$33, DW_AT_decl_line(0x3b)
    5387                      .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    5388                      .dwendtag $C$DW$T$33
    5389              
    5390                      .dwendtag $C$DW$TU$33
    5391              
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE  111

    5392              
    5393              $C$DW$TU$36     .dwtag  DW_TAG_type_unit
    5394                      .dwmtype  $C$DW$T$36
    5395              $C$DW$T$36      .dwtag  DW_TAG_typedef
    5396                      .dwattr $C$DW$T$36, DW_AT_name("PID_DATA")
    5397                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$33)
    5398                      .dwattr $C$DW$T$36, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    5399                      .dwattr $C$DW$T$36, DW_AT_decl_line(0x43)
    5400                      .dwattr $C$DW$T$36, DW_AT_decl_column(0x07)
    5401              
    5402                      .dwendtag $C$DW$TU$36
    5403              
    5404              
    5405              $C$DW$TU$37     .dwtag  DW_TAG_type_unit
    5406                      .dwmtype  $C$DW$T$37
    5407              
    5408              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    5409                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x28)
    5410              $C$DW$284       .dwtag  DW_TAG_member
    5411                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$34)
    5412                      .dwattr $C$DW$284, DW_AT_name("term")
    5413                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    5414                      .dwattr $C$DW$284, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5415                      .dwattr $C$DW$284, DW_AT_decl_line(0x46)
    5416                      .dwattr $C$DW$284, DW_AT_decl_column(0x21)
    5417              
    5418              $C$DW$285       .dwtag  DW_TAG_member
    5419                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$35)
    5420                      .dwattr $C$DW$285, DW_AT_name("param")
    5421                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5422                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    5423                      .dwattr $C$DW$285, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5424                      .dwattr $C$DW$285, DW_AT_decl_line(0x47)
    5425                      .dwattr $C$DW$285, DW_AT_decl_column(0x16)
    5426              
    5427              $C$DW$286       .dwtag  DW_TAG_member
    5428                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$36)
    5429                      .dwattr $C$DW$286, DW_AT_name("data")
    5430                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5431                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    5432                      .dwattr $C$DW$286, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5433                      .dwattr $C$DW$286, DW_AT_decl_line(0x48)
    5434                      .dwattr $C$DW$286, DW_AT_decl_column(0x11)
    5435              
    5436                      .dwattr $C$DW$T$37, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    5437                      .dwattr $C$DW$T$37, DW_AT_decl_line(0x46)
    5438                      .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    5439                      .dwendtag $C$DW$T$37
    5440              
    5441                      .dwendtag $C$DW$TU$37
    5442              
    5443              
    5444              $C$DW$TU$90     .dwtag  DW_TAG_type_unit
    5445                      .dwmtype  $C$DW$T$90
    5446              $C$DW$T$90      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE  112

    5447                      .dwattr $C$DW$T$90, DW_AT_name("PID_CONTROLLER")
    5448                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$37)
    5449                      .dwattr $C$DW$T$90, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    5450                      .dwattr $C$DW$T$90, DW_AT_decl_line(0x49)
    5451                      .dwattr $C$DW$T$90, DW_AT_decl_column(0x07)
    5452              
    5453                      .dwendtag $C$DW$TU$90
    5454              
    5455              
    5456              $C$DW$TU$38     .dwtag  DW_TAG_type_unit
    5457                      .dwmtype  $C$DW$T$38
    5458              
    5459              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    5460                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x0c)
    5461              $C$DW$287       .dwtag  DW_TAG_member
    5462                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
    5463                      .dwattr $C$DW$287, DW_AT_name("Freq")
    5464                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    5465                      .dwattr $C$DW$287, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5466                      .dwattr $C$DW$287, DW_AT_decl_line(0x25)
    5467                      .dwattr $C$DW$287, DW_AT_decl_column(0x1d)
    5468              
    5469              $C$DW$288       .dwtag  DW_TAG_member
    5470                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
    5471                      .dwattr $C$DW$288, DW_AT_name("StepAngleMax")
    5472                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5473                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    5474                      .dwattr $C$DW$288, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5475                      .dwattr $C$DW$288, DW_AT_decl_line(0x26)
    5476                      .dwattr $C$DW$288, DW_AT_decl_column(0x1d)
    5477              
    5478              $C$DW$289       .dwtag  DW_TAG_member
    5479                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$19)
    5480                      .dwattr $C$DW$289, DW_AT_name("Angle")
    5481                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5482                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    5483                      .dwattr $C$DW$289, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5484                      .dwattr $C$DW$289, DW_AT_decl_line(0x27)
    5485                      .dwattr $C$DW$289, DW_AT_decl_column(0x1d)
    5486              
    5487              $C$DW$290       .dwtag  DW_TAG_member
    5488                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$19)
    5489                      .dwattr $C$DW$290, DW_AT_name("Gain")
    5490                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5491                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    5492                      .dwattr $C$DW$290, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5493                      .dwattr $C$DW$290, DW_AT_decl_line(0x28)
    5494                      .dwattr $C$DW$290, DW_AT_decl_column(0x1d)
    5495              
    5496              $C$DW$291       .dwtag  DW_TAG_member
    5497                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$19)
    5498                      .dwattr $C$DW$291, DW_AT_name("Out")
    5499                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5500                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    5501                      .dwattr $C$DW$291, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE  113

    5502                      .dwattr $C$DW$291, DW_AT_decl_line(0x29)
    5503                      .dwattr $C$DW$291, DW_AT_decl_column(0x1d)
    5504              
    5505              $C$DW$292       .dwtag  DW_TAG_member
    5506                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$19)
    5507                      .dwattr $C$DW$292, DW_AT_name("Offset")
    5508                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5509                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    5510                      .dwattr $C$DW$292, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5511                      .dwattr $C$DW$292, DW_AT_decl_line(0x2a)
    5512                      .dwattr $C$DW$292, DW_AT_decl_column(0x1d)
    5513              
    5514                      .dwattr $C$DW$T$38, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    5515                      .dwattr $C$DW$T$38, DW_AT_decl_line(0x25)
    5516                      .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    5517                      .dwendtag $C$DW$T$38
    5518              
    5519                      .dwendtag $C$DW$TU$38
    5520              
    5521              
    5522              $C$DW$TU$70     .dwtag  DW_TAG_type_unit
    5523                      .dwmtype  $C$DW$T$70
    5524              $C$DW$T$70      .dwtag  DW_TAG_typedef
    5525                      .dwattr $C$DW$T$70, DW_AT_name("RAMP_GEN_CLA")
    5526                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$38)
    5527                      .dwattr $C$DW$T$70, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    5528                      .dwattr $C$DW$T$70, DW_AT_decl_line(0x2b)
    5529                      .dwattr $C$DW$T$70, DW_AT_decl_column(0x0d)
    5530              
    5531                      .dwendtag $C$DW$TU$70
    5532              
    5533              
    5534              $C$DW$TU$41     .dwtag  DW_TAG_type_unit
    5535                      .dwmtype  $C$DW$T$41
    5536              
    5537              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5538                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x12)
    5539              $C$DW$293       .dwtag  DW_TAG_member
    5540                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$19)
    5541                      .dwattr $C$DW$293, DW_AT_name("ElecTheta")
    5542                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    5543                      .dwattr $C$DW$293, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    5544                      .dwattr $C$DW$293, DW_AT_decl_line(0x1c)
    5545                      .dwattr $C$DW$293, DW_AT_decl_column(0x0f)
    5546              
    5547              $C$DW$294       .dwtag  DW_TAG_member
    5548                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$19)
    5549                      .dwattr $C$DW$294, DW_AT_name("MechTheta")
    5550                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5551                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    5552                      .dwattr $C$DW$294, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    5553                      .dwattr $C$DW$294, DW_AT_decl_line(0x1d)
    5554                      .dwattr $C$DW$294, DW_AT_decl_column(0x0f)
    5555              
    5556              $C$DW$295       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE  114

    5557                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$40)
    5558                      .dwattr $C$DW$295, DW_AT_name("DirectionQep")
    5559                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5560                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    5561                      .dwattr $C$DW$295, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    5562                      .dwattr $C$DW$295, DW_AT_decl_line(0x1e)
    5563                      .dwattr $C$DW$295, DW_AT_decl_column(0x0f)
    5564              
    5565              $C$DW$296       .dwtag  DW_TAG_member
    5566                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$40)
    5567                      .dwattr $C$DW$296, DW_AT_name("QepPeriod")
    5568                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5569                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    5570                      .dwattr $C$DW$296, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    5571                      .dwattr $C$DW$296, DW_AT_decl_line(0x1f)
    5572                      .dwattr $C$DW$296, DW_AT_decl_column(0x0f)
    5573              
    5574              $C$DW$297       .dwtag  DW_TAG_member
    5575                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$21)
    5576                      .dwattr $C$DW$297, DW_AT_name("QepCountIndex")
    5577                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5578                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    5579                      .dwattr $C$DW$297, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    5580                      .dwattr $C$DW$297, DW_AT_decl_line(0x21)
    5581                      .dwattr $C$DW$297, DW_AT_decl_column(0x0f)
    5582              
    5583              $C$DW$298       .dwtag  DW_TAG_member
    5584                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$27)
    5585                      .dwattr $C$DW$298, DW_AT_name("RawTheta")
    5586                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5587                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    5588                      .dwattr $C$DW$298, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    5589                      .dwattr $C$DW$298, DW_AT_decl_line(0x22)
    5590                      .dwattr $C$DW$298, DW_AT_decl_column(0x0f)
    5591              
    5592              $C$DW$299       .dwtag  DW_TAG_member
    5593                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$19)
    5594                      .dwattr $C$DW$299, DW_AT_name("MechScaler")
    5595                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5596                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    5597                      .dwattr $C$DW$299, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    5598                      .dwattr $C$DW$299, DW_AT_decl_line(0x23)
    5599                      .dwattr $C$DW$299, DW_AT_decl_column(0x0f)
    5600              
    5601              $C$DW$300       .dwtag  DW_TAG_member
    5602                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$40)
    5603                      .dwattr $C$DW$300, DW_AT_name("LineEncoder")
    5604                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5605                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    5606                      .dwattr $C$DW$300, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    5607                      .dwattr $C$DW$300, DW_AT_decl_line(0x24)
    5608                      .dwattr $C$DW$300, DW_AT_decl_column(0x0f)
    5609              
    5610              $C$DW$301       .dwtag  DW_TAG_member
    5611                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$40)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE  115

    5612                      .dwattr $C$DW$301, DW_AT_name("PolePairs")
    5613                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5614                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    5615                      .dwattr $C$DW$301, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    5616                      .dwattr $C$DW$301, DW_AT_decl_line(0x25)
    5617                      .dwattr $C$DW$301, DW_AT_decl_column(0x0f)
    5618              
    5619              $C$DW$302       .dwtag  DW_TAG_member
    5620                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$27)
    5621                      .dwattr $C$DW$302, DW_AT_name("CalibratedAngle")
    5622                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5623                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    5624                      .dwattr $C$DW$302, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    5625                      .dwattr $C$DW$302, DW_AT_decl_line(0x26)
    5626                      .dwattr $C$DW$302, DW_AT_decl_column(0x0f)
    5627              
    5628              $C$DW$303       .dwtag  DW_TAG_member
    5629                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$40)
    5630                      .dwattr $C$DW$303, DW_AT_name("IndexSyncFlag")
    5631                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5632                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    5633                      .dwattr $C$DW$303, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    5634                      .dwattr $C$DW$303, DW_AT_decl_line(0x28)
    5635                      .dwattr $C$DW$303, DW_AT_decl_column(0x0f)
    5636              
    5637                      .dwattr $C$DW$T$41, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posi
    5638                      .dwattr $C$DW$T$41, DW_AT_decl_line(0x1b)
    5639                      .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    5640                      .dwendtag $C$DW$T$41
    5641              
    5642                      .dwendtag $C$DW$TU$41
    5643              
    5644              
    5645              $C$DW$TU$72     .dwtag  DW_TAG_type_unit
    5646                      .dwmtype  $C$DW$T$72
    5647              $C$DW$T$72      .dwtag  DW_TAG_typedef
    5648                      .dwattr $C$DW$T$72, DW_AT_name("QEP")
    5649                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$41)
    5650                      .dwattr $C$DW$T$72, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posi
    5651                      .dwattr $C$DW$T$72, DW_AT_decl_line(0x29)
    5652                      .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    5653              
    5654                      .dwendtag $C$DW$TU$72
    5655              
    5656              
    5657              $C$DW$TU$42     .dwtag  DW_TAG_type_unit
    5658                      .dwmtype  $C$DW$T$42
    5659              
    5660              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    5661                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x12)
    5662              $C$DW$304       .dwtag  DW_TAG_member
    5663                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$19)
    5664                      .dwattr $C$DW$304, DW_AT_name("Ualpha")
    5665                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    5666                      .dwattr $C$DW$304, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
dual_axis_servo_drive_user.asm                                       PAGE  116

    5667                      .dwattr $C$DW$304, DW_AT_decl_line(0x2b)
    5668                      .dwattr $C$DW$304, DW_AT_decl_column(0x10)
    5669              
    5670              $C$DW$305       .dwtag  DW_TAG_member
    5671                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$19)
    5672                      .dwattr $C$DW$305, DW_AT_name("Ubeta")
    5673                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5674                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    5675                      .dwattr $C$DW$305, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5676                      .dwattr $C$DW$305, DW_AT_decl_line(0x2c)
    5677                      .dwattr $C$DW$305, DW_AT_decl_column(0x10)
    5678              
    5679              $C$DW$306       .dwtag  DW_TAG_member
    5680                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$19)
    5681                      .dwattr $C$DW$306, DW_AT_name("Ta")
    5682                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5683                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    5684                      .dwattr $C$DW$306, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5685                      .dwattr $C$DW$306, DW_AT_decl_line(0x2d)
    5686                      .dwattr $C$DW$306, DW_AT_decl_column(0x10)
    5687              
    5688              $C$DW$307       .dwtag  DW_TAG_member
    5689                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$19)
    5690                      .dwattr $C$DW$307, DW_AT_name("Tb")
    5691                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5692                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    5693                      .dwattr $C$DW$307, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5694                      .dwattr $C$DW$307, DW_AT_decl_line(0x2e)
    5695                      .dwattr $C$DW$307, DW_AT_decl_column(0x10)
    5696              
    5697              $C$DW$308       .dwtag  DW_TAG_member
