TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Sat Dec 27 15:00:17 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/fcl_cpu_code_dm.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\JUNLI\workspace_ccstheia\dual_axis_servo_drive_fcl_qep_f28
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("expf")
      16                      .dwattr $C$DW$1, DW_AT_linkage_name("expf")

    3805                      .dwattr $C$DW$151, DW_AT_decl_column(0x05)
    3806              
    3807              $C$DW$152       .dwtag  DW_TAG_enumerator
    3808                      .dwattr $C$DW$152, DW_AT_name("ADC_PPB_NUMBER4")
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE   86

    3809                      .dwattr $C$DW$152, DW_AT_const_value(0x03)
    3810                      .dwattr $C$DW$152, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/drive
    3811                      .dwattr $C$DW$152, DW_AT_decl_line(0x137)
    3812                      .dwattr $C$DW$152, DW_AT_decl_column(0x05)
    3813              
    3814                      .dwattr $C$DW$T$155, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/dri
    3815                      .dwattr $C$DW$T$155, DW_AT_decl_line(0x133)
    3816                      .dwattr $C$DW$T$155, DW_AT_decl_column(0x01)
    3817                      .dwendtag $C$DW$T$155
    3818              
    3819                      .dwendtag $C$DW$TU$155
    3820              
    3821              
    3822              $C$DW$TU$156    .dwtag  DW_TAG_type_unit
    3823                      .dwmtype  $C$DW$T$156
    3824              $C$DW$T$156     .dwtag  DW_TAG_typedef
    3825                      .dwattr $C$DW$T$156, DW_AT_name("ADC_PPBNumber")
    3826                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$155)
    3827                      .dwattr $C$DW$T$156, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/c2000ware/dri
    3828                      .dwattr $C$DW$T$156, DW_AT_decl_line(0x138)
    3829                      .dwattr $C$DW$T$156, DW_AT_decl_column(0x03)
    3830              
    3831                      .dwendtag $C$DW$TU$156
    3832              
    3833              
    3834              $C$DW$TU$157    .dwtag  DW_TAG_type_unit
    3835                      .dwmtype  $C$DW$T$157
    3836              $C$DW$153       .dwtag  DW_TAG_TI_far_type
    3837                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$156)
    3838              
    3839              $C$DW$T$157     .dwtag  DW_TAG_const_type
    3840                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$153)
    3841              
    3842                      .dwendtag $C$DW$TU$157
    3843              
    3844              
    3845              $C$DW$TU$158    .dwtag  DW_TAG_type_unit
    3846                      .dwmtype  $C$DW$T$158
    3847              $C$DW$154       .dwtag  DW_TAG_TI_far_type
    3848                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$156)
    3849              
    3850              $C$DW$T$158     .dwtag  DW_TAG_const_type
    3851                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$154)
    3852              
    3853                      .dwendtag $C$DW$TU$158
    3854              
    3855              
    3856              $C$DW$TU$159    .dwtag  DW_TAG_type_unit
    3857                      .dwmtype  $C$DW$T$159
    3858              $C$DW$155       .dwtag  DW_TAG_TI_far_type
    3859                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$156)
    3860              
    3861              $C$DW$T$159     .dwtag  DW_TAG_const_type
    3862                      .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$155)
    3863              
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE   87

    3864                      .dwendtag $C$DW$TU$159
    3865              
    3866              
    3867              $C$DW$TU$160    .dwtag  DW_TAG_type_unit
    3868                      .dwmtype  $C$DW$T$160
    3869              $C$DW$156       .dwtag  DW_TAG_TI_far_type
    3870                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$156)
    3871              
    3872              $C$DW$T$160     .dwtag  DW_TAG_const_type
    3873                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$156)
    3874              
    3875                      .dwendtag $C$DW$TU$160
    3876              
    3877              
    3878              $C$DW$TU$161    .dwtag  DW_TAG_type_unit
    3879                      .dwmtype  $C$DW$T$161
    3880              $C$DW$157       .dwtag  DW_TAG_TI_far_type
    3881                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$156)
    3882              
    3883              $C$DW$T$161     .dwtag  DW_TAG_const_type
    3884                      .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$157)
    3885              
    3886                      .dwendtag $C$DW$TU$161
    3887              
    3888              
    3889              $C$DW$TU$22     .dwtag  DW_TAG_type_unit
    3890                      .dwmtype  $C$DW$T$22
    3891              
    3892              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3893                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    3894              $C$DW$158       .dwtag  DW_TAG_member
    3895                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    3896                      .dwattr $C$DW$158, DW_AT_name("TargetValue")
    3897                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    3898                      .dwattr $C$DW$158, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    3899                      .dwattr $C$DW$158, DW_AT_decl_line(0x2b)
    3900                      .dwattr $C$DW$158, DW_AT_decl_column(0x0f)
    3901              
    3902              $C$DW$159       .dwtag  DW_TAG_member
    3903                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$21)
    3904                      .dwattr $C$DW$159, DW_AT_name("RampDelayMax")
    3905                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3906                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    3907                      .dwattr $C$DW$159, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    3908                      .dwattr $C$DW$159, DW_AT_decl_line(0x2c)
    3909                      .dwattr $C$DW$159, DW_AT_decl_column(0x0f)
    3910              
    3911              $C$DW$160       .dwtag  DW_TAG_member
    3912                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    3913                      .dwattr $C$DW$160, DW_AT_name("RampLowLimit")
    3914                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3915                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    3916                      .dwattr $C$DW$160, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    3917                      .dwattr $C$DW$160, DW_AT_decl_line(0x2d)
    3918                      .dwattr $C$DW$160, DW_AT_decl_column(0x0f)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE   88

    3919              
    3920              $C$DW$161       .dwtag  DW_TAG_member
    3921                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    3922                      .dwattr $C$DW$161, DW_AT_name("RampHighLimit")
    3923                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3924                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    3925                      .dwattr $C$DW$161, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    3926                      .dwattr $C$DW$161, DW_AT_decl_line(0x2e)
    3927                      .dwattr $C$DW$161, DW_AT_decl_column(0x0f)
    3928              
    3929              $C$DW$162       .dwtag  DW_TAG_member
    3930                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$21)
    3931                      .dwattr $C$DW$162, DW_AT_name("RampDelayCount")
    3932                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3933                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    3934                      .dwattr $C$DW$162, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    3935                      .dwattr $C$DW$162, DW_AT_decl_line(0x2f)
    3936                      .dwattr $C$DW$162, DW_AT_decl_column(0x0c)
    3937              
    3938              $C$DW$163       .dwtag  DW_TAG_member
    3939                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    3940                      .dwattr $C$DW$163, DW_AT_name("SetpointValue")
    3941                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3942                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    3943                      .dwattr $C$DW$163, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    3944                      .dwattr $C$DW$163, DW_AT_decl_line(0x30)
    3945                      .dwattr $C$DW$163, DW_AT_decl_column(0x0c)
    3946              
    3947              $C$DW$164       .dwtag  DW_TAG_member
    3948                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$21)
    3949                      .dwattr $C$DW$164, DW_AT_name("EqualFlag")
    3950                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3951                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3952                      .dwattr $C$DW$164, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    3953                      .dwattr $C$DW$164, DW_AT_decl_line(0x31)
    3954                      .dwattr $C$DW$164, DW_AT_decl_column(0x0c)
    3955              
    3956              $C$DW$165       .dwtag  DW_TAG_member
    3957                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    3958                      .dwattr $C$DW$165, DW_AT_name("Tmp")
    3959                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3960                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    3961                      .dwattr $C$DW$165, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    3962                      .dwattr $C$DW$165, DW_AT_decl_line(0x32)
    3963                      .dwattr $C$DW$165, DW_AT_decl_column(0x0c)
    3964              
    3965                      .dwattr $C$DW$T$22, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    3966                      .dwattr $C$DW$T$22, DW_AT_decl_line(0x2a)
    3967                      .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    3968                      .dwendtag $C$DW$T$22
    3969              
    3970                      .dwendtag $C$DW$TU$22
    3971              
    3972              
    3973              $C$DW$TU$134    .dwtag  DW_TAG_type_unit
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE   89

    3974                      .dwmtype  $C$DW$T$134
    3975              $C$DW$T$134     .dwtag  DW_TAG_typedef
    3976                      .dwattr $C$DW$T$134, DW_AT_name("RMPCNTL")
    3977                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$22)
    3978                      .dwattr $C$DW$T$134, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/uti
    3979                      .dwattr $C$DW$T$134, DW_AT_decl_line(0x33)
    3980                      .dwattr $C$DW$T$134, DW_AT_decl_column(0x03)
    3981              
    3982                      .dwendtag $C$DW$TU$134
    3983              
    3984              
    3985              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
    3986                      .dwmtype  $C$DW$T$23
    3987              
    3988              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3989                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
    3990              $C$DW$166       .dwtag  DW_TAG_member
    3991                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    3992                      .dwattr $C$DW$166, DW_AT_name("As")
    3993                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3994                      .dwattr $C$DW$166, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    3995                      .dwattr $C$DW$166, DW_AT_decl_line(0x2a)
    3996                      .dwattr $C$DW$166, DW_AT_decl_column(0x1e)
    3997              
    3998              $C$DW$167       .dwtag  DW_TAG_member
    3999                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    4000                      .dwattr $C$DW$167, DW_AT_name("Bs")
    4001                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4002                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    4003                      .dwattr $C$DW$167, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4004                      .dwattr $C$DW$167, DW_AT_decl_line(0x2b)
    4005                      .dwattr $C$DW$167, DW_AT_decl_column(0x12)
    4006              
    4007              $C$DW$168       .dwtag  DW_TAG_member
    4008                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    4009                      .dwattr $C$DW$168, DW_AT_name("Cs")
    4010                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4011                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    4012                      .dwattr $C$DW$168, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4013                      .dwattr $C$DW$168, DW_AT_decl_line(0x2c)
    4014                      .dwattr $C$DW$168, DW_AT_decl_column(0x12)
    4015              
    4016              $C$DW$169       .dwtag  DW_TAG_member
    4017                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    4018                      .dwattr $C$DW$169, DW_AT_name("Alpha")
    4019                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4020                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    4021                      .dwattr $C$DW$169, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4022                      .dwattr $C$DW$169, DW_AT_decl_line(0x2d)
    4023                      .dwattr $C$DW$169, DW_AT_decl_column(0x12)
    4024              
    4025              $C$DW$170       .dwtag  DW_TAG_member
    4026                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    4027                      .dwattr $C$DW$170, DW_AT_name("Beta")
    4028                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE   90

    4029                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    4030                      .dwattr $C$DW$170, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4031                      .dwattr $C$DW$170, DW_AT_decl_line(0x2e)
    4032                      .dwattr $C$DW$170, DW_AT_decl_column(0x12)
    4033              
    4034                      .dwattr $C$DW$T$23, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4035                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x2a)
    4036                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
    4037                      .dwendtag $C$DW$T$23
    4038              
    4039                      .dwendtag $C$DW$TU$23
    4040              
    4041              
    4042              $C$DW$TU$135    .dwtag  DW_TAG_type_unit
    4043                      .dwmtype  $C$DW$T$135
    4044              $C$DW$T$135     .dwtag  DW_TAG_typedef
    4045                      .dwattr $C$DW$T$135, DW_AT_name("CLARKE")
    4046                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$23)
    4047                      .dwattr $C$DW$T$135, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/uti
    4048                      .dwattr $C$DW$T$135, DW_AT_decl_line(0x2f)
    4049                      .dwattr $C$DW$T$135, DW_AT_decl_column(0x09)
    4050              
    4051                      .dwendtag $C$DW$TU$135
    4052              
    4053              
    4054              $C$DW$TU$24     .dwtag  DW_TAG_type_unit
    4055                      .dwmtype  $C$DW$T$24
    4056              
    4057              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    4058                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0e)
    4059              $C$DW$171       .dwtag  DW_TAG_member
    4060                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    4061                      .dwattr $C$DW$171, DW_AT_name("Alpha")
    4062                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    4063                      .dwattr $C$DW$171, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4064                      .dwattr $C$DW$171, DW_AT_decl_line(0x29)
    4065                      .dwattr $C$DW$171, DW_AT_decl_column(0x1e)
    4066              
    4067              $C$DW$172       .dwtag  DW_TAG_member
    4068                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    4069                      .dwattr $C$DW$172, DW_AT_name("Beta")
    4070                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4071                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    4072                      .dwattr $C$DW$172, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4073                      .dwattr $C$DW$172, DW_AT_decl_line(0x2a)
    4074                      .dwattr $C$DW$172, DW_AT_decl_column(0x12)
    4075              
    4076              $C$DW$173       .dwtag  DW_TAG_member
    4077                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    4078                      .dwattr $C$DW$173, DW_AT_name("Angle")
    4079                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4080                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    4081                      .dwattr $C$DW$173, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4082                      .dwattr $C$DW$173, DW_AT_decl_line(0x2b)
    4083                      .dwattr $C$DW$173, DW_AT_decl_column(0x12)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE   91

    4084              
    4085              $C$DW$174       .dwtag  DW_TAG_member
    4086                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    4087                      .dwattr $C$DW$174, DW_AT_name("Ds")
    4088                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4089                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    4090                      .dwattr $C$DW$174, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4091                      .dwattr $C$DW$174, DW_AT_decl_line(0x2c)
    4092                      .dwattr $C$DW$174, DW_AT_decl_column(0x12)
    4093              
    4094              $C$DW$175       .dwtag  DW_TAG_member
    4095                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    4096                      .dwattr $C$DW$175, DW_AT_name("Qs")
    4097                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4098                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    4099                      .dwattr $C$DW$175, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4100                      .dwattr $C$DW$175, DW_AT_decl_line(0x2d)
    4101                      .dwattr $C$DW$175, DW_AT_decl_column(0x12)
    4102              
    4103              $C$DW$176       .dwtag  DW_TAG_member
    4104                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    4105                      .dwattr $C$DW$176, DW_AT_name("Sine")
    4106                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4107                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    4108                      .dwattr $C$DW$176, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4109                      .dwattr $C$DW$176, DW_AT_decl_line(0x2e)
    4110                      .dwattr $C$DW$176, DW_AT_decl_column(0x12)
    4111              
    4112              $C$DW$177       .dwtag  DW_TAG_member
    4113                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    4114                      .dwattr $C$DW$177, DW_AT_name("Cosine")
    4115                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4116                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    4117                      .dwattr $C$DW$177, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4118                      .dwattr $C$DW$177, DW_AT_decl_line(0x2f)
    4119                      .dwattr $C$DW$177, DW_AT_decl_column(0x12)
    4120              
    4121                      .dwattr $C$DW$T$24, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4122                      .dwattr $C$DW$T$24, DW_AT_decl_line(0x29)
    4123                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    4124                      .dwendtag $C$DW$T$24
    4125              
    4126                      .dwendtag $C$DW$TU$24
    4127              
    4128              
    4129              $C$DW$TU$136    .dwtag  DW_TAG_type_unit
    4130                      .dwmtype  $C$DW$T$136
    4131              $C$DW$T$136     .dwtag  DW_TAG_typedef
    4132                      .dwattr $C$DW$T$136, DW_AT_name("PARK")
    4133                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$24)
    4134                      .dwattr $C$DW$T$136, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/uti
    4135                      .dwattr $C$DW$T$136, DW_AT_decl_line(0x30)
    4136                      .dwattr $C$DW$T$136, DW_AT_decl_column(0x09)
    4137              
    4138                      .dwendtag $C$DW$TU$136
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE   92

    4139              
    4140              
    4141              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    4142                      .dwmtype  $C$DW$T$25
    4143              
    4144              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4145                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
    4146              $C$DW$178       .dwtag  DW_TAG_member
    4147                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    4148                      .dwattr $C$DW$178, DW_AT_name("Alpha")
    4149                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    4150                      .dwattr $C$DW$178, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4151                      .dwattr $C$DW$178, DW_AT_decl_line(0x29)
    4152                      .dwattr $C$DW$178, DW_AT_decl_column(0x1e)
    4153              
    4154              $C$DW$179       .dwtag  DW_TAG_member
    4155                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    4156                      .dwattr $C$DW$179, DW_AT_name("Beta")
    4157                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4158                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    4159                      .dwattr $C$DW$179, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4160                      .dwattr $C$DW$179, DW_AT_decl_line(0x2a)
    4161                      .dwattr $C$DW$179, DW_AT_decl_column(0x12)
    4162              
    4163              $C$DW$180       .dwtag  DW_TAG_member
    4164                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    4165                      .dwattr $C$DW$180, DW_AT_name("Angle")
    4166                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4167                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    4168                      .dwattr $C$DW$180, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4169                      .dwattr $C$DW$180, DW_AT_decl_line(0x2b)
    4170                      .dwattr $C$DW$180, DW_AT_decl_column(0x12)
    4171              
    4172              $C$DW$181       .dwtag  DW_TAG_member
    4173                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    4174                      .dwattr $C$DW$181, DW_AT_name("Ds")
    4175                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4176                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    4177                      .dwattr $C$DW$181, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4178                      .dwattr $C$DW$181, DW_AT_decl_line(0x2c)
    4179                      .dwattr $C$DW$181, DW_AT_decl_column(0x12)
    4180              
    4181              $C$DW$182       .dwtag  DW_TAG_member
    4182                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    4183                      .dwattr $C$DW$182, DW_AT_name("Qs")
    4184                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4185                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    4186                      .dwattr $C$DW$182, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4187                      .dwattr $C$DW$182, DW_AT_decl_line(0x2d)
    4188                      .dwattr $C$DW$182, DW_AT_decl_column(0x12)
    4189              
    4190              $C$DW$183       .dwtag  DW_TAG_member
    4191                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    4192                      .dwattr $C$DW$183, DW_AT_name("Sine")
    4193                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE   93

    4194                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    4195                      .dwattr $C$DW$183, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4196                      .dwattr $C$DW$183, DW_AT_decl_line(0x2e)
    4197                      .dwattr $C$DW$183, DW_AT_decl_column(0x12)
    4198              
    4199              $C$DW$184       .dwtag  DW_TAG_member
    4200                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    4201                      .dwattr $C$DW$184, DW_AT_name("Cosine")
    4202                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4203                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    4204                      .dwattr $C$DW$184, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4205                      .dwattr $C$DW$184, DW_AT_decl_line(0x2f)
    4206                      .dwattr $C$DW$184, DW_AT_decl_column(0x12)
    4207              
    4208                      .dwattr $C$DW$T$25, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4209                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x29)
    4210                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    4211                      .dwendtag $C$DW$T$25
    4212              
    4213                      .dwendtag $C$DW$TU$25
    4214              
    4215              
    4216              $C$DW$TU$137    .dwtag  DW_TAG_type_unit
    4217                      .dwmtype  $C$DW$T$137
    4218              $C$DW$T$137     .dwtag  DW_TAG_typedef
    4219                      .dwattr $C$DW$T$137, DW_AT_name("IPARK")
    4220                      .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$25)
    4221                      .dwattr $C$DW$T$137, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/uti
    4222                      .dwattr $C$DW$T$137, DW_AT_decl_line(0x30)
    4223                      .dwattr $C$DW$T$137, DW_AT_decl_column(0x0b)
    4224              
    4225                      .dwendtag $C$DW$TU$137
    4226              
    4227              
    4228              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    4229                      .dwmtype  $C$DW$T$28
    4230              
    4231              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4232                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x14)
    4233              $C$DW$185       .dwtag  DW_TAG_member
    4234                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    4235                      .dwattr $C$DW$185, DW_AT_name("ElecTheta")
    4236                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    4237                      .dwattr $C$DW$185, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4238                      .dwattr $C$DW$185, DW_AT_decl_line(0x2b)
    4239                      .dwattr $C$DW$185, DW_AT_decl_column(0x12)
    4240              
    4241              $C$DW$186       .dwtag  DW_TAG_member
    4242                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$21)
    4243                      .dwattr $C$DW$186, DW_AT_name("DirectionQep")
    4244                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4245                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    4246                      .dwattr $C$DW$186, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4247                      .dwattr $C$DW$186, DW_AT_decl_line(0x2c)
    4248                      .dwattr $C$DW$186, DW_AT_decl_column(0x11)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE   94

    4249              
    4250              $C$DW$187       .dwtag  DW_TAG_member
    4251                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    4252                      .dwattr $C$DW$187, DW_AT_name("OldElecTheta")
    4253                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4254                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    4255                      .dwattr $C$DW$187, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4256                      .dwattr $C$DW$187, DW_AT_decl_line(0x2d)
    4257                      .dwattr $C$DW$187, DW_AT_decl_column(0x12)
    4258              
    4259              $C$DW$188       .dwtag  DW_TAG_member
    4260                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    4261                      .dwattr $C$DW$188, DW_AT_name("Speed")
    4262                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4263                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    4264                      .dwattr $C$DW$188, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4265                      .dwattr $C$DW$188, DW_AT_decl_line(0x2e)
    4266                      .dwattr $C$DW$188, DW_AT_decl_column(0x12)
    4267              
    4268              $C$DW$189       .dwtag  DW_TAG_member
    4269                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$21)
    4270                      .dwattr $C$DW$189, DW_AT_name("BaseRpm")
    4271                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4272                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    4273                      .dwattr $C$DW$189, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4274                      .dwattr $C$DW$189, DW_AT_decl_line(0x2f)
    4275                      .dwattr $C$DW$189, DW_AT_decl_column(0x11)
    4276              
    4277              $C$DW$190       .dwtag  DW_TAG_member
    4278                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    4279                      .dwattr $C$DW$190, DW_AT_name("K1")
    4280                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4281                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    4282                      .dwattr $C$DW$190, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4283                      .dwattr $C$DW$190, DW_AT_decl_line(0x30)
    4284                      .dwattr $C$DW$190, DW_AT_decl_column(0x12)
    4285              
    4286              $C$DW$191       .dwtag  DW_TAG_member
    4287                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    4288                      .dwattr $C$DW$191, DW_AT_name("K2")
    4289                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4290                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    4291                      .dwattr $C$DW$191, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4292                      .dwattr $C$DW$191, DW_AT_decl_line(0x31)
    4293                      .dwattr $C$DW$191, DW_AT_decl_column(0x12)
    4294              
    4295              $C$DW$192       .dwtag  DW_TAG_member
    4296                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    4297                      .dwattr $C$DW$192, DW_AT_name("K3")
    4298                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4299                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    4300                      .dwattr $C$DW$192, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4301                      .dwattr $C$DW$192, DW_AT_decl_line(0x32)
    4302                      .dwattr $C$DW$192, DW_AT_decl_column(0x12)
    4303              
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE   95

    4304              $C$DW$193       .dwtag  DW_TAG_member
    4305                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$27)
    4306                      .dwattr $C$DW$193, DW_AT_name("SpeedRpm")
    4307                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4308                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    4309                      .dwattr $C$DW$193, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4310                      .dwattr $C$DW$193, DW_AT_decl_line(0x33)
    4311                      .dwattr $C$DW$193, DW_AT_decl_column(0x10)
    4312              
    4313              $C$DW$194       .dwtag  DW_TAG_member
    4314                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    4315                      .dwattr $C$DW$194, DW_AT_name("Tmp")
    4316                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4317                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    4318                      .dwattr $C$DW$194, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4319                      .dwattr $C$DW$194, DW_AT_decl_line(0x34)
    4320                      .dwattr $C$DW$194, DW_AT_decl_column(0x12)
    4321              
    4322                      .dwattr $C$DW$T$28, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4323                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x2a)
    4324                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    4325                      .dwendtag $C$DW$T$28
    4326              
    4327                      .dwendtag $C$DW$TU$28
    4328              
    4329              
    4330              $C$DW$TU$138    .dwtag  DW_TAG_type_unit
    4331                      .dwmtype  $C$DW$T$138
    4332              $C$DW$T$138     .dwtag  DW_TAG_typedef
    4333                      .dwattr $C$DW$T$138, DW_AT_name("SPEED_MEAS_QEP")
    4334                      .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$28)
    4335                      .dwattr $C$DW$T$138, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/uti
    4336                      .dwattr $C$DW$T$138, DW_AT_decl_line(0x35)
    4337                      .dwattr $C$DW$T$138, DW_AT_decl_column(0x0a)
    4338              
    4339                      .dwendtag $C$DW$TU$138
    4340              
    4341              
    4342              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    4343                      .dwmtype  $C$DW$T$29
    4344              
    4345              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4346                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x16)
    4347              $C$DW$195       .dwtag  DW_TAG_member
    4348                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    4349                      .dwattr $C$DW$195, DW_AT_name("ref")
    4350                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    4351                      .dwattr $C$DW$195, DW_AT_decl_file("D:\TI\c2000\C2000Ware_MotorControl_SDK_5_04_00_00\libraries\fcl\i
    4352                      .dwattr $C$DW$195, DW_AT_decl_line(0x18)
    4353                      .dwattr $C$DW$195, DW_AT_decl_column(0x10)
    4354              
    4355              $C$DW$196       .dwtag  DW_TAG_member
    4356                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    4357                      .dwattr $C$DW$196, DW_AT_name("fbk")
    4358                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE   96

    4359                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    4360                      .dwattr $C$DW$196, DW_AT_decl_file("D:\TI\c2000\C2000Ware_MotorControl_SDK_5_04_00_00\libraries\fcl\i
    4361                      .dwattr $C$DW$196, DW_AT_decl_line(0x19)
    4362                      .dwattr $C$DW$196, DW_AT_decl_column(0x10)
    4363              
    4364              $C$DW$197       .dwtag  DW_TAG_member
    4365                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    4366                      .dwattr $C$DW$197, DW_AT_name("err")
    4367                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4368                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    4369                      .dwattr $C$DW$197, DW_AT_decl_file("D:\TI\c2000\C2000Ware_MotorControl_SDK_5_04_00_00\libraries\fcl\i
    4370                      .dwattr $C$DW$197, DW_AT_decl_line(0x1a)
    4371                      .dwattr $C$DW$197, DW_AT_decl_column(0x10)
    4372              
    4373              $C$DW$198       .dwtag  DW_TAG_member
    4374                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    4375                      .dwattr $C$DW$198, DW_AT_name("out")
    4376                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4377                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    4378                      .dwattr $C$DW$198, DW_AT_decl_file("D:\TI\c2000\C2000Ware_MotorControl_SDK_5_04_00_00\libraries\fcl\i
    4379                      .dwattr $C$DW$198, DW_AT_decl_line(0x1b)
    4380                      .dwattr $C$DW$198, DW_AT_decl_column(0x10)
    4381              
    4382              $C$DW$199       .dwtag  DW_TAG_member
    4383                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    4384                      .dwattr $C$DW$199, DW_AT_name("carryOver")
    4385                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4386                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    4387                      .dwattr $C$DW$199, DW_AT_decl_file("D:\TI\c2000\C2000Ware_MotorControl_SDK_5_04_00_00\libraries\fcl\i
    4388                      .dwattr $C$DW$199, DW_AT_decl_line(0x1c)
    4389                      .dwattr $C$DW$199, DW_AT_decl_column(0x10)
    4390              
    4391              $C$DW$200       .dwtag  DW_TAG_member
    4392                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    4393                      .dwattr $C$DW$200, DW_AT_name("Kp")
    4394                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4395                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    4396                      .dwattr $C$DW$200, DW_AT_decl_file("D:\TI\c2000\C2000Ware_MotorControl_SDK_5_04_00_00\libraries\fcl\i
    4397                      .dwattr $C$DW$200, DW_AT_decl_line(0x1d)
    4398                      .dwattr $C$DW$200, DW_AT_decl_column(0x10)
    4399              
    4400              $C$DW$201       .dwtag  DW_TAG_member
    4401                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    4402                      .dwattr $C$DW$201, DW_AT_name("Ki")
    4403                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4404                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    4405                      .dwattr $C$DW$201, DW_AT_decl_file("D:\TI\c2000\C2000Ware_MotorControl_SDK_5_04_00_00\libraries\fcl\i
    4406                      .dwattr $C$DW$201, DW_AT_decl_line(0x1e)
    4407                      .dwattr $C$DW$201, DW_AT_decl_column(0x10)
    4408              
    4409              $C$DW$202       .dwtag  DW_TAG_member
    4410                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    4411                      .dwattr $C$DW$202, DW_AT_name("Kerr")
    4412                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4413                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE   97

    4414                      .dwattr $C$DW$202, DW_AT_decl_file("D:\TI\c2000\C2000Ware_MotorControl_SDK_5_04_00_00\libraries\fcl\i
    4415                      .dwattr $C$DW$202, DW_AT_decl_line(0x1f)
    4416                      .dwattr $C$DW$202, DW_AT_decl_column(0x10)
    4417              
    4418              $C$DW$203       .dwtag  DW_TAG_member
    4419                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    4420                      .dwattr $C$DW$203, DW_AT_name("KerrOld")
    4421                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4422                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    4423                      .dwattr $C$DW$203, DW_AT_decl_file("D:\TI\c2000\C2000Ware_MotorControl_SDK_5_04_00_00\libraries\fcl\i
    4424                      .dwattr $C$DW$203, DW_AT_decl_line(0x20)
    4425                      .dwattr $C$DW$203, DW_AT_decl_column(0x10)
    4426              
    4427              $C$DW$204       .dwtag  DW_TAG_member
    4428                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    4429                      .dwattr $C$DW$204, DW_AT_name("Umax")
    4430                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4431                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    4432                      .dwattr $C$DW$204, DW_AT_decl_file("D:\TI\c2000\C2000Ware_MotorControl_SDK_5_04_00_00\libraries\fcl\i
    4433                      .dwattr $C$DW$204, DW_AT_decl_line(0x21)
    4434                      .dwattr $C$DW$204, DW_AT_decl_column(0x10)
    4435              
    4436              $C$DW$205       .dwtag  DW_TAG_member
    4437                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    4438                      .dwattr $C$DW$205, DW_AT_name("Umin")
    4439                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4440                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    4441                      .dwattr $C$DW$205, DW_AT_decl_file("D:\TI\c2000\C2000Ware_MotorControl_SDK_5_04_00_00\libraries\fcl\i
    4442                      .dwattr $C$DW$205, DW_AT_decl_line(0x22)
    4443                      .dwattr $C$DW$205, DW_AT_decl_column(0x10)
    4444              
    4445                      .dwattr $C$DW$T$29, DW_AT_decl_file("D:\TI\c2000\C2000Ware_MotorControl_SDK_5_04_00_00\libraries\fcl\
    4446                      .dwattr $C$DW$T$29, DW_AT_decl_line(0x17)
    4447                      .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    4448                      .dwendtag $C$DW$T$29
    4449              
    4450                      .dwendtag $C$DW$TU$29
    4451              
    4452              
    4453              $C$DW$TU$124    .dwtag  DW_TAG_type_unit
    4454                      .dwmtype  $C$DW$T$124
    4455              $C$DW$T$124     .dwtag  DW_TAG_typedef
    4456                      .dwattr $C$DW$T$124, DW_AT_name("FCL_PIController_t")
    4457                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$29)
    4458                      .dwattr $C$DW$T$124, DW_AT_decl_file("D:\TI\c2000\C2000Ware_MotorControl_SDK_5_04_00_00\libraries\fcl
    4459                      .dwattr $C$DW$T$124, DW_AT_decl_line(0x23)
    4460                      .dwattr $C$DW$T$124, DW_AT_decl_column(0x03)
    4461              
    4462                      .dwendtag $C$DW$TU$124
    4463              
    4464              
    4465              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    4466                      .dwmtype  $C$DW$T$30
    4467              
    4468              $C$DW$T$30      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE   98

    4469                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x18)
    4470              $C$DW$206       .dwtag  DW_TAG_member
    4471                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    4472                      .dwattr $C$DW$206, DW_AT_name("Ref")
    4473                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    4474                      .dwattr $C$DW$206, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4475                      .dwattr $C$DW$206, DW_AT_decl_line(0x2a)
    4476                      .dwattr $C$DW$206, DW_AT_decl_column(0x1e)
    4477              
    4478              $C$DW$207       .dwtag  DW_TAG_member
    4479                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    4480                      .dwattr $C$DW$207, DW_AT_name("Fbk")
    4481                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4482                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    4483                      .dwattr $C$DW$207, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4484                      .dwattr $C$DW$207, DW_AT_decl_line(0x2b)
    4485                      .dwattr $C$DW$207, DW_AT_decl_column(0x12)
    4486              
    4487              $C$DW$208       .dwtag  DW_TAG_member
    4488                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    4489                      .dwattr $C$DW$208, DW_AT_name("Out")
    4490                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4491                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    4492                      .dwattr $C$DW$208, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4493                      .dwattr $C$DW$208, DW_AT_decl_line(0x2c)
    4494                      .dwattr $C$DW$208, DW_AT_decl_column(0x12)
    4495              
    4496              $C$DW$209       .dwtag  DW_TAG_member
    4497                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    4498                      .dwattr $C$DW$209, DW_AT_name("Kp")
    4499                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4500                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    4501                      .dwattr $C$DW$209, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4502                      .dwattr $C$DW$209, DW_AT_decl_line(0x2d)
    4503                      .dwattr $C$DW$209, DW_AT_decl_column(0x12)
    4504              
    4505              $C$DW$210       .dwtag  DW_TAG_member
    4506                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    4507                      .dwattr $C$DW$210, DW_AT_name("Ki")
    4508                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4509                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    4510                      .dwattr $C$DW$210, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4511                      .dwattr $C$DW$210, DW_AT_decl_line(0x2e)
    4512                      .dwattr $C$DW$210, DW_AT_decl_column(0x12)
    4513              
    4514              $C$DW$211       .dwtag  DW_TAG_member
    4515                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    4516                      .dwattr $C$DW$211, DW_AT_name("Umax")
    4517                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4518                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    4519                      .dwattr $C$DW$211, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4520                      .dwattr $C$DW$211, DW_AT_decl_line(0x2f)
    4521                      .dwattr $C$DW$211, DW_AT_decl_column(0x12)
    4522              
    4523              $C$DW$212       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE   99

    4524                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    4525                      .dwattr $C$DW$212, DW_AT_name("Umin")
    4526                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4527                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    4528                      .dwattr $C$DW$212, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4529                      .dwattr $C$DW$212, DW_AT_decl_line(0x30)
    4530                      .dwattr $C$DW$212, DW_AT_decl_column(0x12)
    4531              
    4532              $C$DW$213       .dwtag  DW_TAG_member
    4533                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    4534                      .dwattr $C$DW$213, DW_AT_name("up")
    4535                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4536                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    4537                      .dwattr $C$DW$213, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4538                      .dwattr $C$DW$213, DW_AT_decl_line(0x31)
    4539                      .dwattr $C$DW$213, DW_AT_decl_column(0x12)
    4540              
    4541              $C$DW$214       .dwtag  DW_TAG_member
    4542                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    4543                      .dwattr $C$DW$214, DW_AT_name("ui")
    4544                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4545                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    4546                      .dwattr $C$DW$214, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4547                      .dwattr $C$DW$214, DW_AT_decl_line(0x32)
    4548                      .dwattr $C$DW$214, DW_AT_decl_column(0x12)
    4549              
    4550              $C$DW$215       .dwtag  DW_TAG_member
    4551                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    4552                      .dwattr $C$DW$215, DW_AT_name("v1")
    4553                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4554                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    4555                      .dwattr $C$DW$215, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4556                      .dwattr $C$DW$215, DW_AT_decl_line(0x33)
    4557                      .dwattr $C$DW$215, DW_AT_decl_column(0x12)
    4558              
    4559              $C$DW$216       .dwtag  DW_TAG_member
    4560                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    4561                      .dwattr $C$DW$216, DW_AT_name("i1")
    4562                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4563                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    4564                      .dwattr $C$DW$216, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4565                      .dwattr $C$DW$216, DW_AT_decl_line(0x34)
    4566                      .dwattr $C$DW$216, DW_AT_decl_column(0x12)
    4567              
    4568              $C$DW$217       .dwtag  DW_TAG_member
    4569                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    4570                      .dwattr $C$DW$217, DW_AT_name("w1")
    4571                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4572                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    4573                      .dwattr $C$DW$217, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4574                      .dwattr $C$DW$217, DW_AT_decl_line(0x35)
    4575                      .dwattr $C$DW$217, DW_AT_decl_column(0x12)
    4576              
    4577                      .dwattr $C$DW$T$30, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4578                      .dwattr $C$DW$T$30, DW_AT_decl_line(0x2a)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE  100

    4579                      .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    4580                      .dwendtag $C$DW$T$30
    4581              
    4582                      .dwendtag $C$DW$TU$30
    4583              
    4584              
    4585              $C$DW$TU$139    .dwtag  DW_TAG_type_unit
    4586                      .dwmtype  $C$DW$T$139
    4587              $C$DW$T$139     .dwtag  DW_TAG_typedef
    4588                      .dwattr $C$DW$T$139, DW_AT_name("PI_CONTROLLER")
    4589                      .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$30)
    4590                      .dwattr $C$DW$T$139, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/uti
    4591                      .dwattr $C$DW$T$139, DW_AT_decl_line(0x36)
    4592                      .dwattr $C$DW$T$139, DW_AT_decl_column(0x07)
    4593              
    4594                      .dwendtag $C$DW$TU$139
    4595              
    4596              
    4597              $C$DW$TU$31     .dwtag  DW_TAG_type_unit
    4598                      .dwmtype  $C$DW$T$31
    4599              
    4600              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4601                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x0a)
    4602              $C$DW$218       .dwtag  DW_TAG_member
    4603                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    4604                      .dwattr $C$DW$218, DW_AT_name("Ref")
    4605                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    4606                      .dwattr $C$DW$218, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4607                      .dwattr $C$DW$218, DW_AT_decl_line(0x2a)
    4608                      .dwattr $C$DW$218, DW_AT_decl_column(0x1e)
    4609              
    4610              $C$DW$219       .dwtag  DW_TAG_member
    4611                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    4612                      .dwattr $C$DW$219, DW_AT_name("Fbk")
    4613                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4614                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    4615                      .dwattr $C$DW$219, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4616                      .dwattr $C$DW$219, DW_AT_decl_line(0x2b)
    4617                      .dwattr $C$DW$219, DW_AT_decl_column(0x12)
    4618              
    4619              $C$DW$220       .dwtag  DW_TAG_member
    4620                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    4621                      .dwattr $C$DW$220, DW_AT_name("Out")
    4622                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4623                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    4624                      .dwattr $C$DW$220, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4625                      .dwattr $C$DW$220, DW_AT_decl_line(0x2c)
    4626                      .dwattr $C$DW$220, DW_AT_decl_column(0x12)
    4627              
    4628              $C$DW$221       .dwtag  DW_TAG_member
    4629                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    4630                      .dwattr $C$DW$221, DW_AT_name("c1")
    4631                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4632                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    4633                      .dwattr $C$DW$221, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE  101

    4634                      .dwattr $C$DW$221, DW_AT_decl_line(0x2d)
    4635                      .dwattr $C$DW$221, DW_AT_decl_column(0x12)
    4636              
    4637              $C$DW$222       .dwtag  DW_TAG_member
    4638                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    4639                      .dwattr $C$DW$222, DW_AT_name("c2")
    4640                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4641                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    4642                      .dwattr $C$DW$222, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4643                      .dwattr $C$DW$222, DW_AT_decl_line(0x2e)
    4644                      .dwattr $C$DW$222, DW_AT_decl_column(0x12)
    4645              
    4646                      .dwattr $C$DW$T$31, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4647                      .dwattr $C$DW$T$31, DW_AT_decl_line(0x2a)
    4648                      .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    4649                      .dwendtag $C$DW$T$31
    4650              
    4651                      .dwendtag $C$DW$TU$31
    4652              
    4653              
    4654              $C$DW$TU$34     .dwtag  DW_TAG_type_unit
    4655                      .dwmtype  $C$DW$T$34
    4656              $C$DW$T$34      .dwtag  DW_TAG_typedef
    4657                      .dwattr $C$DW$T$34, DW_AT_name("PID_TERMINALS")
    4658                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$31)
    4659                      .dwattr $C$DW$T$34, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4660                      .dwattr $C$DW$T$34, DW_AT_decl_line(0x2f)
    4661                      .dwattr $C$DW$T$34, DW_AT_decl_column(0x07)
    4662              
    4663                      .dwendtag $C$DW$TU$34
    4664              
    4665              
    4666              $C$DW$TU$32     .dwtag  DW_TAG_type_unit
    4667                      .dwmtype  $C$DW$T$32
    4668              
    4669              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4670                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    4671              $C$DW$223       .dwtag  DW_TAG_member
    4672                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    4673                      .dwattr $C$DW$223, DW_AT_name("Kr")
    4674                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    4675                      .dwattr $C$DW$223, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4676                      .dwattr $C$DW$223, DW_AT_decl_line(0x32)
    4677                      .dwattr $C$DW$223, DW_AT_decl_column(0x1e)
    4678              
    4679              $C$DW$224       .dwtag  DW_TAG_member
    4680                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    4681                      .dwattr $C$DW$224, DW_AT_name("Kp")
    4682                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4683                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    4684                      .dwattr $C$DW$224, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4685                      .dwattr $C$DW$224, DW_AT_decl_line(0x33)
    4686                      .dwattr $C$DW$224, DW_AT_decl_column(0x12)
    4687              
    4688              $C$DW$225       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE  102

    4689                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    4690                      .dwattr $C$DW$225, DW_AT_name("Ki")
    4691                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4692                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    4693                      .dwattr $C$DW$225, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4694                      .dwattr $C$DW$225, DW_AT_decl_line(0x34)
    4695                      .dwattr $C$DW$225, DW_AT_decl_column(0x12)
    4696              
    4697              $C$DW$226       .dwtag  DW_TAG_member
    4698                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    4699                      .dwattr $C$DW$226, DW_AT_name("Kd")
    4700                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4701                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    4702                      .dwattr $C$DW$226, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4703                      .dwattr $C$DW$226, DW_AT_decl_line(0x35)
    4704                      .dwattr $C$DW$226, DW_AT_decl_column(0x12)
    4705              
    4706              $C$DW$227       .dwtag  DW_TAG_member
    4707                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    4708                      .dwattr $C$DW$227, DW_AT_name("Km")
    4709                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4710                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    4711                      .dwattr $C$DW$227, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4712                      .dwattr $C$DW$227, DW_AT_decl_line(0x36)
    4713                      .dwattr $C$DW$227, DW_AT_decl_column(0x12)
    4714              
    4715              $C$DW$228       .dwtag  DW_TAG_member
    4716                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    4717                      .dwattr $C$DW$228, DW_AT_name("Umax")
    4718                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4719                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    4720                      .dwattr $C$DW$228, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4721                      .dwattr $C$DW$228, DW_AT_decl_line(0x37)
    4722                      .dwattr $C$DW$228, DW_AT_decl_column(0x12)
    4723              
    4724              $C$DW$229       .dwtag  DW_TAG_member
    4725                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    4726                      .dwattr $C$DW$229, DW_AT_name("Umin")
    4727                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4728                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    4729                      .dwattr $C$DW$229, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4730                      .dwattr $C$DW$229, DW_AT_decl_line(0x38)
    4731                      .dwattr $C$DW$229, DW_AT_decl_column(0x12)
    4732              
    4733                      .dwattr $C$DW$T$32, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4734                      .dwattr $C$DW$T$32, DW_AT_decl_line(0x32)
    4735                      .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    4736                      .dwendtag $C$DW$T$32
    4737              
    4738                      .dwendtag $C$DW$TU$32
    4739              
    4740              
    4741              $C$DW$TU$35     .dwtag  DW_TAG_type_unit
    4742                      .dwmtype  $C$DW$T$35
    4743              $C$DW$T$35      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE  103

    4744                      .dwattr $C$DW$T$35, DW_AT_name("PID_PARAMETERS")
    4745                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$32)
    4746                      .dwattr $C$DW$T$35, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4747                      .dwattr $C$DW$T$35, DW_AT_decl_line(0x39)
    4748                      .dwattr $C$DW$T$35, DW_AT_decl_column(0x07)
    4749              
    4750                      .dwendtag $C$DW$TU$35
    4751              
    4752              
    4753              $C$DW$TU$33     .dwtag  DW_TAG_type_unit
    4754                      .dwmtype  $C$DW$T$33
    4755              
    4756              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4757                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x10)
    4758              $C$DW$230       .dwtag  DW_TAG_member
    4759                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    4760                      .dwattr $C$DW$230, DW_AT_name("up")
    4761                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    4762                      .dwattr $C$DW$230, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4763                      .dwattr $C$DW$230, DW_AT_decl_line(0x3b)
    4764                      .dwattr $C$DW$230, DW_AT_decl_column(0x1e)
    4765              
    4766              $C$DW$231       .dwtag  DW_TAG_member
    4767                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    4768                      .dwattr $C$DW$231, DW_AT_name("ui")
    4769                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4770                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    4771                      .dwattr $C$DW$231, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4772                      .dwattr $C$DW$231, DW_AT_decl_line(0x3c)
    4773                      .dwattr $C$DW$231, DW_AT_decl_column(0x12)
    4774              
    4775              $C$DW$232       .dwtag  DW_TAG_member
    4776                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    4777                      .dwattr $C$DW$232, DW_AT_name("ud")
    4778                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4779                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    4780                      .dwattr $C$DW$232, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4781                      .dwattr $C$DW$232, DW_AT_decl_line(0x3d)
    4782                      .dwattr $C$DW$232, DW_AT_decl_column(0x12)
    4783              
    4784              $C$DW$233       .dwtag  DW_TAG_member
    4785                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    4786                      .dwattr $C$DW$233, DW_AT_name("v1")
    4787                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4788                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    4789                      .dwattr $C$DW$233, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4790                      .dwattr $C$DW$233, DW_AT_decl_line(0x3e)
    4791                      .dwattr $C$DW$233, DW_AT_decl_column(0x12)
    4792              
    4793              $C$DW$234       .dwtag  DW_TAG_member
    4794                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    4795                      .dwattr $C$DW$234, DW_AT_name("i1")
    4796                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4797                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    4798                      .dwattr $C$DW$234, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE  104

    4799                      .dwattr $C$DW$234, DW_AT_decl_line(0x3f)
    4800                      .dwattr $C$DW$234, DW_AT_decl_column(0x12)
    4801              
    4802              $C$DW$235       .dwtag  DW_TAG_member
    4803                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    4804                      .dwattr $C$DW$235, DW_AT_name("d1")
    4805                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4806                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    4807                      .dwattr $C$DW$235, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4808                      .dwattr $C$DW$235, DW_AT_decl_line(0x40)
    4809                      .dwattr $C$DW$235, DW_AT_decl_column(0x12)
    4810              
    4811              $C$DW$236       .dwtag  DW_TAG_member
    4812                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    4813                      .dwattr $C$DW$236, DW_AT_name("d2")
    4814                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4815                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    4816                      .dwattr $C$DW$236, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4817                      .dwattr $C$DW$236, DW_AT_decl_line(0x41)
    4818                      .dwattr $C$DW$236, DW_AT_decl_column(0x12)
    4819              
    4820              $C$DW$237       .dwtag  DW_TAG_member
    4821                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    4822                      .dwattr $C$DW$237, DW_AT_name("w1")
    4823                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4824                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    4825                      .dwattr $C$DW$237, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4826                      .dwattr $C$DW$237, DW_AT_decl_line(0x42)
    4827                      .dwattr $C$DW$237, DW_AT_decl_column(0x12)
    4828              
    4829                      .dwattr $C$DW$T$33, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4830                      .dwattr $C$DW$T$33, DW_AT_decl_line(0x3b)
    4831                      .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    4832                      .dwendtag $C$DW$T$33
    4833              
    4834                      .dwendtag $C$DW$TU$33
    4835              
    4836              
    4837              $C$DW$TU$36     .dwtag  DW_TAG_type_unit
    4838                      .dwmtype  $C$DW$T$36
    4839              $C$DW$T$36      .dwtag  DW_TAG_typedef
    4840                      .dwattr $C$DW$T$36, DW_AT_name("PID_DATA")
    4841                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$33)
    4842                      .dwattr $C$DW$T$36, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4843                      .dwattr $C$DW$T$36, DW_AT_decl_line(0x43)
    4844                      .dwattr $C$DW$T$36, DW_AT_decl_column(0x07)
    4845              
    4846                      .dwendtag $C$DW$TU$36
    4847              
    4848              
    4849              $C$DW$TU$37     .dwtag  DW_TAG_type_unit
    4850                      .dwmtype  $C$DW$T$37
    4851              
    4852              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4853                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x28)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE  105

    4854              $C$DW$238       .dwtag  DW_TAG_member
    4855                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$34)
    4856                      .dwattr $C$DW$238, DW_AT_name("term")
    4857                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    4858                      .dwattr $C$DW$238, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4859                      .dwattr $C$DW$238, DW_AT_decl_line(0x46)
    4860                      .dwattr $C$DW$238, DW_AT_decl_column(0x21)
    4861              
    4862              $C$DW$239       .dwtag  DW_TAG_member
    4863                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$35)
    4864                      .dwattr $C$DW$239, DW_AT_name("param")
    4865                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4866                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    4867                      .dwattr $C$DW$239, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4868                      .dwattr $C$DW$239, DW_AT_decl_line(0x47)
    4869                      .dwattr $C$DW$239, DW_AT_decl_column(0x16)
    4870              
    4871              $C$DW$240       .dwtag  DW_TAG_member
    4872                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$36)
    4873                      .dwattr $C$DW$240, DW_AT_name("data")
    4874                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4875                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    4876                      .dwattr $C$DW$240, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4877                      .dwattr $C$DW$240, DW_AT_decl_line(0x48)
    4878                      .dwattr $C$DW$240, DW_AT_decl_column(0x11)
    4879              
    4880                      .dwattr $C$DW$T$37, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4881                      .dwattr $C$DW$T$37, DW_AT_decl_line(0x46)
    4882                      .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    4883                      .dwendtag $C$DW$T$37
    4884              
    4885                      .dwendtag $C$DW$TU$37
    4886              
    4887              
    4888              $C$DW$TU$140    .dwtag  DW_TAG_type_unit
    4889                      .dwmtype  $C$DW$T$140
    4890              $C$DW$T$140     .dwtag  DW_TAG_typedef
    4891                      .dwattr $C$DW$T$140, DW_AT_name("PID_CONTROLLER")
    4892                      .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$37)
    4893                      .dwattr $C$DW$T$140, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/uti
    4894                      .dwattr $C$DW$T$140, DW_AT_decl_line(0x49)
    4895                      .dwattr $C$DW$T$140, DW_AT_decl_column(0x07)
    4896              
    4897                      .dwendtag $C$DW$TU$140
    4898              
    4899              
    4900              $C$DW$TU$38     .dwtag  DW_TAG_type_unit
    4901                      .dwmtype  $C$DW$T$38
    4902              
    4903              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4904                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x0c)
    4905              $C$DW$241       .dwtag  DW_TAG_member
    4906                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    4907                      .dwattr $C$DW$241, DW_AT_name("Freq")
    4908                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE  106

    4909                      .dwattr $C$DW$241, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4910                      .dwattr $C$DW$241, DW_AT_decl_line(0x25)
    4911                      .dwattr $C$DW$241, DW_AT_decl_column(0x1d)
    4912              
    4913              $C$DW$242       .dwtag  DW_TAG_member
    4914                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    4915                      .dwattr $C$DW$242, DW_AT_name("StepAngleMax")
    4916                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4917                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    4918                      .dwattr $C$DW$242, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4919                      .dwattr $C$DW$242, DW_AT_decl_line(0x26)
    4920                      .dwattr $C$DW$242, DW_AT_decl_column(0x1d)
    4921              
    4922              $C$DW$243       .dwtag  DW_TAG_member
    4923                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    4924                      .dwattr $C$DW$243, DW_AT_name("Angle")
    4925                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4926                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    4927                      .dwattr $C$DW$243, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4928                      .dwattr $C$DW$243, DW_AT_decl_line(0x27)
    4929                      .dwattr $C$DW$243, DW_AT_decl_column(0x1d)
    4930              
    4931              $C$DW$244       .dwtag  DW_TAG_member
    4932                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    4933                      .dwattr $C$DW$244, DW_AT_name("Gain")
    4934                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4935                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    4936                      .dwattr $C$DW$244, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4937                      .dwattr $C$DW$244, DW_AT_decl_line(0x28)
    4938                      .dwattr $C$DW$244, DW_AT_decl_column(0x1d)
    4939              
    4940              $C$DW$245       .dwtag  DW_TAG_member
    4941                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    4942                      .dwattr $C$DW$245, DW_AT_name("Out")
    4943                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4944                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    4945                      .dwattr $C$DW$245, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4946                      .dwattr $C$DW$245, DW_AT_decl_line(0x29)
    4947                      .dwattr $C$DW$245, DW_AT_decl_column(0x1d)
    4948              
    4949              $C$DW$246       .dwtag  DW_TAG_member
    4950                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    4951                      .dwattr $C$DW$246, DW_AT_name("Offset")
    4952                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4953                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    4954                      .dwattr $C$DW$246, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    4955                      .dwattr $C$DW$246, DW_AT_decl_line(0x2a)
    4956                      .dwattr $C$DW$246, DW_AT_decl_column(0x1d)
    4957              
    4958                      .dwattr $C$DW$T$38, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/util
    4959                      .dwattr $C$DW$T$38, DW_AT_decl_line(0x25)
    4960                      .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    4961                      .dwendtag $C$DW$T$38
    4962              
    4963                      .dwendtag $C$DW$TU$38
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE  107

    4964              
    4965              
    4966              $C$DW$TU$123    .dwtag  DW_TAG_type_unit
    4967                      .dwmtype  $C$DW$T$123
    4968              $C$DW$T$123     .dwtag  DW_TAG_typedef
    4969                      .dwattr $C$DW$T$123, DW_AT_name("RAMP_GEN_CLA")
    4970                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$38)
    4971                      .dwattr $C$DW$T$123, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/uti
    4972                      .dwattr $C$DW$T$123, DW_AT_decl_line(0x2b)
    4973                      .dwattr $C$DW$T$123, DW_AT_decl_column(0x0d)
    4974              
    4975                      .dwendtag $C$DW$TU$123
    4976              
    4977              
    4978              $C$DW$TU$41     .dwtag  DW_TAG_type_unit
    4979                      .dwmtype  $C$DW$T$41
    4980              
    4981              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4982                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x12)
    4983              $C$DW$247       .dwtag  DW_TAG_member
    4984                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    4985                      .dwattr $C$DW$247, DW_AT_name("ElecTheta")
    4986                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    4987                      .dwattr $C$DW$247, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    4988                      .dwattr $C$DW$247, DW_AT_decl_line(0x1c)
    4989                      .dwattr $C$DW$247, DW_AT_decl_column(0x0f)
    4990              
    4991              $C$DW$248       .dwtag  DW_TAG_member
    4992                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    4993                      .dwattr $C$DW$248, DW_AT_name("MechTheta")
    4994                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4995                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    4996                      .dwattr $C$DW$248, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    4997                      .dwattr $C$DW$248, DW_AT_decl_line(0x1d)
    4998                      .dwattr $C$DW$248, DW_AT_decl_column(0x0f)
    4999              
    5000              $C$DW$249       .dwtag  DW_TAG_member
    5001                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$40)
    5002                      .dwattr $C$DW$249, DW_AT_name("DirectionQep")
    5003                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5004                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    5005                      .dwattr $C$DW$249, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    5006                      .dwattr $C$DW$249, DW_AT_decl_line(0x1e)
    5007                      .dwattr $C$DW$249, DW_AT_decl_column(0x0f)
    5008              
    5009              $C$DW$250       .dwtag  DW_TAG_member
    5010                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$40)
    5011                      .dwattr $C$DW$250, DW_AT_name("QepPeriod")
    5012                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5013                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    5014                      .dwattr $C$DW$250, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    5015                      .dwattr $C$DW$250, DW_AT_decl_line(0x1f)
    5016                      .dwattr $C$DW$250, DW_AT_decl_column(0x0f)
    5017              
    5018              $C$DW$251       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE  108

    5019                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$21)
    5020                      .dwattr $C$DW$251, DW_AT_name("QepCountIndex")
    5021                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5022                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    5023                      .dwattr $C$DW$251, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    5024                      .dwattr $C$DW$251, DW_AT_decl_line(0x21)
    5025                      .dwattr $C$DW$251, DW_AT_decl_column(0x0f)
    5026              
    5027              $C$DW$252       .dwtag  DW_TAG_member
    5028                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$27)
    5029                      .dwattr $C$DW$252, DW_AT_name("RawTheta")
    5030                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5031                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    5032                      .dwattr $C$DW$252, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    5033                      .dwattr $C$DW$252, DW_AT_decl_line(0x22)
    5034                      .dwattr $C$DW$252, DW_AT_decl_column(0x0f)
    5035              
    5036              $C$DW$253       .dwtag  DW_TAG_member
    5037                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    5038                      .dwattr $C$DW$253, DW_AT_name("MechScaler")
    5039                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5040                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    5041                      .dwattr $C$DW$253, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    5042                      .dwattr $C$DW$253, DW_AT_decl_line(0x23)
    5043                      .dwattr $C$DW$253, DW_AT_decl_column(0x0f)
    5044              
    5045              $C$DW$254       .dwtag  DW_TAG_member
    5046                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$40)
    5047                      .dwattr $C$DW$254, DW_AT_name("LineEncoder")
    5048                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5049                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    5050                      .dwattr $C$DW$254, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    5051                      .dwattr $C$DW$254, DW_AT_decl_line(0x24)
    5052                      .dwattr $C$DW$254, DW_AT_decl_column(0x0f)
    5053              
    5054              $C$DW$255       .dwtag  DW_TAG_member
    5055                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$40)
    5056                      .dwattr $C$DW$255, DW_AT_name("PolePairs")
    5057                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5058                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    5059                      .dwattr $C$DW$255, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    5060                      .dwattr $C$DW$255, DW_AT_decl_line(0x25)
    5061                      .dwattr $C$DW$255, DW_AT_decl_column(0x0f)
    5062              
    5063              $C$DW$256       .dwtag  DW_TAG_member
    5064                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$27)
    5065                      .dwattr $C$DW$256, DW_AT_name("CalibratedAngle")
    5066                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5067                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    5068                      .dwattr $C$DW$256, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    5069                      .dwattr $C$DW$256, DW_AT_decl_line(0x26)
    5070                      .dwattr $C$DW$256, DW_AT_decl_column(0x0f)
    5071              
    5072              $C$DW$257       .dwtag  DW_TAG_member
    5073                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$40)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE  109

    5074                      .dwattr $C$DW$257, DW_AT_name("IndexSyncFlag")
    5075                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5076                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    5077                      .dwattr $C$DW$257, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posit
    5078                      .dwattr $C$DW$257, DW_AT_decl_line(0x28)
    5079                      .dwattr $C$DW$257, DW_AT_decl_column(0x0f)
    5080              
    5081                      .dwattr $C$DW$T$41, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/posi
    5082                      .dwattr $C$DW$T$41, DW_AT_decl_line(0x1b)
    5083                      .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    5084                      .dwendtag $C$DW$T$41
    5085              
    5086                      .dwendtag $C$DW$TU$41
    5087              
    5088              
    5089              $C$DW$TU$125    .dwtag  DW_TAG_type_unit
    5090                      .dwmtype  $C$DW$T$125
    5091              $C$DW$T$125     .dwtag  DW_TAG_typedef
    5092                      .dwattr $C$DW$T$125, DW_AT_name("QEP")
    5093                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$41)
    5094                      .dwattr $C$DW$T$125, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/pos
    5095                      .dwattr $C$DW$T$125, DW_AT_decl_line(0x29)
    5096                      .dwattr $C$DW$T$125, DW_AT_decl_column(0x03)
    5097              
    5098                      .dwendtag $C$DW$TU$125
    5099              
    5100              
    5101              $C$DW$TU$42     .dwtag  DW_TAG_type_unit
    5102                      .dwmtype  $C$DW$T$42
    5103              
    5104              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    5105                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x12)
    5106              $C$DW$258       .dwtag  DW_TAG_member
    5107                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    5108                      .dwattr $C$DW$258, DW_AT_name("Ualpha")
    5109                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    5110                      .dwattr $C$DW$258, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5111                      .dwattr $C$DW$258, DW_AT_decl_line(0x2b)
    5112                      .dwattr $C$DW$258, DW_AT_decl_column(0x10)
    5113              
    5114              $C$DW$259       .dwtag  DW_TAG_member
    5115                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    5116                      .dwattr $C$DW$259, DW_AT_name("Ubeta")
    5117                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5118                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    5119                      .dwattr $C$DW$259, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5120                      .dwattr $C$DW$259, DW_AT_decl_line(0x2c)
    5121                      .dwattr $C$DW$259, DW_AT_decl_column(0x10)
    5122              
    5123              $C$DW$260       .dwtag  DW_TAG_member
    5124                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    5125                      .dwattr $C$DW$260, DW_AT_name("Ta")
    5126                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5127                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    5128                      .dwattr $C$DW$260, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:18 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
fcl_cpu_code_dm.asm                                                  PAGE  110

    5129                      .dwattr $C$DW$260, DW_AT_decl_line(0x2d)
    5130                      .dwattr $C$DW$260, DW_AT_decl_column(0x10)
    5131              
    5132              $C$DW$261       .dwtag  DW_TAG_member
    5133                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    5134                      .dwattr $C$DW$261, DW_AT_name("Tb")
    5135                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5136                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    5137                      .dwattr $C$DW$261, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/utili
    5138                      .dwattr $C$DW$261, DW_AT_decl_line(0x2e)
