TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:17 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui.asm                                                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.2.LTS *
       3              ;* Date/Time created: Sat Dec 27 15:00:17 2025                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla1 --diag_wrap=off --float_support=fpu32 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sources/sfra_gui.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.2.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\JUNLI\workspace_ccstheia\dual_axis_servo_drive_fcl_qep_f28
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("SFRA_F32_reset")
      16                      .dwattr $C$DW$1, DW_AT_linkage_name("SFRA_F32_reset")

    2660                      .gmember  ".text:__isnanf"
    2661                      .endgroup
    2662                      .group    "__isnanl", 1
    2663                      .gmember  ".text:__isnanl"
    2664                      .endgroup
    2665                      .group    "__isnormal", 1
    2666                      .gmember  ".text:__isnormal"
    2667                      .endgroup
    2668                      .group    "__isnormalf", 1
    2669                      .gmember  ".text:__isnormalf"
    2670                      .endgroup
    2671                      .group    "__isnormall", 1
    2672                      .gmember  ".text:__isnormall"
    2673                      .endgroup
    2674                      .group    "__relaxed_atan2f", 1
    2675                      .gmember  ".text:__relaxed_atan2f"
    2676                      .endgroup
    2677                      .group    "__relaxed_atanf", 1
    2678                      .gmember  ".text:__relaxed_atanf"
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:17 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui.asm                                                         PAGE   53

    2679                      .endgroup
    2680                      .group    "__relaxed_cosf", 1
    2681                      .gmember  ".text:__relaxed_cosf"
    2682                      .endgroup
    2683                      .group    "__relaxed_fmaxf", 1
    2684                      .gmember  ".text:__relaxed_fmaxf"
    2685                      .endgroup
    2686                      .group    "__relaxed_fminf", 1
    2687                      .gmember  ".text:__relaxed_fminf"
    2688                      .endgroup
    2689                      .group    "__relaxed_fmodf", 1
    2690                      .gmember  ".text:__relaxed_fmodf"
    2691                      .endgroup
    2692                      .group    "__relaxed_sinf", 1
    2693                      .gmember  ".text:__relaxed_sinf"
    2694                      .endgroup
    2695                      .group    "__relaxed_sqrtf", 1
    2696                      .gmember  ".text:__relaxed_sqrtf"
    2697                      .endgroup
    2698                      .group    "__signbit", 1
    2699                      .gmember  ".text:__signbit"
    2700                      .endgroup
    2701                      .group    "__signbitf", 1
    2702                      .gmember  ".text:__signbitf"
    2703                      .endgroup
    2704                      .group    "__signbitl", 1
    2705                      .gmember  ".text:__signbitl"
    2706                      .endgroup
    2707              
    2708              
    2709              ;***************************************************************
    2710              ;* BUILD ATTRIBUTES                                            *
    2711              ;***************************************************************
    2712                      .battr "c28xabi", Tag_File, 1, Tag_float_args(1)
    2713                      .battr "c28xabi", Tag_File, 1, Tag_double_args(1)
    2714                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    2715              
    2716              ;***************************************************************
    2717              ;* DWARF CIE ENTRIES                                           *
    2718              ;***************************************************************
    2719              
    2720              $C$DW$CIE       .dwcie 26
    2721                      .dwcfi  cfa_register, 20
    2722                      .dwcfi  cfa_offset, 0
    2723                      .dwcfi  same_value, 28
    2724                      .dwcfi  same_value, 6
    2725                      .dwcfi  same_value, 7
    2726                      .dwcfi  same_value, 8
    2727                      .dwcfi  same_value, 9
    2728                      .dwcfi  same_value, 10
    2729                      .dwcfi  same_value, 11
    2730                      .dwcfi  same_value, 59
    2731                      .dwcfi  same_value, 63
    2732                      .dwcfi  same_value, 67
    2733                      .dwcfi  same_value, 71
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:17 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui.asm                                                         PAGE   54

    2734                      .dwendentry
    2735                      .dwendtag $C$DW$CU
    2736              
    2737              
    2738              ;***************************************************************
    2739              ;* TYPE INFORMATION                                            *
    2740              ;***************************************************************
    2741              
    2742              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
    2743                      .dwmtype  $C$DW$T$23
    2744              
    2745              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2746                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x20)
    2747              $C$DW$186       .dwtag  DW_TAG_member
    2748                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$20)
    2749                      .dwattr $C$DW$186, DW_AT_name("h_magVect")
    2750                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2751                      .dwattr $C$DW$186, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/
    2752                      .dwattr $C$DW$186, DW_AT_decl_line(0x40)
    2753                      .dwattr $C$DW$186, DW_AT_decl_column(0x10)
    2754              
    2755              $C$DW$187       .dwtag  DW_TAG_member
    2756                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$20)
    2757                      .dwattr $C$DW$187, DW_AT_name("h_phaseVect")
    2758                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2759                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2760                      .dwattr $C$DW$187, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/
    2761                      .dwattr $C$DW$187, DW_AT_decl_line(0x41)
    2762                      .dwattr $C$DW$187, DW_AT_decl_column(0x10)
    2763              
    2764              $C$DW$188       .dwtag  DW_TAG_member
    2765                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$20)
    2766                      .dwattr $C$DW$188, DW_AT_name("gh_magVect")
    2767                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2768                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2769                      .dwattr $C$DW$188, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/
    2770                      .dwattr $C$DW$188, DW_AT_decl_line(0x42)
    2771                      .dwattr $C$DW$188, DW_AT_decl_column(0x10)
    2772              
    2773              $C$DW$189       .dwtag  DW_TAG_member
    2774                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$20)
    2775                      .dwattr $C$DW$189, DW_AT_name("gh_phaseVect")
    2776                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2777                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2778                      .dwattr $C$DW$189, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/
    2779                      .dwattr $C$DW$189, DW_AT_decl_line(0x43)
    2780                      .dwattr $C$DW$189, DW_AT_decl_column(0x10)
    2781              
    2782              $C$DW$190       .dwtag  DW_TAG_member
    2783                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
    2784                      .dwattr $C$DW$190, DW_AT_name("cl_magVect")
    2785                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2786                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2787                      .dwattr $C$DW$190, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/
    2788                      .dwattr $C$DW$190, DW_AT_decl_line(0x44)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:17 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui.asm                                                         PAGE   55

    2789                      .dwattr $C$DW$190, DW_AT_decl_column(0x10)
    2790              
    2791              $C$DW$191       .dwtag  DW_TAG_member
    2792                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$20)
    2793                      .dwattr $C$DW$191, DW_AT_name("cl_phaseVect")
    2794                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2795                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2796                      .dwattr $C$DW$191, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/
    2797                      .dwattr $C$DW$191, DW_AT_decl_line(0x45)
    2798                      .dwattr $C$DW$191, DW_AT_decl_column(0x10)
    2799              
    2800              $C$DW$192       .dwtag  DW_TAG_member
    2801                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$20)
    2802                      .dwattr $C$DW$192, DW_AT_name("freqVect")
    2803                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2804                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2805                      .dwattr $C$DW$192, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/
    2806                      .dwattr $C$DW$192, DW_AT_decl_line(0x46)
    2807                      .dwattr $C$DW$192, DW_AT_decl_column(0x10)
    2808              
    2809              $C$DW$193       .dwtag  DW_TAG_member
    2810                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2811                      .dwattr $C$DW$193, DW_AT_name("amplitude")
    2812                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2813                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2814                      .dwattr $C$DW$193, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/
    2815                      .dwattr $C$DW$193, DW_AT_decl_line(0x47)
    2816                      .dwattr $C$DW$193, DW_AT_decl_column(0x0f)
    2817              
    2818              $C$DW$194       .dwtag  DW_TAG_member
    2819                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2820                      .dwattr $C$DW$194, DW_AT_name("isrFreq")
    2821                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2822                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2823                      .dwattr $C$DW$194, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/
    2824                      .dwattr $C$DW$194, DW_AT_decl_line(0x48)
    2825                      .dwattr $C$DW$194, DW_AT_decl_column(0x0f)
    2826              
    2827              $C$DW$195       .dwtag  DW_TAG_member
    2828                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2829                      .dwattr $C$DW$195, DW_AT_name("freqStart")
    2830                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2831                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2832                      .dwattr $C$DW$195, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/
    2833                      .dwattr $C$DW$195, DW_AT_decl_line(0x49)
    2834                      .dwattr $C$DW$195, DW_AT_decl_column(0x0f)
    2835              
    2836              $C$DW$196       .dwtag  DW_TAG_member
    2837                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2838                      .dwattr $C$DW$196, DW_AT_name("freqStep")
    2839                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2840                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2841                      .dwattr $C$DW$196, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/
    2842                      .dwattr $C$DW$196, DW_AT_decl_line(0x4a)
    2843                      .dwattr $C$DW$196, DW_AT_decl_column(0x0f)
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:17 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui.asm                                                         PAGE   56

    2844              
    2845              $C$DW$197       .dwtag  DW_TAG_member
    2846                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$22)
    2847                      .dwattr $C$DW$197, DW_AT_name("start")
    2848                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2849                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2850                      .dwattr $C$DW$197, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/
    2851                      .dwattr $C$DW$197, DW_AT_decl_line(0x4b)
    2852                      .dwattr $C$DW$197, DW_AT_decl_column(0x0d)
    2853              
    2854              $C$DW$198       .dwtag  DW_TAG_member
    2855                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$22)
    2856                      .dwattr $C$DW$198, DW_AT_name("state")
    2857                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2858                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2859                      .dwattr $C$DW$198, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/
    2860                      .dwattr $C$DW$198, DW_AT_decl_line(0x4c)
    2861                      .dwattr $C$DW$198, DW_AT_decl_column(0x0d)
    2862              
    2863              $C$DW$199       .dwtag  DW_TAG_member
    2864                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$22)
    2865                      .dwattr $C$DW$199, DW_AT_name("status")
    2866                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2867                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2868                      .dwattr $C$DW$199, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/
    2869                      .dwattr $C$DW$199, DW_AT_decl_line(0x4d)
    2870                      .dwattr $C$DW$199, DW_AT_decl_column(0x0d)
    2871              
    2872              $C$DW$200       .dwtag  DW_TAG_member
    2873                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$22)
    2874                      .dwattr $C$DW$200, DW_AT_name("vecLength")
    2875                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2876                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2877                      .dwattr $C$DW$200, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/
    2878                      .dwattr $C$DW$200, DW_AT_decl_line(0x4e)
    2879                      .dwattr $C$DW$200, DW_AT_decl_column(0x0d)
    2880              
    2881              $C$DW$201       .dwtag  DW_TAG_member
    2882                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$22)
    2883                      .dwattr $C$DW$201, DW_AT_name("freqIndex")
    2884                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2885                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2886                      .dwattr $C$DW$201, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/
    2887                      .dwattr $C$DW$201, DW_AT_decl_line(0x4f)
    2888                      .dwattr $C$DW$201, DW_AT_decl_column(0x0d)
    2889              
    2890              $C$DW$202       .dwtag  DW_TAG_member
    2891                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$22)
    2892                      .dwattr $C$DW$202, DW_AT_name("storeH")
    2893                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2894                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2895                      .dwattr $C$DW$202, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/
    2896                      .dwattr $C$DW$202, DW_AT_decl_line(0x50)
    2897                      .dwattr $C$DW$202, DW_AT_decl_column(0x0d)
    2898              
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:17 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui.asm                                                         PAGE   57

    2899              $C$DW$203       .dwtag  DW_TAG_member
    2900                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$22)
    2901                      .dwattr $C$DW$203, DW_AT_name("storeGH")
    2902                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2903                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2904                      .dwattr $C$DW$203, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/
    2905                      .dwattr $C$DW$203, DW_AT_decl_line(0x51)
    2906                      .dwattr $C$DW$203, DW_AT_decl_column(0x0d)
    2907              
    2908              $C$DW$204       .dwtag  DW_TAG_member
    2909                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$22)
    2910                      .dwattr $C$DW$204, DW_AT_name("storeCL")
    2911                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2912                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2913                      .dwattr $C$DW$204, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/
    2914                      .dwattr $C$DW$204, DW_AT_decl_line(0x52)
    2915                      .dwattr $C$DW$204, DW_AT_decl_column(0x0d)
    2916              
    2917              $C$DW$205       .dwtag  DW_TAG_member
    2918                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$22)
    2919                      .dwattr $C$DW$205, DW_AT_name("speed")
    2920                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2921                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2922                      .dwattr $C$DW$205, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra/
    2923                      .dwattr $C$DW$205, DW_AT_decl_line(0x53)
    2924                      .dwattr $C$DW$205, DW_AT_decl_column(0x0d)
    2925              
    2926                      .dwattr $C$DW$T$23, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra
    2927                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x3f)
    2928                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x0f)
    2929                      .dwendtag $C$DW$T$23
    2930              
    2931                      .dwendtag $C$DW$TU$23
    2932              
    2933              
    2934              $C$DW$TU$24     .dwtag  DW_TAG_type_unit
    2935                      .dwmtype  $C$DW$T$24
    2936              $C$DW$T$24      .dwtag  DW_TAG_typedef
    2937                      .dwattr $C$DW$T$24, DW_AT_name("SFRA_F32")
    2938                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    2939                      .dwattr $C$DW$T$24, DW_AT_decl_file("D:/TI/c2000/C2000Ware_MotorControl_SDK_5_04_00_00/libraries/sfra
    2940                      .dwattr $C$DW$T$24, DW_AT_decl_line(0x54)
    2941                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x02)
    2942              
    2943                      .dwendtag $C$DW$TU$24
    2944              
    2945              
    2946              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    2947                      .dwmtype  $C$DW$T$25
    2948              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    2949                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    2950                      .dwattr $C$DW$T$25, DW_AT_address_class(0x20)
    2951              
    2952                      .dwendtag $C$DW$TU$25
    2953              
TMS320C2000 Assembler PC v22.6.2 Sat Dec 27 15:00:17 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui.asm                                                         PAGE   58

    2954              
    2955              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
    2956                      .dwmtype  $C$DW$T$2
    2957              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2958                      .dwattr $C$DW$T$2, DW_AT_name("void")
    2959              
    2960                      .dwendtag $C$DW$TU$2
    2961              
    2962              
    2963              $C$DW$TU$4      .dwtag  DW_TAG_type_unit
    2964                      .dwmtype  $C$DW$T$4
    2965              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2966                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2967                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2968                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2969              
    2970                      .dwendtag $C$DW$TU$4
    2971              
    2972              
    2973              $C$DW$TU$5      .dwtag  DW_TAG_type_unit
    2974                      .dwmtype  $C$DW$T$5
    2975              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2976                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2977                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2978                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2979              
    2980                      .dwendtag $C$DW$TU$5
    2981              
    2982              
    2983              $C$DW$TU$6      .dwtag  DW_TAG_type_unit
    2984                      .dwmtype  $C$DW$T$6
    2985              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2986                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
